{
    "code": "ENVIRENG03",
    "credit points": "144",
    "name": "Environmental engineering",
    "core_units": [
        
        {
            "code": "ENE2021",
            "state": 1,
            "sem": 1,
            "credit points": "6",
            "name": "Energy and the environment",
            "unit_details": {
                "overview": "Overview Energy is all around us. From powering household appliances and gas heaters to driving a car across town, it is responsible for making everything that involves movement or activity happen. Although energy cannot be created or destroyed, it is still important for the available energy within our environment to be … For more content click the Read More button below.\nThis unit provides a qualitative and quantitative survey of the physics behind conventional and alternative energy sources. The choice of energy source is also assessed in terms of its environmental impacts, its dependence on critical or scarce resources and the social or political consequences of reliance on that energy source concerning long-term sustainability. Building services and transport are among the largest end-use sectors responsible for energy consumption. Their energy efficiency and decarbonisation will be reviewed. Electricity is one of the most important energy commodities. The discussion on its generation, supply and demand will be expanded.Energy is all around us. From powering household appliances and gas heaters to driving a car across town, it is responsible for making everything that involves movement or activity happen. Although energy cannot be created or destroyed, it is still important for the available energy within our environment to be conserved and used wisely. Our decisions on how we use energy impact the plant's natural systems in complex ways. It is vital that we choose our energy sources carefully and be mindful of the amount of energy we use. The true cost of energy is more than just dollars and cents; there are important environmental and political factors and consequences to consider.\nThis unit provides a qualitative and quantitative survey of the physics behind conventional and alternative energy sources. The choice of energy source is also assessed in terms of its environmental impacts, its dependence on critical or scarce resources and the social or political consequences of reliance on that energy source concerning long-term sustainability. Building services and transport are among the largest end-use sectors responsible for energy consumption. Their energy efficiency and decarbonisation will be reviewed. Electricity is one of the most important energy commodities. The discussion on its generation, supply and demand will be expanded.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ECE3051"
                    ]
                },
                "rules": null
            }
        },
        
        {
            "code": "CHE2164",
            "state": 1,
            "sem": 1,
            "credit points": "6",
            "name": "Thermodynamics 1",
            "unit_details": {
                "overview": "Overview Introduce fundamentals and applications of classical thermodynamics. Understand the concepts of heat, work, energy, and entropy, the First and Second Laws of Thermodynamics and their application. Introduction to the Carnot cycle and the concept of irreversibility. Understand the use of property diagrams in solving heat engine and heat pump cycles. … For more content click the Read More button below.Introduce fundamentals and applications of classical thermodynamics. Understand the concepts of heat, work, energy, and entropy, the First and Second Laws of Thermodynamics and their application. Introduction to the Carnot cycle and the concept of irreversibility. Understand the use of property diagrams in solving heat engine and heat pump cycles. Understand the operation and analysis of the Brayton, Otto, Diesel and Rankine cycles. Introduction to the analysis of refrigeration and heat pump cycles. Perform experiments to illustrate the concepts of Thermodynamics. Simple combustion processes. Renewable energy and its use in heating and electricity generation and environmental benefits.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [
                        "MEC2405",
                        "MAE2402"
                    ],
                    "AND": []
                },
                "rules": "Prerequisite - Completion of 24 credit points of units owned by the Faculty of Engineering. Students enrolled in E3008 are exempt. "
            }
        },
        
        {
            "code": "CIV2263",
            "state": 1,
            "sem": 0,
            "credit points": "6",
            "name": "Water systems",
            "unit_details": {
                "overview": "",
                "offerings": {},
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": " ",
            "state": 2
        },
        {
            "code": "CHE2162",
            "state": 1,
            "sem": 2,
            "credit points": "6",
            "name": "Material and energy balances",
            "unit_details": {
                "overview": "Overview This unit will introduce you to the fundamentals of material and energy balances through a systematic treatment of single and multiple-unit operations, reactive and non-reactive processes, recycle and bypass, extent of reactions, equations of state, vapour-liquid phase equilibrium, solid-liquid phase equilibrium, internal energy and enthalpy changes for process fluids undergoing … For more content click the Read More button below.This unit will introduce you to the fundamentals of material and energy balances through a systematic treatment of single and multiple-unit operations, reactive and non-reactive processes, recycle and bypass, extent of reactions, equations of state, vapour-liquid phase equilibrium, solid-liquid phase equilibrium, internal energy and enthalpy changes for process fluids undergoing specified changes in temperature, pressure, phase, reactions and chemical compositions and computer-aided simulation of process flow diagrams. A process simulation software will be used to aid in the solution of more complex systems.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        
        {
            "code": "ENG2005",
            "state": 1,
            "sem": 0,
            "credit points": "6",
            "name": "Advanced engineering mathematics",
            "unit_details": {
                "overview": "Overview This unit introduces advanced mathematical concepts required for all disciplines of engineering that extend on the concepts in ENG1005 Engineering mathematics.\nMajor concepts taught using engineering contexts include multivariable and vector calculus, Fourier series and partial differential equations. Specific topics include partial derivatives, double and triple integrals with change of … For more content click the Read More button below.This unit introduces advanced mathematical concepts required for all disciplines of engineering that extend on the concepts in ENG1005 Engineering mathematics.\nMajor concepts taught using engineering contexts include multivariable and vector calculus, Fourier series and partial differential equations. Specific topics include partial derivatives, double and triple integrals with change of coordinates, vector functions and operators, parametric curves and surfaces, periodic functions, Laplace transforms, ODE boundary value problems, partial differential equation solution techniques and applications.Read More about Overview",
                "offerings": {
                    "NOV12-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "November teaching period",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1014",
                        "ENG1060"
                    ],
                    "AND": [
                        "ENG1005",
                        "ENG1005"
                    ]
                },
                "prohibition": {
                    "OR": [
                        "MTH2010",
                        "MTH2015"
                    ],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "ENE2503",
            "state": 1,
            "sem": 2,
            "credit points": "6",
            "name": "Materials properties and recycling",
            "unit_details": {
                "overview": "Overview This unit will give you an appreciation of materials, their place in the environment and ways of dealing with their presence in the waste stream. You will gain a basic understanding of the structure and properties of the main classes of materials: metals, polymers and ceramics. You will learn about … For more content click the Read More button below.This unit will give you an appreciation of materials, their place in the environment and ways of dealing with their presence in the waste stream. You will gain a basic understanding of the structure and properties of the main classes of materials: metals, polymers and ceramics. You will learn about the ways in which these different materials can be disposed of, ranging from incineration, recycling and degradation, and the technologies involved in these processes. The advantages of these methods, as opposed simply to landfill, will be discussed. Methods of sorting of different materials from the waste stream into their various components will also be covered.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": " ",
            "state": 2
        },
        
        {
            "code": "CIV3248",
            "state": 1,
            "sem": 1,
            "credit points": "6",
            "name": "Groundwater and environmental geomechanics",
            "unit_details": {
                "overview": "Overview Overview of concepts relating to groundwater resources and seepage, with emphasis on seepage containment in reservoirs, ponds, soil pollution and its avoidance, focusing on soil behaviour and its effect on seepage, groundwater percolation and migration of contaminant in the nearfield of waste containment facilities. Focus will also be on the … For more content click the Read More button below.Overview of concepts relating to groundwater resources and seepage, with emphasis on seepage containment in reservoirs, ponds, soil pollution and its avoidance, focusing on soil behaviour and its effect on seepage, groundwater percolation and migration of contaminant in the nearfield of waste containment facilities. Focus will also be on the function, design and construction of engineered soil barriers to prevent leakage from water reservoirs, ponds or to isolate different types of waste.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        
        {
            "code": "CIV3285",
            "state": 1,
            "sem": 1,
            "credit points": "6",
            "name": "Engineering hydrology",
            "unit_details": {
                "overview": "Overview The unit introduces you to the basic concepts of hydrology and their application in the engineering practice. The key features of the main components of the hydrologic cycle (i.e., rainfall, streamflow, and evapotranspiration) are presented along with methods to measure and model them in natural and urban environments. Particular emphasis … For more content click the Read More button below.The unit introduces you to the basic concepts of hydrology and their application in the engineering practice. The key features of the main components of the hydrologic cycle (i.e., rainfall, streamflow, and evapotranspiration) are presented along with methods to measure and model them in natural and urban environments. Particular emphasis is on flooding and designed floods. The unit also provides an overview of the various water systems in an urban environment, their functions and modes of operation, and the influence of climate variability on urban requirements in terms of management and discharge of stormwater. A final aspect is the activation and transport of contaminants within the urban water cycle.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "CIV2263",
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prohibition: CIV3264 E6011 Master of Professional Engineering - You are exempt from the prerequisite rule if you are enrolled in this course. "
            }
        },
        {
            "code": "BTX3100",
            "state": 1,
            "sem": 1,
            "credit points": "6",
            "name": "Sustainability regulation for business",
            "unit_details": {
                "overview": "Overview This unit introduces you to the legal risks and responsibilities faced by business enterprises arising from regulation and compliance obligations associated with global environmental and sustainability challenges. It focuses on developing vocational skills required by businesses transitioning to more sustainable business models.This unit introduces you to the legal risks and responsibilities faced by business enterprises arising from regulation and compliance obligations associated with global environmental and sustainability challenges. It focuses on developing vocational skills required by businesses transitioning to more sustainable business models.Read More about Overview",
                "offerings": {
                    "S1-01-CAULFIELD-ON-CAMPUS": {
                        "location": [
                            "Caulfield"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": " ",
            "state": 2
        },
        
        {
            "code": "ENE3606",
            "state": 1,
            "sem": 2,
            "credit points": "6",
            "name": "The air environment",
            "unit_details": {
                "overview": "Overview Through lectures, practice classes, individual assignments and tests, you should develop knowledge of air pollution issues, assessment and control of pollutants from emission sources. The unit focusses on air pollution sources, emissions behaviour, pollutant pathways, receptor impacts and the associated national legislation and international treaties. The unit includes atmospheric stability … For more content click the Read More button below.Through lectures, practice classes, individual assignments and tests, you should develop knowledge of air pollution issues, assessment and control of pollutants from emission sources. The unit focusses on air pollution sources, emissions behaviour, pollutant pathways, receptor impacts and the associated national legislation and international treaties. The unit includes atmospheric stability conditions, pollutant transport models, air pollution control strategies and factors important in control equipment or schemes. The unit also encompasses climate change, greenhouse gas emissions sources and carbon accounting as well as national and international climate change mitigation strategies and adaptation approaches.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1001",
                        "ENG1002",
                        "ENG1011",
                        "ENG1012"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        
        {
            "code": "ENE3032",
            "state": 1,
            "sem": 2,
            "credit points": "6",
            "name": "Fate and transport of contaminants",
            "unit_details": {
                "overview": "Overview This unit will equip you with an understanding of contaminant fate and transport through the environment. A short review of the key chemistry-related to environmental contaminants will be included. You will then cover the principles of contaminant fate and transport and learn about contaminant fate and transport in air, water … For more content click the Read More button below.This unit will equip you with an understanding of contaminant fate and transport through the environment. A short review of the key chemistry-related to environmental contaminants will be included. You will then cover the principles of contaminant fate and transport and learn about contaminant fate and transport in air, water and soil. The opportunities for management, mitigation and remediation will also be discussed.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisites: Completion of 72 engineering credit points "
            }
        },
        {
            "code": "ENE3031",
            "state": 1,
            "sem": 2,
            "credit points": "6",
            "name": "Building sustainability",
            "unit_details": {
                "overview": "Overview This unit will address issues of sustainability in the built environments from a number of perspectives and provide you with a variety of lenses in which the built environments interlock with the human and natural system. You will apply skills and knowledge from this unit, and use a rigorous process … For more content click the Read More button below.This unit will address issues of sustainability in the built environments from a number of perspectives and provide you with a variety of lenses in which the built environments interlock with the human and natural system. You will apply skills and knowledge from this unit, and use a rigorous process of design, simulation, validation, and evaluation, to solve real-world problems. Topics include passive and active technologies, building energy simulation and modelling of different domains in indoor environmental quality, field data acquisition and analysis, building codes and rating system, and the topics intersecting with other fields, such as ubiquitous computing, architecture design, public health, high-performance materials, etc.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG2005",
                        "ENE2503"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": " ",
            "state": 2
        },
        
        {
            "code": "ENG4701",
            "state": 1,
            "sem": 0,
            "credit points": "6",
            "name": "Final year project A",
            "unit_details": {
                "overview": "Overview The aim of this capstone unit is to provide an opportunity for you to undertake a substantial individual or small group project. Projects undertaken will integrate and build on content from earlier stages of the course. This unit is the first part of a two-unit project.The aim of this capstone unit is to provide an opportunity for you to undertake a substantial individual or small group project. Projects undertaken will integrate and build on content from earlier stages of the course. This unit is the first part of a two-unit project.",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITE: 18 credit points at level three in engineering or FIT-coded study\nCOREQUISITE: ENG0001 (Clayton-based students) "
            }
        },
        
        {
            "code": "CIV4286",
            "state": 1,
            "sem": 0,
            "credit points": "6",
            "name": "Project management for civil engineers",
            "unit_details": {
                "overview": "Overview Need for project management; the project management context; fundamental project management processes and knowledge; tools and techniques for a structured application to project selection and planning including project brief/ideation/concept embodiment decision support tools, numeric profitability and scoring techniques, and EMV/decision tree risk quantification tools; analytical tool application to project scope, … For more content click the Read More button below.Need for project management; the project management context; fundamental project management processes and knowledge; tools and techniques for a structured application to project selection and planning including project brief/ideation/concept embodiment decision support tools, numeric profitability and scoring techniques, and EMV/decision tree risk quantification tools; analytical tool application to project scope, time, cost, risk, human resource, OHS and quality issues. Review of company financial management concepts.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite: Completion of 72 credit points of engineering study.\nE6011 Master of Professional Engineering - You are exempt from the prerequisite rule if you are enrolled in this course. "
            }
        },
        
        {
            "code": "ENE4042",
            "state": 1,
            "sem": 1,
            "credit points": "6",
            "name": "Environmental impact and risk assessment",
            "unit_details": {
                "overview": "Overview This unit aims to develop an understanding of the role and basis for environmental impact assessment (EIA), environmental risk assessment (ERA) and environmental management systems (EMS). The unit focuses on the processes involved in producing a comprehensive approach to identifying, assessing and planning management processes, with a particular emphasis on … For more content click the Read More button below.This unit aims to develop an understanding of the role and basis for environmental impact assessment (EIA), environmental risk assessment (ERA) and environmental management systems (EMS). The unit focuses on the processes involved in producing a comprehensive approach to identifying, assessing and planning management processes, with a particular emphasis on synthesising technical, regulatory and community issues. The unit aims to encourage you to integrate your existing knowledge in environmental engineering, applying it to real projects. Through lectures, practice classes, individual assignments and group project work, you should develop skills and knowledge in preparing major EIA, ERA and EMS reports, your presentation and communication as well as your engineering context.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [
                        "ENE3608",
                        "ENE4607"
                    ],
                    "AND": []
                },
                "rules": "Prerequisites: Completion of 96 credit points in engineering study or with permission "
            }
        },
        {
            "code": " ",
            "state": 2
        },
        
        {
            "code": "ENG4702",
            "state": 1,
            "sem": 0,
            "credit points": "6",
            "name": "Final year project B",
            "unit_details": {
                "overview": "Overview This unit is a continuation of ENG4701 Final year project A. The aim of this capstone unit is to provide an opportunity for you to undertake a substantial individual or small group project. Projects undertaken will integrate and build on content from earlier stages of the course.This unit is a continuation of ENG4701 Final year project A. The aim of this capstone unit is to provide an opportunity for you to undertake a substantial individual or small group project. Projects undertaken will integrate and build on content from earlier stages of the course.",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG4701"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "CIV4212",
            "state": 1,
            "sem": 2,
            "credit points": "6",
            "name": "Civil and environmental engineering practice",
            "unit_details": {
                "overview": "Overview This is a capstone unit drawing together the material taught in previous units. The objective is to utilise this knowledge to undertake a multi-disciplinary open ended design task for a specified civil engineering development, in groups, mirroring the expectations of working in professional practice. The design project will vary from … For more content click the Read More button below.This is a capstone unit drawing together the material taught in previous units. The objective is to utilise this knowledge to undertake a multi-disciplinary open ended design task for a specified civil engineering development, in groups, mirroring the expectations of working in professional practice. The design project will vary from year to year but will include aspects of structural, water, geomechanics, environmental engineering and transport design with an emphasis on sustainable design.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisites:\nCivil engineering students: (CIV2282 or CIV3283) and CIV3221 and CIV3247 and CIV3248 and (CIV3294 or CIV3284 or CIV2226) and (CIV3285 or CIV3264)\nEnvironmental engineering students: (ENE3031 and ENE3032) or [ENE3606 and (ENE2021 or ENE3048) and (CIV3285 or CIV3264)] "
            }
        },
        {
            "code": "ENE4041",
            "state": 1,
            "sem": 2,
            "credit points": "6",
            "name": "Soil remediation and solid waste management",
            "unit_details": {
                "overview": "Overview This unit will equip you with an understanding of solid waste management practices, including soil remediation techniques. You will cover the types of wastes as well as typical contaminants found in different waste. Various waste management options will be covered as well as the concepts of integrated or comprehensive waste … For more content click the Read More button below.This unit will equip you with an understanding of solid waste management practices, including soil remediation techniques. You will cover the types of wastes as well as typical contaminants found in different waste. Various waste management options will be covered as well as the concepts of integrated or comprehensive waste management practices, including the development of waste management plans. Additionally, you will learn about soil remediation options and technologies as well as the development of remediation action plans.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENE3032"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": " ",
            "state": 2
        },


        {
            "code": "ATS2548",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Environmental policy and management",
            "unit_details": {
                "overview": "Overview This unit provides an introduction to different perspectives and issues that influence climate and environmental policy and management. It examines the rise of environmentalism as a broad based movement and how it has led to the framing of climate change and other environmental problems by policy makers and managers in … For more content click the Read More button below.This unit provides an introduction to different perspectives and issues that influence climate and environmental policy and management. It examines the rise of environmentalism as a broad based movement and how it has led to the framing of climate change and other environmental problems by policy makers and managers in terms of state regulation, market-based, and citizen participation approaches. Themes include western ideas of property rights, neoliberalism and environmental governance, scientisation of environmental knowledge, Indigenous management approaches, policy internationalisation and corporate sustainability.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite: Twelve credit points of first-year Arts or at least 2 of BIO1042, CHM1011 or EAE1022 "
            }
        },
        {
            "code": "BIO2011",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Ecology and biodiversity",
            "unit_details": {
                "overview": "Overview This unit is an introduction to ecology; the scientific study of the interactions between organisms and their environment. Ecology and biodiversity forms the foundation for understanding conservation and the management of genetics, species and ecosystem diversity. The approach taken is to address core ecological theory, but with an emphasis on … For more content click the Read More button below.This unit is an introduction to ecology; the scientific study of the interactions between organisms and their environment. Ecology and biodiversity forms the foundation for understanding conservation and the management of genetics, species and ecosystem diversity. The approach taken is to address core ecological theory, but with an emphasis on contemporary management issues and applications. Topics include the scope and approaches of ecological enquiry; abiotic and biotic factors determining distributions; population growth and regulation; species interactions; patterns and maintenance of biodiversity; food web analysis; disturbance and succession; and production ecology and nutrient cycling. Particular emphasis is placed on integrating ecological processes across spatial and temporal scales. Practical work will be completed via a field excursion together with in-laboratory practical sessions.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITE: Enrolment in the Master of Environment and Sustainability or 24 points of level one units, which includes 6 credit points from BIO units or one of ATS1301, ATS1309, ATS1310, BMS1011 or BMS1021. For Bachelor of Environmental Engineering and associated double degree students only: ENE1621 Environmental engineering and BIO2040 Conservation biology will be required as either prerequisite or corequisite units. "
            }
        },
        {
            "code": "BIO2040",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Conservation biology",
            "unit_details": {
                "overview": "Overview This unit deals with threats to the environment associated with human activities and potential solutions to redress their impacts. Recent losses of biota have been caused by habitat loss and degradation, climate change and pollution, the introduction of exotic species and overexploitation of natural resources. Science-based conservation measures are explored … For more content click the Read More button below.This unit deals with threats to the environment associated with human activities and potential solutions to redress their impacts. Recent losses of biota have been caused by habitat loss and degradation, climate change and pollution, the introduction of exotic species and overexploitation of natural resources. Science-based conservation measures are explored that may reduce loss of biodiversity/ecosystem function, including habitat preservation and restoration, combating climate change, and intensive conservation of species. We analyse how conservation efforts may involve trade-offs with biological, economic, social and political factors.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITE: Enrolment in the Bachelor of Environmental Engineering or Master of Environment and Sustainability or 24 points of level one units.\n  PROHIBITION: ENV2726, BIO2042 "
            }
        },
        {
            "code": "CIV2242",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Geomechanics 1",
            "unit_details": {
                "overview": "Overview The unit covers all aspects of geomechanics at an elementary level, as well as basic engineering geology, formation and weathering processes, sedimentary, igneous and metamorphic rocks, soil- and rock-forming minerals, geological mapping and modelling, site investigations, in-situ testing, engineering classification of soil and rock, weight-volume relationship, and the two/three phase … For more content click the Read More button below.The unit covers all aspects of geomechanics at an elementary level, as well as basic engineering geology, formation and weathering processes, sedimentary, igneous and metamorphic rocks, soil- and rock-forming minerals, geological mapping and modelling, site investigations, in-situ testing, engineering classification of soil and rock, weight-volume relationship, and the two/three phase model. It also includes 2D seepage, effective stress theory, stresses in a soil mass and shear strength.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1011",
                        "ENG1001",
                        "ENG1060"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prohibition: CIV2241\nE6011 Master of Professional Engineering - You are exempt from the prerequisite rule if you are enrolled in this course. "
            }
        },
        {
            "code": "CIV2282",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Transport and traffic engineering",
            "unit_details": {
                "overview": "Overview This unit introduces you to the field of transport and traffic engineering. The fundamental parameters used to describe deterministic traffic flow behaviour are introduced along with a simple traffic flow model. Stochastic traffic flow behaviour is described via random distributions. Fundamental queuing theory of traffic is briefly introduced. The procedures … For more content click the Read More button below.This unit introduces you to the field of transport and traffic engineering. The fundamental parameters used to describe deterministic traffic flow behaviour are introduced along with a simple traffic flow model. Stochastic traffic flow behaviour is described via random distributions. Fundamental queuing theory of traffic is briefly introduced. The procedures used to analyse the capacity and level of service are explored for both unsignalised and signalised intersections. The principle of traffic signal operation at isolated intersections is presented. Traffic surveys are discussed. You are introduced to contemporary road safety issues as well. Public transport is considered at the route level concerning the determination of fleet size and factors affecting operational capacity and reliability. Non-motorised transport including cyclists and pedestrians is also considered. In addition, the unit addresses Intelligent Transportation Systems (ITS). Consideration will also be given to the role of communications in the practice of transport and traffic engineers. To enhance your understanding of the unit content from practical points of view, some experts will be invited to give lectures on their relevant work. Throughout the whole unit, the focus is primarily on surface transport systems and applications of advanced technologies therein.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "ECC2800",
            "state": 10,
            "sem": 0,
            "credit points": "6",
            "name": "Prosperity, poverty and sustainability in a globalised world",
            "unit_details": {
                "overview": "",
                "offerings": {},
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "CHE3161",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Chemistry and chemical thermodynamics",
            "unit_details": {
                "overview": "Overview This unit covers thermodynamics from a chemical engineering viewpoint. Content will cover basic concepts and the use of: thermodynamic functions such as free energy, enthalpy, and entropy; estimation of properties of pure compounds and mixtures; description of solution thermodynamics and its applications, equilibrium phase diagrams and chemical reaction equilibria.This unit covers thermodynamics from a chemical engineering viewpoint. Content will cover basic concepts and the use of: thermodynamic functions such as free energy, enthalpy, and entropy; estimation of properties of pure compounds and mixtures; description of solution thermodynamics and its applications, equilibrium phase diagrams and chemical reaction equilibria.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "CHE2164"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "E6011 Master of Professional Engineering - You are exempt from the prerequisite rule if you are enrolled in this course. "
            }
        },
        {
            "code": "CHE3163",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Sustainable processing 1",
            "unit_details": {
                "overview": "Overview This unit will explore cleaner production and sustainability concepts, the principles of process design and development and associated flow sheets, systematic approaches to waste minimisation in process and utility systems, the methodology of life cycle assessment and application of life cycle assessment to processes and products. These themes will be … For more content click the Read More button below.This unit will explore cleaner production and sustainability concepts, the principles of process design and development and associated flow sheets, systematic approaches to waste minimisation in process and utility systems, the methodology of life cycle assessment and application of life cycle assessment to processes and products. These themes will be developed in lectures and supported by your project work related to selected industrial processes.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "CHE2162"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "CHE3165",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Separation processes",
            "unit_details": {
                "overview": "Overview A comprehensive treatment of the fundamentals of separation processes of interest to the chemical industry is covered. The fundamental principles of mass transfer are introduced and extended to include principles of interfacial mass transfer and simultaneous heat and mass transfer. General mass and energy balances are derived for equilibrium staged … For more content click the Read More button below.A comprehensive treatment of the fundamentals of separation processes of interest to the chemical industry is covered. The fundamental principles of mass transfer are introduced and extended to include principles of interfacial mass transfer and simultaneous heat and mass transfer. General mass and energy balances are derived for equilibrium staged processes. The applications of these principles are made to the unit operations of distillation (binary and multi-component), liquid-liquid extraction, gas-liquid absorption and stripping, adsorption and ion-exchange, and membrane separation processes.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "CHE2162",
                        "CHE2163"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "E6011 Master of Professional Engineering - You are exempt from the prerequisite rule if you are enrolled in this course. "
            }
        },
        {
            "code": "CHE3166",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Process design",
            "unit_details": {
                "overview": "Overview This unit will develop four important inter-related themes associated with the detailed design of chemical equipment and processes. These themes are process safety, mechanical integrity, equipment selection, and process operability (including piping and instrumentation). These themes will be developed using a mixture of lectures, practice classes and a team-based detailed … For more content click the Read More button below.This unit will develop four important inter-related themes associated with the detailed design of chemical equipment and processes. These themes are process safety, mechanical integrity, equipment selection, and process operability (including piping and instrumentation). These themes will be developed using a mixture of lectures, practice classes and a team-based detailed design project.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "CHE2163",
                        "CHE2164"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "E6011 Master of Professional Engineering - You are exempt from the prerequisite rule if you are enrolled in this course. "
            }
        },
        {
            "code": "CIV3204",
            "state": 10,
            "sem": 0,
            "credit points": "6",
            "name": "Engineering investigation",
            "unit_details": {
                "overview": "",
                "offerings": {},
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "CIV3247",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Geomechanics 2",
            "unit_details": {
                "overview": "Overview This unit covers all aspects of geomechanics at intermediate levels, including consolidation theory of soils, estimation of consolidation and creep settlements for different types of soils, advanced topics on shear strength of soils under various drainage conditions, stress-paths and laboratory triaxial tests, determination of drained and undrained shear strength parameters, … For more content click the Read More button below.This unit covers all aspects of geomechanics at intermediate levels, including consolidation theory of soils, estimation of consolidation and creep settlements for different types of soils, advanced topics on shear strength of soils under various drainage conditions, stress-paths and laboratory triaxial tests, determination of drained and undrained shear strength parameters, critical state mechanics and various failure criteria, soil and rock slope analysis, earth pressure theory and design of retaining walls. Applications to practical problems are key aspects of the learning covered.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "CIV2242",
                        "CIV2206"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "RSE3020",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Resource estimation",
            "unit_details": {
                "overview": "Overview The mineral inventory of a company is quantified through resource or reserve estimates with associated error levels that, in many cases, are unknown. The estimation procedure used by a geologist or engineer should incorporate efforts to minimise errors and assumptions at every level of decision.\nThis unit focuses on resource … For more content click the Read More button below.The mineral inventory of a company is quantified through resource or reserve estimates with associated error levels that, in many cases, are unknown. The estimation procedure used by a geologist or engineer should incorporate efforts to minimise errors and assumptions at every level of decision.\nThis unit focuses on resource and reserve estimation of mineral ores and hydrocarbon deposits, with particular focus on the influence of the in situ geological conditions. You will learn the basics of resource and reserve reporting with particular reference to applicable industry codes. Resource modelling will be taught through computer applications with special consideration of geostatistical techniques.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prohibition: MNE3020 "
            }
        },
        {
            "code": "RSE3030",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Ventilation for surface and underground spaces",
            "unit_details": {
                "overview": "Overview This unit provides the fundamentals of ventilation for surface and underground spaces, including properties of air, gas, heat, dust and pollutants control, principles of airflow, ventilation network theory, as well as surface and underground ventilation systems design, with the emphasis on analysis and practical application.This unit provides the fundamentals of ventilation for surface and underground spaces, including properties of air, gas, heat, dust and pollutants control, principles of airflow, ventilation network theory, as well as surface and underground ventilation systems design, with the emphasis on analysis and practical application.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "CIV2263",
                        "MEC2404",
                        "CHE2161"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prohibition: MNE3030 "
            }
        },
        {
            "code": "RSE3040",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Mining systems",
            "unit_details": {
                "overview": "Overview This unit covers underground and surface mining methods and equipment selection for the optimum performance of underground and surface operations. The unit provides a detailed understanding of mining processes and systems engineering along with their key drivers in modern open-cut and underground operations. For each of the mining methods explored … For more content click the Read More button below.This unit covers underground and surface mining methods and equipment selection for the optimum performance of underground and surface operations. The unit provides a detailed understanding of mining processes and systems engineering along with their key drivers in modern open-cut and underground operations. For each of the mining methods explored consideration is given to the mining cycle and access design - eg shafts and/or declines and materials handling. Through practical applications, you will explore the selection of optimal mining systems. For each of the mining systems covered, core risk identification and mitigation are considered.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prohibitions: MNE3040 and MNE3050 "
            }
        },
        {
            "code": "RSE3060",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Rock breakage",
            "unit_details": {
                "overview": "Overview This unit will address the mechanics and practical applications and current technologies in rock breakage through machine excavation and drilling and blasting. The machine excavation includes fundamentals of rock cutting, cutting with discs and design of cutter heads along with the assessment of rock cuttability applicable to soft and hard … For more content click the Read More button below.This unit will address the mechanics and practical applications and current technologies in rock breakage through machine excavation and drilling and blasting. The machine excavation includes fundamentals of rock cutting, cutting with discs and design of cutter heads along with the assessment of rock cuttability applicable to soft and hard rock underground spaces, such as civil and water drainage tunnels and subways. The drilling and blasting component includes the impact of blasting not on the behaviour of rock mass properties, structure and discontinuities and rock breakage and fragmentation. Drilling and blasting techniques will be explored in relation to design, safety, security, environmental impacts and relevant legislation. This will be done in the context of mine-to-mill.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "CIV2242"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prohibition: MNE3060 "
            }
        },
        {
            "code": "RSE3141",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Solar energy",
            "unit_details": {
                "overview": "Overview This unit covers concepts associated with the solar energy industry including; the characteristics of solar radiation and solar collectors including efficiency evaluation and prediction of long-term performance; system modelling; energy storage; computer simulation and modelling of performance and the economics and financing of solar energy projects.This unit covers concepts associated with the solar energy industry including; the characteristics of solar radiation and solar collectors including efficiency evaluation and prediction of long-term performance; system modelling; energy storage; computer simulation and modelling of performance and the economics and financing of solar energy projects.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG2005",
                        "MTH2010",
                        "MTH2015"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "RSE3241",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Hydropower",
            "unit_details": {
                "overview": "Overview This unit covers all aspects of hydropower, including the fundamental physics behind energy storage in potential energy, design of hydropower systems (dam walls and reservoirs, penstock piping and tunnelling, power house design (turbine and generator), tailrace and electrical connection). The operation of hydropower stations and their influence on the integrated … For more content click the Read More button below.This unit covers all aspects of hydropower, including the fundamental physics behind energy storage in potential energy, design of hydropower systems (dam walls and reservoirs, penstock piping and tunnelling, power house design (turbine and generator), tailrace and electrical connection). The operation of hydropower stations and their influence on the integrated electrical system. The unit covers recent developments in hydropower, in particular, the current trend towards more pumped hydro energy storage. Lectures will be delivered by both academic staff and industry experts who work on real-world hydropower projects.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005",
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "RSE3243",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Bioenergy",
            "unit_details": {
                "overview": "Overview This unit provides foundational knowledge of the bioenergy industry, including feedstocks, processing and end-use of products. The unit provides insight into biomass energy resources and bioenergy technologies, including the properties and characteristics of the resources, conversion and utilisation processes, as well as industrial application. Economic cost-effectiveness will be examined. You … For more content click the Read More button below.This unit provides foundational knowledge of the bioenergy industry, including feedstocks, processing and end-use of products. The unit provides insight into biomass energy resources and bioenergy technologies, including the properties and characteristics of the resources, conversion and utilisation processes, as well as industrial application. Economic cost-effectiveness will be examined. You will also conduct a lifecycle analysis of the various pathways to determine the energy return on energy invested. Other issues, such as impacts on food availability, land availability and the social and political impacts, will also be covered.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "CIV4248",
            "state": 10,
            "sem": 0,
            "credit points": "6",
            "name": "Ground hazards engineering",
            "unit_details": {
                "overview": "Overview Geotechnical engineering concepts applied to solve or minimise geo-hazard problems specific to waste containment facilities, contaminated sites and redevelopment and construction on marginal land. The unit focuses on geotechnical aspects of ground improvement, as well as in the analysis, design and construction involving projects located on marginal land. Learning through … For more content click the Read More button below.Geotechnical engineering concepts applied to solve or minimise geo-hazard problems specific to waste containment facilities, contaminated sites and redevelopment and construction on marginal land. The unit focuses on geotechnical aspects of ground improvement, as well as in the analysis, design and construction involving projects located on marginal land. Learning through failure cases to highlight potential pitfalls of the discipline is an important component in this unit.Read More about Overview",
                "offerings": {},
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "CIV3248"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "CIV4249",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Foundation engineering",
            "unit_details": {
                "overview": "Overview This unit introduces foundation systems and design principles with reference to the geological context of a project. It also addresses how to determine relevant foundation design parameters from field and laboratory tests. It teaches the detailed design of shallow foundations (isolated footing, raft foundation) for simple and complex ground and … For more content click the Read More button below.This unit introduces foundation systems and design principles with reference to the geological context of a project. It also addresses how to determine relevant foundation design parameters from field and laboratory tests. It teaches the detailed design of shallow foundations (isolated footing, raft foundation) for simple and complex ground and load conditions. Finally, the design of single and group pile foundations in soils and rocks subjected to axial and lateral loads are taught including an introduction to pile integrity and load tests.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "CIV3247"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "CIV4261",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Integrated urban water management",
            "unit_details": {
                "overview": "Overview This unit is designed to give a broad understanding of the integrated management of water resources within an urban context. This is a field of practice growing in importance in Australia and overseas, and will equip you well for careers in urban water management. The scope of the course will … For more content click the Read More button below.This unit is designed to give a broad understanding of the integrated management of water resources within an urban context. This is a field of practice growing in importance in Australia and overseas, and will equip you well for careers in urban water management. The scope of the course will be multi-disciplinary, giving you an understanding of the range of perspectives required in integrated urban water management (IUWM) covering structural and non-structural techniques available. The social science and ecological perspectives will be emphasised to give an appreciation of the multi-disciplinary nature of IUWM. Software packages such as MUSIC and Aquacycle will be introduced.Read More about Overview",
                "offerings": {
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "CIV3285"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisites: Or CIV3264 "
            }
        },
        {
            "code": "CIV4268",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Water resources management",
            "unit_details": {
                "overview": "Overview This unit considers the quality and quantity aspects of water resources management. Tools and techniques appropriate for design and analysis of water resource systems are introduced, starting from a development of quantitative hydrologic modelling and extending to quantitative prediction of water quality transformations. The fundamental principles of water quantity and … For more content click the Read More button below.This unit considers the quality and quantity aspects of water resources management. Tools and techniques appropriate for design and analysis of water resource systems are introduced, starting from a development of quantitative hydrologic modelling and extending to quantitative prediction of water quality transformations. The fundamental principles of water quantity and quality modelling are also applied within a framework that allows the assessment of water quality in various watercourses.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITE: Completion of 96 cp in engineering study (ENG2005 included) "
            }
        },
        {
            "code": "CIV4283",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Transport planning",
            "unit_details": {
                "overview": "Overview This unit examines contemporary issues in urban transport planning. The concept of sustainable transport is introduced along with the steps in the transport planning process. Emphasis is placed on the interrelationship between transport and land use planning and on the range of supply and demand oriented approaches that can be … For more content click the Read More button below.This unit examines contemporary issues in urban transport planning. The concept of sustainable transport is introduced along with the steps in the transport planning process. Emphasis is placed on the interrelationship between transport and land use planning and on the range of supply and demand oriented approaches that can be used to enhance the sustainability of urban transport systems. Strategic transport network models are introduced with consideration given to the calibration and application of those models. Travel survey methods are considered and the relationship between survey design, survey administration and data quality is explored.Read More about Overview",
                "offerings": {
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite: CIV2282\nProhibitions: CIV4293 "
            }
        },
        {
            "code": "CIV4287",
            "state": 10,
            "sem": 0,
            "credit points": "6",
            "name": "Road engineering",
            "unit_details": {
                "overview": "",
                "offerings": {},
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "CIV4288",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Water treatment",
            "unit_details": {
                "overview": "Overview This unit provides an overview of water and wastewater systems in urban environments. The overview focuses on these systems' functions regarding the provision of drinking water and wastewater treatment and their modes of operation. Specific topics include water supply, water use and consumption, drinking water treatment and distribution, wastewater characterisation … For more content click the Read More button below.This unit provides an overview of water and wastewater systems in urban environments. The overview focuses on these systems' functions regarding the provision of drinking water and wastewater treatment and their modes of operation. Specific topics include water supply, water use and consumption, drinking water treatment and distribution, wastewater characterisation and secondary treatment, sludge handling, resource recovery and nature-based solutions for wastewater treatment. Treatment process theory and design are covered in this unit for both drinking water and wastewater treatment systems.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "CIV2263",
                        "CIV3285"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prohibition: CIV3264 "
            }
        },
        {
            "code": "MTE4593",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Materials and sustainability",
            "unit_details": {
                "overview": "Overview This unit provides an introduction to the political, social and environmental background to materials usage. Major technologies relating to the production, sustainable use and recycling of metals, plastics, glass, electronics, paper and ceramic materials are discussed. Various options involving materials substitution, reclamation, energy recovery and disposal are critically evaluated. The … For more content click the Read More button below.This unit provides an introduction to the political, social and environmental background to materials usage. Major technologies relating to the production, sustainable use and recycling of metals, plastics, glass, electronics, paper and ceramic materials are discussed. Various options involving materials substitution, reclamation, energy recovery and disposal are critically evaluated. The unit considers the economics of materials production, as well as 'cradle-to-grave' analyses of materials, including products and byproducts of the nuclear fuel cycle. In particular, it looks at various life-cycle analysis techniques. We will examine the impact of population, affluence and technology changes on population and ecological footprints with the arrival of the current \"Anthropocene Era\".Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "MTE5193"
                    ]
                },
                "rules": "PREREQUISITE: Completion of 96 credit points in engineering study "
            }
        },
        {
            "code": "BMS1021",
            "state": 3,
            "sem": 1,
            "credit points": "6",
            "name": "Cells, tissues and organisms",
            "units": {
                "overview": "Overview This unit introduces the student to the fundamental units of life (the cells) and explores how cells come together to form primary tissues which subsequently combine to form the organ systems and ultimately the living organism.\nCellular structure and metabolism is studied including the chemical constituents of living cells and … For more content click the Read More button below.\nThe unit also introduces students to the microbial world and explores the structure and function of the immune system and how the body develops an immune response.This unit introduces the student to the fundamental units of life (the cells) and explores how cells come together to form primary tissues which subsequently combine to form the organ systems and ultimately the living organism.\nCellular structure and metabolism is studied including the chemical constituents of living cells and the biological reactions that take place in them. Basic developmental biology concepts associated with the patterning of the body plan and embryological origins of cells and tissues are introduced.\nThe unit also introduces students to the microbial world and explores the structure and function of the immune system and how the body develops an immune response.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [
                        "BIO1011",
                        "BIO1022"
                    ],
                    "AND": []
                },
                "rules": "Corequisite: Must be enrolled in one of the following:\n\nBachelor of Biomedical Science (including double degree programs)\nBachelor of Biomedical Science (Scholar Program)\nBachelor of Engineering (honours) (including double degree programs)\n "
            },
            "minor": []
        },
        {
            "code": "CHE1010",
            "state": 3,
            "Sem": 2,
            "credit points": "6",
            "name": "Grand challenges in chemical engineering: Delivering sustainable food, water and energy",
            "units": {
                "overview": "Overview Providing food, water and energy to the world's people in an environmentally sustainable manner is an engineering grand challenge that must be solved in a concerted manner. New scientific discovery and engineering processes are urgently needed, and chemical engineering must provide key solutions in all three areas. This unit will … For more content click the Read More button below.\nThe basic principles of the discipline will be introduced, including heat and material transfer, thermodynamics, fluid dynamics, (bio)chemical reactions engineering and process design/control. Chemical engineering concepts will be developed within workshops and practicals complemented with practical laboratory experience. There will also be an opportunity for activities where, within teams, you will design chemical engineering solutions to important issues or opportunities.\nThis unit is aimed at all engineering students and may be of special interest to those attracted to environmental engineering, biological engineering, civil engineering (water specialisation) and chemical engineering.Providing food, water and energy to the world's people in an environmentally sustainable manner is an engineering grand challenge that must be solved in a concerted manner. New scientific discovery and engineering processes are urgently needed, and chemical engineering must provide key solutions in all three areas. This unit will explore the core concepts and applications of sustainable chemical engineering through interesting case studies drawn from food, water and energy engineering presented by a mix of academic specialists and industry representatives in each area.\nThe basic principles of the discipline will be introduced, including heat and material transfer, thermodynamics, fluid dynamics, (bio)chemical reactions engineering and process design/control. Chemical engineering concepts will be developed within workshops and practicals complemented with practical laboratory experience. There will also be an opportunity for activities where, within teams, you will design chemical engineering solutions to important issues or opportunities.\nThis unit is aimed at all engineering students and may be of special interest to those attracted to environmental engineering, biological engineering, civil engineering (water specialisation) and chemical engineering.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITES:\nAustralian VCE Mathematical methods (Units 3 & 4) or VCE Specialist mathematics (Units 3 & 4) or equivalent.\nCO-REQUISITE: \nYou must be enrolled in the Bachelor of Engineering (Honours) or an engineering double degree or with permission from the Faculty of Engineering. "
            },
            "minor": []
        },
        {
            "code": "CHM1011",
            "state": 3,
            "Sem": 1,
            "credit points": "6",
            "name": "Chemistry 1",
            "units": {
                "overview": "Overview This unit has been designed such that some previous understanding of chemistry is beneficial, but the unit is underpinned by a support structure for those who are relatively new to the subject. On completion of this unit, you will have gained an understanding of the main chemical principles underpining chemical … For more content click the Read More button below.This unit has been designed such that some previous understanding of chemistry is beneficial, but the unit is underpinned by a support structure for those who are relatively new to the subject. On completion of this unit, you will have gained an understanding of the main chemical principles underpining chemical element, chemical reactivity and equilibria.  A number of important topics including atomic structure, bonding and reaction stoichiometry will be introduced to prepare you for a deeper exploration of chemistry. The concepts developed within the workshops and tutorials are complemented through a laboratory program where you will have the opportunity to use a variety of analytical techniques and design your own experiments to solve a range of chemical problems.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PROHIBITION: CHM1051 "
            },
            "minor": []
        },
        {
            "code": "CHM1051",
            "state": 3,
            "Sem": 1,
            "credit points": "6",
            "name": "Chemistry 1 advanced",
            "units": {
                "overview": "Overview This unit has been designed for students who have demonstrated a strong aptitude for chemistry during secondary studies. On completion of this unit, you will be able to apply their understanding of the main chemical principles underpinning chemical elements, chemical reactivity and equilibria. A number of important topics including atomic … For more content click the Read More button below.This unit has been designed for students who have demonstrated a strong aptitude for chemistry during secondary studies. On completion of this unit, you will be able to apply their understanding of the main chemical principles underpinning chemical elements, chemical reactivity and equilibria. A number of important topics including atomic structure, bonding and reaction stoichiometry will be developed to prepare students for a deeper exploration of chemistry. The concepts developed within the workshops are complemented through an extended laboratory program where you will have the opportunity to use a variety of analytical techniques and design your own experiments to solve a range of chemical problems.Read More about Overview",
                "offerings": {
                    "OCT-MY-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "October intake teaching period, Malaysia campus",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITE: VCE Units 3 and 4 Chemistry (raw study score >=37) Or ATAR >=90 PROHIBITION: CHM1011, CHM1031 "
            },
            "minor": []
        },
        {
            "code": "ENE1621",
            "state": 3,
            "Sem": 1,
            "credit points": "6",
            "name": "Environmental engineering",
            "units": {
                "overview": "Overview Introduce concepts of sustainable development, the demands of population and economic growth, industrialisation and urbanisation, energy demand and usage, and human environmental disturbance. Two environmental case studies will be covered in detail, designed to illustrate by way of example many of the considerations that underpin many environmental issues/conflicts/ethics. These are … For more content click the Read More button below.Introduce concepts of sustainable development, the demands of population and economic growth, industrialisation and urbanisation, energy demand and usage, and human environmental disturbance. Two environmental case studies will be covered in detail, designed to illustrate by way of example many of the considerations that underpin many environmental issues/conflicts/ethics. These are climate change and sustainable cities. The multi-disciplinary nature of environmental problems is emphasised together with the need to understand and communicate with other professional and community groups.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            },
            "minor": []
        },
        {
            "code": "ENG1021",
            "state": 3,
            "Sem": 2,
            "credit points": "6",
            "name": "Spatial communication in engineering",
            "units": {
                "overview": "Overview This unit introduces the fundamentals of spatial communication in engineering. This project-oriented unit includes an introduction to engineering drawing, spatial measurement, and spatial visualisation. You will work with various spatial visualisation tools. Starting from hand sketching, you will learn how to produce engineering drawings, collect spatial data, and develop spatial … For more content click the Read More button below.This unit introduces the fundamentals of spatial communication in engineering. This project-oriented unit includes an introduction to engineering drawing, spatial measurement, and spatial visualisation. You will work with various spatial visualisation tools. Starting from hand sketching, you will learn how to produce engineering drawings, collect spatial data, and develop spatial visualisations.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            },
            "minor": []
        },
        {
            "code": "ENG1051",
            "state": 3,
            "Sem": 1,
            "credit points": "6",
            "name": "Materials for energy and sustainability",
            "units": {
                "overview": "Overview The key engineering challenge in the 21st century and beyond is the efficient use of energy and the Earth's resources. Energy supply drives our daily life, and there exist challenges in all of clean energy, renewable energy, energy transmission, energy storage, light materials, and energy-efficient manufacturing. In addition, the physical … For more content click the Read More button below.\nIn this unit, the fundamentals of the structure, design, and application of materials are covered. Attributes such as modulus, strength, toughness, chemical stability, electrical, magnetic, and thermal properties are explained in terms of atomic bonding, crystal defects and polycrystalline microstructure - and how this relates to end users.\nA particular focus will be given to \"processing-structure-property\" relationships, which is at the core of Materials Engineering, with the subjects' concepts elaborated in the context of materials for the efficient use of energy and other resources. Examples will include aerospace materials and functional materials, amongst others.The key engineering challenge in the 21st century and beyond is the efficient use of energy and the Earth's resources. Energy supply drives our daily life, and there exist challenges in all of clean energy, renewable energy, energy transmission, energy storage, light materials, and energy-efficient manufacturing. In addition, the physical infrastructure on which our daily lives depend requires the sustainable use of the finite resources at our disposal. All of these issues are Materials Engineering issues.\nIn this unit, the fundamentals of the structure, design, and application of materials are covered. Attributes such as modulus, strength, toughness, chemical stability, electrical, magnetic, and thermal properties are explained in terms of atomic bonding, crystal defects and polycrystalline microstructure - and how this relates to end users.\nA particular focus will be given to \"processing-structure-property\" relationships, which is at the core of Materials Engineering, with the subjects' concepts elaborated in the context of materials for the efficient use of energy and other resources. Examples will include aerospace materials and functional materials, amongst others.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITES:\nAustralian VCE Mathematical methods (Units 3 & 4) or VCE Specialist mathematics (Units 3 & 4) or equivalent\nAND \nAustralian VCE Chemistry (Units 3 & 4) or Australian VCE Physics (Units 3 & 4) or equivalent "
            },
            "minor": []
        },
        {
            "code": "FIT1056",
            "state": 3,
            "Sem": 2,
            "credit points": "6",
            "name": "Collaborative engineering for web applications",
            "units": {
                "overview": "Overview Some might describe engineering through a purely mathematical lens; however, it necessarily includes a liberal application of domain specific knowledge (engineering fields) and technology (hardware and software) to solve problems, especially at scale. Large-scale software projects are a critical part of all engineering fields in industry. Perhaps a chemical engineering … For more content click the Read More button below.Some might describe engineering through a purely mathematical lens; however, it necessarily includes a liberal application of domain specific knowledge (engineering fields) and technology (hardware and software) to solve problems, especially at scale. Large-scale software projects are a critical part of all engineering fields in industry. Perhaps a chemical engineering firm might need a system to simulate biochemical reactions to find better ways for producing green hydrogen. Or a civil engineering firm might need to identify the relationship between changes to playground designs and their impact on safety. Through this unit, you will work on a large-scale software project (web application) in remote teams working independently and collaboratively. The project will give you an appreciation of how large software projects can be decomposed into smaller segments, built and integrated into individual systems. You also gain an understanding of the abilities and limitations of such systems (within the context of web development) and learn methodological processes that support this. You will develop programming skills for web development (HTML, CSS and Javascript). Some prior programming knowledge would be advantageous, but not required.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ENG1003"
                    ]
                },
                "rules": null
            },
            "minor": []
        },
        {
            "code": "MAT1830",
            "state": 3,
            "Sem": 1,
            "credit points": "6",
            "name": "Discrete mathematics for computer science",
            "units": {
                "overview": "Overview This unit introduces fundamental discrete mathematics topics including combinatorics, sets, relations and functions; methods of logic and proof, especially proof by induction; probability theory, Bayes' theorem; recursion; recurrence relations; trees and other graphs. It establishes the mathematical basis required for studies in Computer Science and Software Engineering.This unit introduces fundamental discrete mathematics topics including combinatorics, sets, relations and functions; methods of logic and proof, especially proof by induction; probability theory, Bayes' theorem; recursion; recurrence relations; trees and other graphs. It establishes the mathematical basis required for studies in Computer Science and Software Engineering.Read More about Overview",
                "offerings": {
                    "OCT-MY-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "October intake teaching period, Malaysia campus",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ITI9004"
                    ]
                },
                "rules": "Prerequisite: VCE Specialist Mathematics or Mathematical Methods units 3 and 4 with a raw study score of at least 25 or Further maths with a raw study score of at least 35. Prohibition: MAT1077, MTH1112 "
            },
            "minor": []
        },
        {
            "code": "PHS1002",
            "state": 3,
            "Sem": 2,
            "credit points": "6",
            "name": "Physics for engineering",
            "units": {
                "overview": "Overview This unit relates key principles of physics to engineering and technology, and shows how physics, including quantum and nano-science, creates useful new technologies. In the Newtonian mechanics topics you will explore the traditional concepts of dynamics, such as energy, momentum and angular momentum, and explore their connections and applications to … For more content click the Read More button below.This unit relates key principles of physics to engineering and technology, and shows how physics, including quantum and nano-science, creates useful new technologies. In the Newtonian mechanics topics you will explore the traditional concepts of dynamics, such as energy, momentum and angular momentum, and explore their connections and applications to a variety of systems, including rocket propulsion, precession and planetary orbits. Within the Electromagnetism topics you will learn about electric and magnetic fields and their effects, as well as explore techniques for determining these fields and understanding their nature as light. In the Quantum physics topic you will explore modern physics concepts such as the uncertainty principle, the probabilistic interpretation of wave functions and atomic models and stimulated emission and explore their connection to technologies like the atomic force microscope and lasers. During the activities for the practical component you will develop measurement, analysis, and communication skills.Read More about Overview",
                "offerings": {
                    "OCT-MY-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "October intake teaching period, Malaysia campus",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "COREQUISITE: Recommend MTH1030 or ENG1005.Note: supporting mathematics studies are required for progression towards the Astrophysics and Physics majors. PREREQUISITE: PHS1001 or PHS1080 or PHS1031 or BMS1031 or VCE Physics (raw study score 25 or above), and ENG1090 or MTH1010 or VCE Mathematical Methods (raw study score 25 or above). PROHIBITION: PHS1011, PHS1022, ENG1081 "
            },
            "minor": []
        },
        {
            "code": "RSE1010",
            "state": 3,
            "Sem": 2,
            "credit points": "6",
            "name": "Natural resources engineering",
            "units": {
                "overview": "Overview This unit provides basic fundamental and practical aspects of resources engineering and introduces the activities which are involved in a resources engineering project. Resources engineers improve and maintain the sustainability of the earth's resources through efficient design and application of technology. The unit highlights the key concepts associated with the … For more content click the Read More button below.\nThe unit includes optional field trips, one during the mid-session break and another one towards the end of the semester so that students can observe the practical aspects of resources engineering and better understand the works that are involved in a resources operation. The field trips include both renewable energy and mining operations These are important as resources engineering is a practice-oriented field in which both fundamentals and practice must be used in an integrated manner for successful outcomes.This unit provides basic fundamental and practical aspects of resources engineering and introduces the activities which are involved in a resources engineering project. Resources engineers improve and maintain the sustainability of the earth's resources through efficient design and application of technology. The unit highlights the key concepts associated with the resources industry through two modules, including mining and renewable energy, and demonstrates the strong link between the mining and renewable energy sectors.\nThe unit includes optional field trips, one during the mid-session break and another one towards the end of the semester so that students can observe the practical aspects of resources engineering and better understand the works that are involved in a resources operation. The field trips include both renewable energy and mining operations These are important as resources engineering is a practice-oriented field in which both fundamentals and practice must be used in an integrated manner for successful outcomes.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            },
            "minor": []
        },
        {
            "code": "ECE2072",
            "credit points": "6",
            "state": 3,
            "Sem": 2,
            "name": "Digital systems",
            "units": {
                "overview": "Overview This unit introduces you to modern logic design techniques, hardware used and common representations. Topics include two and multi-level combinational logic, decoders, multiplexers, arithmetic circuits, programmable and steering logic, flip-flops, registers, counters, RAM and ROM. Using this hardware the design component will include finite state machine design and applications to … For more content click the Read More button below.This unit introduces you to modern logic design techniques, hardware used and common representations. Topics include two and multi-level combinational logic, decoders, multiplexers, arithmetic circuits, programmable and steering logic, flip-flops, registers, counters, RAM and ROM. Using this hardware the design component will include finite state machine design and applications to computer data path control. This will incorporate simple analogue and digital I/O interfacing. Programmable logic devices will be covered, and the use of a hardware description language for describing, synthesising and testing digital logic. Laboratories cover logic design, implementation, and testing.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite: 24 credit points from the Faculty of Engineering or the Faculty of Information Technology\nE6011 Master of Professional Engineering - You are exempt from the prerequisite rule if you are enrolled in this course. "
            },
            "minor": []
        },
        {
            "code": "FIT2085",
            "state": 3,
            "Sem": 0,
            "credit points": "6",
            "name": "Introduction to computer science for engineers",
            "units": {
                "overview": "Overview This unit introduces students to core problem-solving, analytical skills, and methodologies useful for developing flexible, robust, and maintainable software. In doing this, it covers a range of conceptual levels, from fundamental algorithms and data structures, down to their efficient implementation as well as complexity. Topics include data types, data structures, … For more content click the Read More button below.This unit introduces students to core problem-solving, analytical skills, and methodologies useful for developing flexible, robust, and maintainable software. In doing this, it covers a range of conceptual levels, from fundamental algorithms and data structures, down to their efficient implementation as well as complexity. Topics include data types, data structures, algorithms, algorithmic complexity, recursion, and their practical applications.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1003",
                        "ENG1013",
                        "ENG1014"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "FIT1008",
                        "FIT1054"
                    ]
                },
                "rules": null
            },
            "minor": []
        },
        {
            "code": "MAE2505",
            "state": 3,
            "Sem": 2,
            "credit points": "6",
            "name": "Aerospace dynamics",
            "units": {
                "overview": "Overview This unit develops your physical and analytical understanding of concepts of time, space, coordinate systems, particles, rigid bodies, forces, work, energy, mechanical vibration and Newton's Laws of Motion, translating into the ability to formulate and analyse the motion of spacecraft and aircraft under the influence of forces such as lift, … For more content click the Read More button below.This unit develops your physical and analytical understanding of concepts of time, space, coordinate systems, particles, rigid bodies, forces, work, energy, mechanical vibration and Newton's Laws of Motion, translating into the ability to formulate and analyse the motion of spacecraft and aircraft under the influence of forces such as lift, drag, thrust and gravity. You will be taught the fundamentals of kinematics and kinetics of rigid bodies and systems of particles and to carry out dynamic analysis of satellites and orbital spacecraft and aircraft. You will be introduced to properties of the Earth's atmosphere, the forces acting on aircraft and their impact on aircraft performance, resulting in the development of equations for steady level flight, steady climbing and descending flight. This unit is core to understanding the control and manoeuvring of spacecraft and aircraft.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1011",
                        "ENG1001"
                    ],
                    "AND": [
                        "ENG1005",
                        "ENG1005"
                    ]
                },
                "prohibition": {
                    "OR": [
                        "MEC2401",
                        "MAE2406"
                    ],
                    "AND": []
                },
                "rules": null
            },
            "minor": []
        },
        {
            "code": "MEC2404",
            "state": 3,
            "Sem": 2,
            "credit points": "6",
            "name": "Mechanics of fluids",
            "units": {
                "overview": "Overview This unit develops your physical understanding of fluid statics and fluid flow and the interaction of fluid forces with solids.\nTopics include hydrostatics, Reynolds transport theorem, continuity and momentum equations, control volume analysis, the Bernoulli equation, viscous pipe flow, pumps, dimensional analysis, boundary layers, flow measurement techniques and applications of … For more content click the Read More button below.This unit develops your physical understanding of fluid statics and fluid flow and the interaction of fluid forces with solids.\nTopics include hydrostatics, Reynolds transport theorem, continuity and momentum equations, control volume analysis, the Bernoulli equation, viscous pipe flow, pumps, dimensional analysis, boundary layers, flow measurement techniques and applications of fluid forces in flow - lift and drag.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [
                        "MAE2404",
                        "CHE2161"
                    ],
                    "AND": []
                },
                "rules": "Prerequisite: 24 credit points "
            },
            "minor": []
        },
        {
            "code": "CIV4100",
            "state":11,
            "sem":1,
            "credit points": "6",
            "name": "Autonomous vehicle systems",
            "unit_details": {
                "overview": "Overview This unit will introduce students to autonomous systems in general, autonomous vehicle (AV) system in particular, and its development. The unit will provide the fundamental system engineering knowledge of autonomous vehicle systems including the main building blocks, their design, integration and coordination to achieve the ultimate outcome of self-driving in … For more content click the Read More button below.This unit will introduce students to autonomous systems in general, autonomous vehicle (AV) system in particular, and its development. The unit will provide the fundamental system engineering knowledge of autonomous vehicle systems including the main building blocks, their design, integration and coordination to achieve the ultimate outcome of self-driving in a complex and uncertain environment. It will also cover and facilitate the learning in the further development of such systems through working and interacting with the actual autonomous vehicle and its testing and validation processes.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1014",
                        "ENG1060"
                    ],
                    "AND": [
                        "ENG2005",
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "ADDITIONAL PREREQUISITE: 96 cp of engineering study (including ENG1060, ENG2005) "
            }
          },
          {
            "code": "ECE4076",
            "state":11,
            "sem":1,
            "credit points": "6",
            "name": "Computer vision",
            "unit_details": {
                "overview": "Overview This unit aims to develop an understanding of methods for extracting useful information (eg 3-D structure; object size, motion, shape, location and identity, etc) from images. It will allow you to understand how to construct computer vision systems for robotics, surveillance, medical imaging, and related application areas.This unit aims to develop an understanding of methods for extracting useful information (eg 3-D structure; object size, motion, shape, location and identity, etc) from images. It will allow you to understand how to construct computer vision systems for robotics, surveillance, medical imaging, and related application areas.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ECE2071"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "ECE4078",
            "state":11,
            "sem":2,
            "credit points": "6",
            "name": "Intelligent robotics",
            "unit_details": {
                "overview": "Overview Intelligent robotics concerns the melding of artificial perception, strategic reasoning and robotic action in potentially unstructured and time-varying environments to fulfil useful physical tasks, whether in industry or for security, healthcare, search and rescue or civil defence etc. This unit covers topics underpinning the above requirements, including sensors, sensor fusion, … For more content click the Read More button below.Intelligent robotics concerns the melding of artificial perception, strategic reasoning and robotic action in potentially unstructured and time-varying environments to fulfil useful physical tasks, whether in industry or for security, healthcare, search and rescue or civil defence etc. This unit covers topics underpinning the above requirements, including sensors, sensor fusion, machine perception, environmental mapping/monitoring, path planning, localisation, mechanisms, artificial intelligence methodologies and application domains.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ECE2071"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ECE5178"
                    ]
                },
                "rules": "PREREQUISITES: Or FIT1002 or TRC2400 or (FIT1029 and FIT1040)\nIf you are currently enrolled in E6013 Master of Applied Engineering, you are exempt from the prerequisite requirement. "
            }
          },
          {
            "code": "ECE4179",
            "state":11,
            "sem":1,
            "credit points": "6",
            "name": "Neural networks and deep learning",
            "unit_details": {
                "overview": "Overview This unit introduces fundamentals of deep learning and how it can solve problems in many areas, such as image classification, filter design and natural language processing. Neural networks are first described and how training can be achieved with backpropagation. Various forms of deep neural networks are developed, such as multilayer … For more content click the Read More button below.This unit introduces fundamentals of deep learning and how it can solve problems in many areas, such as image classification, filter design and natural language processing. Neural networks are first described and how training can be achieved with backpropagation. Various forms of deep neural networks are developed, such as multilayer perceptrons, convolution neural networks and recurrent neural networks. The mathematics of stochastic optimisation is used to interpret and understand the behaviour and training of these networks. Programming approaches are discussed for training and deploying neural networks. Deep learning technologies and design examples are discussed in areas such as driverless cars, personal cognitive assistants and mastering of games such as GO.Read More about Overview",
                "offerings": {
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005",
                        "ECE2071"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisites: Or ENG2092 in place of ENG2005 "
            }
          },
          
          {
            "code": "ECE2071",
            "state":11,
            "sem":1,
            "credit points": "6",
            "name": "Computer organisation and programming",
            "unit_details": {
                "overview": "Overview This unit provides an introduction to computers and CPU organisation, assemblers and compilers, and algorithm design for engineering problems and embedded computer systems. It covers the language C and its implementation on a typical computer, including standard data types, arrays, control statements, functions, including ways of parameter passing, C library … For more content click the Read More button below.This unit provides an introduction to computers and CPU organisation, assemblers and compilers, and algorithm design for engineering problems and embedded computer systems. It covers the language C and its implementation on a typical computer, including standard data types, arrays, control statements, functions, including ways of parameter passing, C library functions, pointers, strings, arrays of pointers, structures, linked lists and binary tree data structures, dynamic memory allocations, and calls to assembly language programs. Object-oriented programming is introduced. Software engineering is covered as the methodology of software development and lifecycle models. Operating system concepts are introduced. The unit also includes an introduction to programmable logic controllers (PLCs).Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1003",
                        "ENG1013",
                        "ENG1014"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "CIV2282",
            "state":12,
            "sem":1,
            "credit points": "6",
            "name": "Transport and traffic engineering",
            "unit_details": {
                "overview": "Overview This unit introduces you to the field of transport and traffic engineering. The fundamental parameters used to describe deterministic traffic flow behaviour are introduced along with a simple traffic flow model. Stochastic traffic flow behaviour is described via random distributions. Fundamental queuing theory of traffic is briefly introduced. The procedures … For more content click the Read More button below.This unit introduces you to the field of transport and traffic engineering. The fundamental parameters used to describe deterministic traffic flow behaviour are introduced along with a simple traffic flow model. Stochastic traffic flow behaviour is described via random distributions. Fundamental queuing theory of traffic is briefly introduced. The procedures used to analyse the capacity and level of service are explored for both unsignalised and signalised intersections. The principle of traffic signal operation at isolated intersections is presented. Traffic surveys are discussed. You are introduced to contemporary road safety issues as well. Public transport is considered at the route level concerning the determination of fleet size and factors affecting operational capacity and reliability. Non-motorised transport including cyclists and pedestrians is also considered. In addition, the unit addresses Intelligent Transportation Systems (ITS). Consideration will also be given to the role of communications in the practice of transport and traffic engineers. To enhance your understanding of the unit content from practical points of view, some experts will be invited to give lectures on their relevant work. Throughout the whole unit, the focus is primarily on surface transport systems and applications of advanced technologies therein.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "CIV2242",
            "state":12,
            "sem":2,
            "credit points": "6",
            "name": "Geomechanics 1",
            "unit_details": {
                "overview": "Overview The unit covers all aspects of geomechanics at an elementary level, as well as basic engineering geology, formation and weathering processes, sedimentary, igneous and metamorphic rocks, soil- and rock-forming minerals, geological mapping and modelling, site investigations, in-situ testing, engineering classification of soil and rock, weight-volume relationship, and the two/three phase … For more content click the Read More button below.The unit covers all aspects of geomechanics at an elementary level, as well as basic engineering geology, formation and weathering processes, sedimentary, igneous and metamorphic rocks, soil- and rock-forming minerals, geological mapping and modelling, site investigations, in-situ testing, engineering classification of soil and rock, weight-volume relationship, and the two/three phase model. It also includes 2D seepage, effective stress theory, stresses in a soil mass and shear strength.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1011",
                        "ENG1001",
                        "ENG1060"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prohibition: CIV2241\nE6011 Master of Professional Engineering - You are exempt from the prerequisite rule if you are enrolled in this course. "
            }
          },
          {
            "code": "CIV4288",
            "state":12,
            "sem":2,
            "credit points": "6",
            "name": "Water treatment",
            "unit_details": {
                "overview": "Overview This unit provides an overview of water and wastewater systems in urban environments. The overview focuses on these systems' functions regarding the provision of drinking water and wastewater treatment and their modes of operation. Specific topics include water supply, water use and consumption, drinking water treatment and distribution, wastewater characterisation … For more content click the Read More button below.This unit provides an overview of water and wastewater systems in urban environments. The overview focuses on these systems' functions regarding the provision of drinking water and wastewater treatment and their modes of operation. Specific topics include water supply, water use and consumption, drinking water treatment and distribution, wastewater characterisation and secondary treatment, sludge handling, resource recovery and nature-based solutions for wastewater treatment. Treatment process theory and design are covered in this unit for both drinking water and wastewater treatment systems.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "CIV2263",
                        "CIV3285"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prohibition: CIV3264 "
            }
          },
          {
            "code": "CIV2235",
            "state":12,
            "sem":2,
            "credit points": "6",
            "name": "Structural materials",
            "unit_details": {
                "overview": "Overview This unit introduces you to fundamental concepts in the common structural materials including concrete, steel, timber, and masonry. The major topics include concrete technology and the durability of concrete structures, the handling and placement of concrete components, the mechanical properties of different steels and steel connectors (bolts and welds), the … For more content click the Read More button below.This unit introduces you to fundamental concepts in the common structural materials including concrete, steel, timber, and masonry. The major topics include concrete technology and the durability of concrete structures, the handling and placement of concrete components, the mechanical properties of different steels and steel connectors (bolts and welds), the behaviour of steel materials under fire, and the mechanical properties of timber and masonry materials. Additionally, you will gain knowledge about various structural loads and load combinations. Finally, you will learn about some significant case studies of structural failures which will reinforce the importance of material behaviours on structural safety.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1011",
                        "ENG1001",
                        "ENG1001"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "CIV2225",
                        "CIV3284"
                    ]
                },
                "rules": "E6011 Master of Professional Engineering - You are exempt from the prerequisite rule if you are enrolled in this course. "
            }
          },
          {
            "code": "ECE3093",
            "state":13,
            "sem":1,
            "credit points": "6",
            "name": "Optimisation estimation and numerical methods",
            "unit_details": {
                "overview": "Overview This unit will introduce you to time series analysis, matrix decomposition methods and optimisation in three equal parts. Time series will introduce the concepts of stochastic processes, wide-sense stationarity, autocovariance functions and spectral density. This will lead to the analysis of ARMA (p,g) processes using MATLAB. Matrix decomposition includes singular … For more content click the Read More button below.This unit will introduce you to time series analysis, matrix decomposition methods and optimisation in three equal parts. Time series will introduce the concepts of stochastic processes, wide-sense stationarity, autocovariance functions and spectral density. This will lead to the analysis of ARMA (p,g) processes using MATLAB. Matrix decomposition includes singular value decomposition with applications including data compression, image processing, noise filtering and finding exact and approximate solutions of linear systems. Numerical methods for working efficiently with large matrices and handling ill-conditioned data will be discussed. Methods for unconstrained and constrained optimisation will be presented, with the use of MATLAB.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "FIT3179",
            "state":13,
            "sem":2,
            "credit points": "6",
            "name": "Data visualisation",
            "unit_details": {
                "overview": "Overview Data visualisation is a powerful technique that allows us to use our visual system to understand data. Interactive data visualisation is now common in business, engineering and design and the social and physical sciences. This unit introduces the main kinds of information graphics and interactive visualisation systems and their areas … For more content click the Read More button below.Data visualisation is a powerful technique that allows us to use our visual system to understand data. Interactive data visualisation is now common in business, engineering and design and the social and physical sciences. This unit introduces the main kinds of information graphics and interactive visualisation systems and their areas of application. It investigates the reasons why visualisation can be effective and based on this students will gain experience in critically assessing data visualisations and in designing their own visualisations. You will learn how to create visualisations with representative computer tools and gain experience in creating a data visualisation for an application domain of their choice.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite: Completion of 24 points at first year. "
            }
          },
          {
            "code": "MEC4447",
            "state":13,
            "sem":1,
            "credit points": "6",
            "name": "Computers in fluids and energy",
            "unit_details": {
                "overview": "Overview Computational Fluid Dynamics (CFD) is a well-established analysis, design and optimisation approach for industrial fluid and heat transfer problems. Examples include turbomachinery, vehicle aerodynamics and aeronautics. It is also a powerful research tool and is being increasingly used to answer fundamental questions in a wide range of fields, from astrophysics … For more content click the Read More button below.Computational Fluid Dynamics (CFD) is a well-established analysis, design and optimisation approach for industrial fluid and heat transfer problems. Examples include turbomachinery, vehicle aerodynamics and aeronautics. It is also a powerful research tool and is being increasingly used to answer fundamental questions in a wide range of fields, from astrophysics to nanomaterials. This Unit provides an introduction to this mathematically sophisticated discipline. This involves a review of the equations governing motion and energy of fluids, the mathematical properties of these equations and the relevance of such properties to obtaining numerical solutions. The basics of numerical discretization and solution methods will be discussed. The Unit will also introduce you to using commercial CFD packages in analysing complex industrial problems involving fluids.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ECE3093",
                        "MAE3456",
                        "MEC3456",
                        "MEC3456"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "MTE4590",
            "state":13,
            "sem":2,
            "credit points": "6",
            "name": "Modelling of materials",
            "unit_details": {
                "overview": "Overview An introduction to the computational/modelling approaches currently available in materials science and engineering is provided. The reasons for using modelling approaches are discussed and the different types of models available are outlined. For each of the length scales important in understanding material behaviour (nano-, micro-, meso- and macro-), the available … For more content click the Read More button below.An introduction to the computational/modelling approaches currently available in materials science and engineering is provided. The reasons for using modelling approaches are discussed and the different types of models available are outlined. For each of the length scales important in understanding material behaviour (nano-, micro-, meso- and macro-), the available modelling techniques are outlined and their principles, methods of implementation, advantages, disadvantages and perceived future developments are discussed. Examples of modelling approaches will be selected from all classes of materials. The general methodology used for constructing models is emphasised.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005",
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "BEX3311",
            "state":14,
            "sem":1,
            "credit points": "6",
            "name": "Entrepreneurial mindsets and capabilities",
            "unit_details": {
                "overview": "Overview Entrepreneurship and innovation are driven by our ability to interrogate the world around us and think critically to identify challenges and opportunities worth exploring. The ability to make sense of, and create insight from a problem space or context, powers creative and innovative solutions. Furthermore, the ability to systematically employ … For more content click the Read More button below.\nThis unit provides you with an overall understanding of entrepreneurship and innovation, with a deep dive into cutting edge industry-informed and designed ways of working and hands-on experience in problem exploration. We use design-driven and innovation-focused research, analysis and synthesis tools and techniques to help you tackle a challenge space of your choosing. The unit takes you through human-centred approaches and requires the generation of novel concepts, solutions and tangible concepts to validate with target customers and/or end-users, culminating in an Industry Showcase.\nWhether you want to establish a start-up, work in corporate innovation, or just have a really great toolkit to help you do any job better, this unit will give you the right foundations.Entrepreneurship and innovation are driven by our ability to interrogate the world around us and think critically to identify challenges and opportunities worth exploring. The ability to make sense of, and create insight from a problem space or context, powers creative and innovative solutions. Furthermore, the ability to systematically employ creative thinking and to develop prototypes and approaches to validate hypotheses are crucial skills for entrepreneurs and innovators.\nThis unit provides you with an overall understanding of entrepreneurship and innovation, with a deep dive into cutting edge industry-informed and designed ways of working and hands-on experience in problem exploration. We use design-driven and innovation-focused research, analysis and synthesis tools and techniques to help you tackle a challenge space of your choosing. The unit takes you through human-centred approaches and requires the generation of novel concepts, solutions and tangible concepts to validate with target customers and/or end-users, culminating in an Industry Showcase.\nWhether you want to establish a start-up, work in corporate innovation, or just have a really great toolkit to help you do any job better, this unit will give you the right foundations.Read More about Overview",
                "offerings": {
                    "S1-01-CAULFIELD-ON-CAMPUS": {
                        "location": [
                            "Caulfield"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-CAULFIELD-ONLINE": {
                        "location": [
                            "Caulfield"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "Online"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "You must have completed 72 credit points of study to undertake this unit. "
            }
          },
          {
            "code": "BEX3411",
            "state":14,
            "sem":2,
            "credit points": "6",
            "name": "Building start-ups with impact",
            "unit_details": {
                "overview": "Overview Building start-ups with impact is a unit designed to take what you have developed and learned in BEX2411 Entrepreneurial Mindsets and Capabilities (prerequisite for BEX3411) and bring it to the real world as a venture, not just an idea. This unit is about taking a concept to market and building … For more content click the Read More button below.Building start-ups with impact is a unit designed to take what you have developed and learned in BEX2411 Entrepreneurial Mindsets and Capabilities (prerequisite for BEX3411) and bring it to the real world as a venture, not just an idea. This unit is about taking a concept to market and building a business around it – in a start-up or in an existing firm as an internal venture. You will begin this unit with a concept that you will then build a prototype for, to test and validate in market. Further, you will learn how to develop a service model to make this concept feasible and meet the needs and desires of your target customers and end users. Importantly, you will become skilled at engaging with business modelling techniques to deliver a viable product or service to customers who are willing to pay for it – our challenge to you will be to actually get paying customers by the end of the semester! Once you’ve achieved this, you will be guided to connect and network with investors, companies, community supporters and others in the start-up ecosystem to help you launch and grow.Read More about Overview",
                "offerings": {
                    "S2-01-CAULFIELD-ON-CAMPUS": {
                        "location": [
                            "Caulfield"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CAULFIELD-ONLINE": {
                        "location": [
                            "Caulfield"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "Online"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "BEX2411",
                        "BEX3311"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "FIT3134"
                    ]
                },
                "rules": "You must have completed 72 credit points of study to undertake this unit. "
            }
          },
          {
            "code": "ENG3701",
            "state":14,
            "sem":0,
            "credit points": "6",
            "name": " Entrepreneurial project A",
            "unit_details": {
                "overview": "",
                "offerings": {},
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "ENG3702",
            "state":14,
            "sem":0,
            "credit points": "6",
            "name": "Entrepreneurial project B",
            "unit_details": {
                "overview": "",
                "offerings": {},
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "MEC3010",
            "state":17,
            "sem":1,
            "credit points": "6",
            "name": "Micro and nanotechnologies: Fabrication and applications",
            "unit_details": {
                "overview": "Overview This unit aims to develop an understanding of micro and nanotechnology methods and techniques in a cleanroom environment, the design of process chains and the applications of devices that are currently being manufactured using them.\nMicro and nanofabrication form the basis of manufacturing any modern miniaturised system from computer chips … For more content click the Read More button below.\nThis unit studies the theoretical aspects of micro and nanotechnologies and how these techniques are employed to design manufacturing strategies of micro and nano-systems, considering real case studies of such devices.This unit aims to develop an understanding of micro and nanotechnology methods and techniques in a cleanroom environment, the design of process chains and the applications of devices that are currently being manufactured using them.\nMicro and nanofabrication form the basis of manufacturing any modern miniaturised system from computer chips to sensors and actuators in smartphones, tablets, cars and other vehicles, and diagnostic systems, biomedical devices and devices for environmental monitoring.\nThis unit studies the theoretical aspects of micro and nanotechnologies and how these techniques are employed to design manufacturing strategies of micro and nano-systems, considering real case studies of such devices.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITE: Completion of 18 credit points of level 2 engineering study "
            }
          },
          {
            "code": "CHE3172",
            "state":17,
            "sem":2,
            "credit points": "6",
            "name": "Nanotechnology and materials 1",
            "unit_details": {
                "overview": "Overview This unit introduces the foundation concepts of nanotechnology and nanosynthesis methods, self-assembly of colloids and some characterisation techniques of materials. This unit also covers polymer synthesis and characterisation as well as a number of useful applications of nanotechnology including smart coatings and nanomedicine. The global market and safety associated with … For more content click the Read More button below.This unit introduces the foundation concepts of nanotechnology and nanosynthesis methods, self-assembly of colloids and some characterisation techniques of materials. This unit also covers polymer synthesis and characterisation as well as a number of useful applications of nanotechnology including smart coatings and nanomedicine. The global market and safety associated with nanomaterials and nanotechnology will be described.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "CHM1011",
                        "CHM1022",
                        "CHM1052",
                        "CHM1051"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "MTE4597",
            "state":17,
            "sem":1,
            "credit points": "6",
            "name": "Engineering with nanomaterials",
            "unit_details": {
                "overview": "Overview This unit aims to develop an understanding of synthetic methods, properties and applications of nanomaterials and nanofabrication techniques. The nanomaterials include zero-dimensional nanoparticles, one-dimensional nanostructures (nanotubes, nanorods, nanowires and nanofibres), two-dimensional thin films and three-dimensional nanocomposites. Principles of nanofabrication such as lithography, self-assembly and biomimicry will be introduced. The unit … For more content click the Read More button below.This unit aims to develop an understanding of synthetic methods, properties and applications of nanomaterials and nanofabrication techniques. The nanomaterials include zero-dimensional nanoparticles, one-dimensional nanostructures (nanotubes, nanorods, nanowires and nanofibres), two-dimensional thin films and three-dimensional nanocomposites. Principles of nanofabrication such as lithography, self-assembly and biomimicry will be introduced. The unit will stress the rational design of properties of nanostructured materials and how they may be exploited for every day applications, ranging from food packaging and sunscreens to sensors and energy-related areas.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "MTE2541",
                        "MTE2101",
                        "CHE3172"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "MTE5197"
                    ]
                },
                "rules": null
            }
          },
          {
            "code": "CHE4172",
            "state":17,
            "sem":2,
            "credit points": "6",
            "name": "Nanotechnology and materials 2",
            "unit_details": {
                "overview": "Overview Understanding of synthetic methods, properties and applications of nanomaterials, including zero-dimensional nanoparticles, one-dimensional nanostructures (nanotubes, nanorods, nanowires and nanofibres), two-dimensional thin films, nanoporous materials and nanofabrication techniques such as lithography and self-assembly. Emphasis on advanced nanomaterials and the importance of nanostructured materials used in various chemical engineering applications. Examples of … For more content click the Read More button below.Understanding of synthetic methods, properties and applications of nanomaterials, including zero-dimensional nanoparticles, one-dimensional nanostructures (nanotubes, nanorods, nanowires and nanofibres), two-dimensional thin films, nanoporous materials and nanofabrication techniques such as lithography and self-assembly. Emphasis on advanced nanomaterials and the importance of nanostructured materials used in various chemical engineering applications. Examples of bionanotechnology-inspired nanostructures using biological building blocks in self-assembling processes.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "CHE3172",
                        "MTE2541"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisites: Or MSC2011 "
            }
          },
          {
            "code": "RSE3030",
            "state":16,
            "sem":1,
            "credit points": "6",
            "name": "Ventilation for surface and underground spaces",
            "unit_details": {
                "overview": "Overview This unit provides the fundamentals of ventilation for surface and underground spaces, including properties of air, gas, heat, dust and pollutants control, principles of airflow, ventilation network theory, as well as surface and underground ventilation systems design, with the emphasis on analysis and practical application.This unit provides the fundamentals of ventilation for surface and underground spaces, including properties of air, gas, heat, dust and pollutants control, principles of airflow, ventilation network theory, as well as surface and underground ventilation systems design, with the emphasis on analysis and practical application.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "CIV2263",
                        "MEC2404",
                        "CHE2161"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prohibition: MNE3030 "
            }
          },
          {
            "code": "RSE4010",
            "state":16,
            "sem":2,
            "credit points": "6",
            "name": "Mine planning and scheduling",
            "unit_details": {
                "overview": "Overview This unit deals with the theoretical principles and practical methodologies associated with mine planning and scheduling. Mine planning is an interactive process that includes elements of design, scheduling and evaluation. As part of the planning process, a range of issues has to be considered including, short and long-term planning, mine … For more content click the Read More button below.This unit deals with the theoretical principles and practical methodologies associated with mine planning and scheduling. Mine planning is an interactive process that includes elements of design, scheduling and evaluation. As part of the planning process, a range of issues has to be considered including, short and long-term planning, mine optimisation, cut-off grade analysis and mine evaluation. The unit applies mine planning and scheduling techniques to a case-study project in current state-of-the-art software.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "RSE3020",
                        "RSE3040"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite: Or MNE3020 and MNE3040 Prohibition: MNE4010 "
            }
          },
          {
            "code": "RSE3020",
            "state":16,
            "sem":1,
            "credit points": "6",
            "name": "Resource estimation",
            "unit_details": {
                "overview": "Overview The mineral inventory of a company is quantified through resource or reserve estimates with associated error levels that, in many cases, are unknown. The estimation procedure used by a geologist or engineer should incorporate efforts to minimise errors and assumptions at every level of decision.\nThis unit focuses on resource … For more content click the Read More button below.The mineral inventory of a company is quantified through resource or reserve estimates with associated error levels that, in many cases, are unknown. The estimation procedure used by a geologist or engineer should incorporate efforts to minimise errors and assumptions at every level of decision.\nThis unit focuses on resource and reserve estimation of mineral ores and hydrocarbon deposits, with particular focus on the influence of the in situ geological conditions. You will learn the basics of resource and reserve reporting with particular reference to applicable industry codes. Resource modelling will be taught through computer applications with special consideration of geostatistical techniques.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prohibition: MNE3020 "
            }
          },
          {
            "code": "RSE3040",
            "state":16,
            "sem":2,
            "credit points": "6",
            "name": "Mining systems",
            "unit_details": {
                "overview": "Overview This unit covers underground and surface mining methods and equipment selection for the optimum performance of underground and surface operations. The unit provides a detailed understanding of mining processes and systems engineering along with their key drivers in modern open-cut and underground operations. For each of the mining methods explored … For more content click the Read More button below.This unit covers underground and surface mining methods and equipment selection for the optimum performance of underground and surface operations. The unit provides a detailed understanding of mining processes and systems engineering along with their key drivers in modern open-cut and underground operations. For each of the mining methods explored consideration is given to the mining cycle and access design - eg shafts and/or declines and materials handling. Through practical applications, you will explore the selection of optimal mining systems. For each of the mining systems covered, core risk identification and mitigation are considered.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prohibitions: MNE3040 and MNE3050 "
            }
          },
          {
            "code": "RSE3141",
            "state":18,
            "sem":1,
            "credit points": "6",
            "name": "Solar energy",
            "unit_details": {
                "overview": "Overview This unit covers concepts associated with the solar energy industry including; the characteristics of solar radiation and solar collectors including efficiency evaluation and prediction of long-term performance; system modelling; energy storage; computer simulation and modelling of performance and the economics and financing of solar energy projects.This unit covers concepts associated with the solar energy industry including; the characteristics of solar radiation and solar collectors including efficiency evaluation and prediction of long-term performance; system modelling; energy storage; computer simulation and modelling of performance and the economics and financing of solar energy projects.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG2005",
                        "MTH2010",
                        "MTH2015"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "RSE3241",
            "state":18,
            "sem":2,
            "credit points": "6",
            "name": "Hydropower",
            "unit_details": {
                "overview": "Overview This unit covers all aspects of hydropower, including the fundamental physics behind energy storage in potential energy, design of hydropower systems (dam walls and reservoirs, penstock piping and tunnelling, power house design (turbine and generator), tailrace and electrical connection). The operation of hydropower stations and their influence on the integrated … For more content click the Read More button below.This unit covers all aspects of hydropower, including the fundamental physics behind energy storage in potential energy, design of hydropower systems (dam walls and reservoirs, penstock piping and tunnelling, power house design (turbine and generator), tailrace and electrical connection). The operation of hydropower stations and their influence on the integrated electrical system. The unit covers recent developments in hydropower, in particular, the current trend towards more pumped hydro energy storage. Lectures will be delivered by both academic staff and industry experts who work on real-world hydropower projects.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005",
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "RSE3242",
            "state":18,
            "sem":1,
            "credit points": "6",
            "name": "Geothermal energy",
            "unit_details": {
                "overview": "Overview This unit offers you a practical introduction to all aspects of geothermal energy. The course covers the development of geothermal energy sources for power (from exploration to development and production), as well as alternative uses for these resources. You will learn about the fundamental processes involved in heat and mass … For more content click the Read More button below.This unit offers you a practical introduction to all aspects of geothermal energy. The course covers the development of geothermal energy sources for power (from exploration to development and production), as well as alternative uses for these resources. You will learn about the fundamental processes involved in heat and mass transport in the subsurface, as well as the physics and chemistry involved in electricity production. The course also covers recent developments in geothermal energy - new drilling techniques, enhanced geothermal systems, mineral co-production and low-temperature geothermal systems. You will also be provided with an introduction to the economics surrounding geothermal energy systems.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "RSE3243",
            "state":18,
            "sem":2,
            "credit points": "6",
            "name": "Bioenergy",
            "unit_details": {
                "overview": "Overview This unit provides foundational knowledge of the bioenergy industry, including feedstocks, processing and end-use of products. The unit provides insight into biomass energy resources and bioenergy technologies, including the properties and characteristics of the resources, conversion and utilisation processes, as well as industrial application. Economic cost-effectiveness will be examined. You … For more content click the Read More button below.This unit provides foundational knowledge of the bioenergy industry, including feedstocks, processing and end-use of products. The unit provides insight into biomass energy resources and bioenergy technologies, including the properties and characteristics of the resources, conversion and utilisation processes, as well as industrial application. Economic cost-effectiveness will be examined. You will also conduct a lifecycle analysis of the various pathways to determine the energy return on energy invested. Other issues, such as impacts on food availability, land availability and the social and political impacts, will also be covered.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "TRC3000",
            "state":19,
            "sem":2,
            "credit points": "6",
            "name": "Automation project",
            "unit_details": {
                "overview": "Overview You will learn the planning and communication skills required to undertake a group project. An introduction will be given to the evolution of mechatronic technologies, design tools and methodologies, concurrent engineering design support tools, mechatronics design process and requirement interpretation. The acquisition of these skills will be motivated and tested … For more content click the Read More button below.You will learn the planning and communication skills required to undertake a group project. An introduction will be given to the evolution of mechatronic technologies, design tools and methodologies, concurrent engineering design support tools, mechatronics design process and requirement interpretation. The acquisition of these skills will be motivated and tested by applying them in a group project to design and build a mechatronic system. The mechatronic system will be based on a microcontroller together with appropriate mechanical structure, sensors and actuators.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "TRC4407"
                    ]
                },
                "rules": "PREREQUISITE: Completion of 18 credit points of level 2 engineering study "
            }
          },
          {
            "code": "TRC4200",
            "state":19,
            "sem":1,
            "credit points": "6",
            "name": "Engineering cyber-physical systems",
            "unit_details": {
                "overview": "Overview The unit aims to impart knowledge, skills, and experience required to prepare graduates for the impending digital transformation driving the convergence of technologies that result in Cyber-Physical Systems (CPS). An introduction will be given to Cyber-Physical Systems (CPS). The evolution of key technologies, transformation to digital chains and the need … For more content click the Read More button below.The unit aims to impart knowledge, skills, and experience required to prepare graduates for the impending digital transformation driving the convergence of technologies that result in Cyber-Physical Systems (CPS). An introduction will be given to Cyber-Physical Systems (CPS). The evolution of key technologies, transformation to digital chains and the need to seamlessly combine organisational and technological issues into a single framework will be discussed. A real-life scenario will be used to motivate you to apply CPS technologies to design and develop Smart Systems in any domain of their specialisation and interest. Using the concept of Learning Factories (LF) - a platform to impart experience-based knowledge - the developed solution will be built and tested as a group project.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "MEC3457",
                        "MAE3408",
                        "MEC2402",
                        "ECE3091"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Additional prerequisite:\nCompletion of 96 credit points of engineering study which includes the prerequisite units mentioned. "
            }
          },
          {
            "code": "TRC4902",
            "state":19,
            "sem":2,
            "credit points": "6",
            "name": "Mechatronics and manufacturing",
            "unit_details": {
                "overview": "Overview This unit aims to develop an understanding of the mechatronic engineer's role in the manufacturing industry, manufacturing processes including 3D printing, fundamentals and automation using a CNC controller. Different manufacturing systems: cellular and flexible manufacturing systems will be analysed. Recent advancement in the industry: Industry 4.0 and digital twins will … For more content click the Read More button below.This unit aims to develop an understanding of the mechatronic engineer's role in the manufacturing industry, manufacturing processes including 3D printing, fundamentals and automation using a CNC controller. Different manufacturing systems: cellular and flexible manufacturing systems will be analysed. Recent advancement in the industry: Industry 4.0 and digital twins will be introduced. Modern manufacturing management will be presented and discussed to improve quality and productivity by removing non-value added processes to reduce the production cycle and increase the product life-cycle. This will include lean manufacturing, agile manufacturing and virtual manufacturing. This unit also includes the design of flexible manufacturing systems which is capable of producing a variety of products. The manufacturing support systems such as process planning and control and computer-aided process planning using a variant technique and a generative process planning technique with Artificial Intelligence (AI) will be covered in this unit. Finally, the design of flexible manufacturing systems for a variety of products will be studied to reduce production lot size and the design of assembly manufacturing lines will be optimised.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "MEC2402",
                        "TRC3000"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "If you are currently enrolled in E6013 Master of Applied Engineering, you are exempt from the prerequisites requirement. "
            }
          },
          {
            "code": "ECE3141",
            "state":19,
            "sem":1,
            "credit points": "6",
            "name": "Information and networks",
            "unit_details": {
                "overview": "Overview This unit provides an introduction to underlying technologies, major components and system-wide architectures of modern telecommunication systems. After introducing concepts of block and stream delivery, requirements of a telecommunications network and representation of analogue signals (e.g. voice and video) in digital form, the unit will cover all the major functions … For more content click the Read More button below.This unit provides an introduction to underlying technologies, major components and system-wide architectures of modern telecommunication systems. After introducing concepts of block and stream delivery, requirements of a telecommunications network and representation of analogue signals (e.g. voice and video) in digital form, the unit will cover all the major functions in layered architectures. Topics to be covered include multiplexing, basic line transmission and modulation, error protection and correction, packet switching, LAN protocols and the TCP/IP protocols on which the Internet is built. Particular emphasis is given to the major functions that combine to allow communication across key modern digital telecommunication systems such as the Internet, mobile telephony, digital TV and Digital Audio Broadcasting.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ECE2041"
                    ]
                },
                "rules": "Prerequisite: VCE specialist mathematics and physics or equivalent units "
            }
          }
    ]
}