{
    "code": "MECHENG03",
    "credit points": "144",
    "name": "Mechanical engineering",
    "core_units": [
        {
            "code": "ENG2005",
            "credit points": "6",
            "name": "Advanced engineering mathematics",
            "unit_details": {
                "overview": "Overview This unit introduces advanced mathematical concepts required for all disciplines of engineering that extend on the concepts in ENG1005 Engineering mathematics.\nMajor concepts taught using engineering contexts include multivariable and vector calculus, Fourier series and partial differential equations. Specific topics include partial derivatives, double and triple integrals with change of … For more content click the Read More button below.This unit introduces advanced mathematical concepts required for all disciplines of engineering that extend on the concepts in ENG1005 Engineering mathematics.\nMajor concepts taught using engineering contexts include multivariable and vector calculus, Fourier series and partial differential equations. Specific topics include partial derivatives, double and triple integrals with change of coordinates, vector functions and operators, parametric curves and surfaces, periodic functions, Laplace transforms, ODE boundary value problems, partial differential equation solution techniques and applications.Read More about Overview",
                "offerings": {
                    "NOV12-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "November teaching period",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1014",
                        "ENG1060"
                    ],
                    "AND": [
                        "ENG1005",
                        "ENG1005"
                    ]
                },
                "prohibition": {
                    "OR": [
                        "MTH2010",
                        "MTH2015"
                    ],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "MEC2401",
            "credit points": "6",
            "name": "Dynamics 1",
            "unit_details": {
                "overview": "Overview This unit introduces second-year mechanical engineering students to the concepts of time, space, coordinate systems, particles, rigid bodies, forces, work, energy and Newton's Laws of Motion. You will be taught the fundamentals of kinematics and kinetics of rigid bodies and systems of particles and to carry out dynamic analysis to … For more content click the Read More button below.This unit introduces second-year mechanical engineering students to the concepts of time, space, coordinate systems, particles, rigid bodies, forces, work, energy and Newton's Laws of Motion. You will be taught the fundamentals of kinematics and kinetics of rigid bodies and systems of particles and to carry out dynamic analysis to balance systems with rotating and reciprocating masses. You will also be introduced to 3-dimensional dynamics of rigid bodies. The fundamentals of mechanical vibration, analysis and synthesis of planar mechanisms and experimental modelling will complete the unit.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1011",
                        "ENG1001"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [
                        "TRC2201",
                        "MAE2505",
                        "MAE2406"
                    ],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "MEC2402",
            "credit points": "6",
            "name": "Design methods",
            "unit_details": {
                "overview": "Overview This unit will help you to develop a systematic method of capturing design requirements, tools for ideation, estimation and decision-making. Primary and secondary manufacturing processes, assembly techniques. Engineering graphics for problem-solving, manufacturing communication and ideation. Report writing, teamwork in solving design problems involving the integration of mechanical elements in prototype … For more content click the Read More button below.This unit will help you to develop a systematic method of capturing design requirements, tools for ideation, estimation and decision-making. Primary and secondary manufacturing processes, assembly techniques. Engineering graphics for problem-solving, manufacturing communication and ideation. Report writing, teamwork in solving design problems involving the integration of mechanical elements in prototype conception, construction and testing.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "MAE2412"
                    ]
                },
                "rules": "Prerequisite: 12 engineering credit points at level 1\nE6011 Master of Professional Engineering - You are exempt from the prerequisite rule if you are enrolled in this course. "
            }
        },
        {
            "code": "MEC2403",
            "credit points": "6",
            "name": "Mechanics of materials",
            "unit_details": {
                "overview": "Overview The unit conveys the fundamental knowledge necessary for the analysis and design of mechanical engineering structures. It builds on aspects of applied forces and basic structural analysis that are contained in various units in level 1. It provides a focus for this prior learning with respect to the analysis of … For more content click the Read More button below.The unit conveys the fundamental knowledge necessary for the analysis and design of mechanical engineering structures. It builds on aspects of applied forces and basic structural analysis that are contained in various units in level 1. It provides a focus for this prior learning with respect to the analysis of components and structures within a mechanical engineering context.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1011",
                        "ENG1001",
                        "ENG1001"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [
                        "MAE2401",
                        "MEC3601"
                    ],
                    "AND": []
                },
                "rules": "E6011 Master of Professional Engineering - You are exempt from the prerequisite rule if you are enrolled in this course. "
            }
        },
        {
            "code": "MEC2404",
            "credit points": "6",
            "name": "Mechanics of fluids",
            "unit_details": {
                "overview": "Overview This unit develops your physical understanding of fluid statics and fluid flow and the interaction of fluid forces with solids.\nTopics include hydrostatics, Reynolds transport theorem, continuity and momentum equations, control volume analysis, the Bernoulli equation, viscous pipe flow, pumps, dimensional analysis, boundary layers, flow measurement techniques and applications of … For more content click the Read More button below.This unit develops your physical understanding of fluid statics and fluid flow and the interaction of fluid forces with solids.\nTopics include hydrostatics, Reynolds transport theorem, continuity and momentum equations, control volume analysis, the Bernoulli equation, viscous pipe flow, pumps, dimensional analysis, boundary layers, flow measurement techniques and applications of fluid forces in flow - lift and drag.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [
                        "MAE2404",
                        "CHE2161"
                    ],
                    "AND": []
                },
                "rules": "Prerequisite: 24 credit points "
            }
        },
        {
            "code": "MEC2405",
            "credit points": "6",
            "name": "Thermodynamics",
            "unit_details": {
                "overview": "Overview This unit introduces concepts of heat, work, energy, temperature and pressure. The properties of pure substances, steam tables and phase diagrams and their use in thermodynamics problems, first and second laws of thermodynamics and their use in steady and unsteady state problems, Carnot cycle, gas power cycles, vapour and combined … For more content click the Read More button below.This unit introduces concepts of heat, work, energy, temperature and pressure. The properties of pure substances, steam tables and phase diagrams and their use in thermodynamics problems, first and second laws of thermodynamics and their use in steady and unsteady state problems, Carnot cycle, gas power cycles, vapour and combined power cycles are introduced. Use of T-s diagrams for power cycle analysis, P-h diagrams in refrigeration cycle analysis and simple combustion processes are covered. Renewable energy such as solar, hydro, wind and biomass, and their use in heating and electricity generation and the environmental benefits of renewable energy conclude study in this unit.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG1005"
                    ]
                },
                "prohibition": {
                    "OR": [
                        "CHE2164",
                        "MAE2402"
                    ],
                    "AND": []
                },
                "rules": "Prerequisite - Completion of 24 credit points of units owned by the Faculty of Engineering "
            }
        },
        {
            "code": "MEC3416",
            "credit points": "6",
            "name": "Machine design",
            "unit_details": {
                "overview": "Overview In this integrative level 3 unit, students of mechanical engineering programs are introduced to the design of machine elements covering bearings, shafts, welds, fasteners, gears etc. This leads to an examination of techniques for improving engineering designs based on economic and functional considerations. Geometric and economic tolerancing is further explored. … For more content click the Read More button below.In this integrative level 3 unit, students of mechanical engineering programs are introduced to the design of machine elements covering bearings, shafts, welds, fasteners, gears etc. This leads to an examination of techniques for improving engineering designs based on economic and functional considerations. Geometric and economic tolerancing is further explored. The use of solid modelling software to simulate the behaviour of mechanical devices and produce engineering drawings is introduced. The integration of design skills and related engineering studies is covered through a group exercise to design a mechanical device.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITE: Completion of 18 credit points of level 2 engineering study\nE6011 Master of Professional Engineering - You are exempt from the prerequisite rule if you are enrolled in this course. "
            }
        },
        {
            "code": "MEC3451",
            "credit points": "6",
            "name": "Fluid mechanics 2",
            "unit_details": {
                "overview": "Overview The foundations of continuum analysis of fluids will be presented. Using control volume analysis the fundamental conservation laws for mass, momentum and energy are developed leading to the derivation of the Navier-Stokes equations. Techniques employed to solving these equations for specific problems are explored. Methods of exact and approximate solutions … For more content click the Read More button below.The foundations of continuum analysis of fluids will be presented. Using control volume analysis the fundamental conservation laws for mass, momentum and energy are developed leading to the derivation of the Navier-Stokes equations. Techniques employed to solving these equations for specific problems are explored. Methods of exact and approximate solutions of these equations, and the use of conceptual and analytical tools such as flow similitude, vorticity, circulation, stream function and velocity potential are described. The concept of boundary layers and its use in the calculation of drag and lift forces is elucidated. The origins and physical consequences of the phenomenon of fluid turbulence are discussed, along with their implications for computation of turbulent flows. The analysis of compressible flows and its applications are discussed. The unit introduces the concepts underpinning the broad areas of fluid acoustics, computational fluid dynamics, environmental fluid mechanics and wind energy.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "MEC2404"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "MAE3401"
                    ]
                },
                "rules": "Additional prerequisite: You must also have completed 18 engineering credit points at level two. "
            }
        },
        {
            "code": "MEC3453",
            "credit points": "6",
            "name": "Dynamics 2",
            "unit_details": {
                "overview": "Overview The fundamental concepts of rigid body and particle dynamics taught in the second level dynamics unit will be further reinforced. This unit then focusses on mechanical vibrations theory. The methodology for analysing the response of a vibratory system to given external stimuli is covered. Both single and multi-degrees of freedom … For more content click the Read More button below.The fundamental concepts of rigid body and particle dynamics taught in the second level dynamics unit will be further reinforced. This unit then focusses on mechanical vibrations theory. The methodology for analysing the response of a vibratory system to given external stimuli is covered. Both single and multi-degrees of freedom and discrete and continuous vibratory systems will be analysed. The methods for developing the equations of motion of a vibratory system using Newton's 2nd law and the Lagrange equation and the manipulation of these equations to analyse the free and forced vibration responses of these systems will be introduced. The analysis of forced vibrations will include periodic and non-periodic forcing functions.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG2005",
                        "MTH2021",
                        "MTH2032"
                    ],
                    "AND": [
                        "MEC2401",
                        "MEC2401"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "TRC3200"
                    ]
                },
                "rules": "E6011 Master of Professional Engineering - You are exempt from the prerequisite rule if you are enrolled in this course. "
            }
        },
        {
            "code": "MEC3455",
            "credit points": "6",
            "name": "Solid mechanics",
            "unit_details": {
                "overview": "Overview This unit aims to develop an understanding of the analytical methodologies used in strength and stiffness assessment of engineering structures and components. It allows you to translate real-world forces into abstract form for engineering modelling of a range of common problems found in industry and gain knowledge of the relationship … For more content click the Read More button below.This unit aims to develop an understanding of the analytical methodologies used in strength and stiffness assessment of engineering structures and components. It allows you to translate real-world forces into abstract form for engineering modelling of a range of common problems found in industry and gain knowledge of the relationship between analysis and design. You will be exposed to a wide range of analytical tools and modeling philosophies. To complement these analytical solution techniques, you will now be taught the fundamentals of finite element analysis.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "MEC2403"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "MEC3601"
                    ]
                },
                "rules": "E6011 Master of Professional Engineering - You are exempt from the prerequisite rule if you are enrolled in this course. "
            }
        },
        {
            "code": "MEC3456",
            "credit points": "6",
            "name": "Engineering computational analysis",
            "unit_details": {
                "overview": "Overview This unit conveys the fundamentals of numerical analysis techniques for root-finding, interpolation, integration, the solution of ordinary differential equations and data analysis, and Matlab is employed to demonstrate their implementation. The role computers play in both the solution of engineering problems and the acquisition and analysis of data is explored … For more content click the Read More button below.This unit conveys the fundamentals of numerical analysis techniques for root-finding, interpolation, integration, the solution of ordinary differential equations and data analysis, and Matlab is employed to demonstrate their implementation. The role computers play in both the solution of engineering problems and the acquisition and analysis of data is explored through consideration of common partial differential equations in mechanics, and their solution via finite difference, finite volume, and finite element methods.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1014",
                        "ENG1060",
                        "ENG1060"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [
                        "MAE3456",
                        "MAE2403",
                        "MEC2456"
                    ],
                    "AND": []
                },
                "rules": "E6011 Master of Professional Engineering - You are exempt from the prerequisite rule if you are enrolled in this course. "
            }
        },
        {
            "code": "MEC3457",
            "credit points": "6",
            "name": "Systems and control",
            "unit_details": {
                "overview": "Overview This unit covers the nature and behaviour of simple components, processes and subsystems relevant to engineering control. Mechanical, electrical, fluid pressure devices and complete elementary control systems are included. Orientation is to predicting, examining and assessing system performance via the formation of mathematical models and solution of models. Laboratory experiments … For more content click the Read More button below.This unit covers the nature and behaviour of simple components, processes and subsystems relevant to engineering control. Mechanical, electrical, fluid pressure devices and complete elementary control systems are included. Orientation is to predicting, examining and assessing system performance via the formation of mathematical models and solution of models. Laboratory experiments and hands-on instruction in the digital simulation package Matlab to solve models. A unified approach to mathematical modelling via the concepts of resistance, capacitance and inertia/inductance is emphasised. You learn to perform system modelling, develop solutions, assess a system response and analyse systems.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG2005",
                        "MTH2021",
                        "MTH2032"
                    ],
                    "AND": [
                        "MEC2401",
                        "MEC2401"
                    ]
                },
                "prohibition": {
                    "OR": [
                        "MAE3408",
                        "TRC3600"
                    ],
                    "AND": []
                },
                "rules": "E6011 Master of Professional Engineering - You are exempt from the prerequisite rule if you are enrolled in this course. "
            }
        },
        {
            "code": "MEC4404",
            "credit points": "6",
            "name": "Professional practice",
            "unit_details": {
                "overview": "Overview This unit provides you with an understanding of the work environment of a professional engineer addressing topics not covered in other parts of the degree program. It allows you to more effectively use your engineering skills within the context of a business environment and assists you to add value to … For more content click the Read More button below.This unit provides you with an understanding of the work environment of a professional engineer addressing topics not covered in other parts of the degree program. It allows you to more effectively use your engineering skills within the context of a business environment and assists you to add value to the community. You will be encouraged to evaluate problems from a multi-faceted perspective and to articulate your views in writing as well as in discussion. The unit provides a balance between global macro issues likely to influence your future work environment, and more current micro issues likely to confront you in establishing yourself as a professional engineer.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "MAE4404"
                    ]
                },
                "rules": "PREREQUISITE: Completion of 96 credit points in engineering study.\nIf you are currently enrolled in E6013 Master of Applied Engineering, you are exempt from this rule. "
            }
        },
        {
            "code": "MEC4407",
            "credit points": "6",
            "name": "Design project",
            "unit_details": {
                "overview": "Overview This unit provides you with the opportunity to work in teams to complete an integrated design project (IDP) which draws upon the knowledge and skills that you have developed throughout the course of your degree. It also includes instruction in the use of design software tools for 3D modelling, assembly, … For more content click the Read More button below.This unit provides you with the opportunity to work in teams to complete an integrated design project (IDP) which draws upon the knowledge and skills that you have developed throughout the course of your degree. It also includes instruction in the use of design software tools for 3D modelling, assembly, finite element analysis (FEA), computational fluid dynamics (CFD) and design optimisation. Societal, health, safety, legal and cultural aspects will also be considered where appropriate.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "MEC3416"
                    ]
                },
                "prohibition": {
                    "OR": [
                        "TRC4407",
                        "ENG4105"
                    ],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "MEC4408",
            "credit points": "6",
            "name": "Thermodynamics and heat transfer",
            "unit_details": {
                "overview": "Overview This unit aims to develop a fundamental understanding of the processes by which heat and energy are inter-related and converted and by which heat is transferred. The unit will review major principles of energy conversion and the modes of heat transfer. The basic laws of thermodynamics and the governing equations … For more content click the Read More button below.This unit aims to develop a fundamental understanding of the processes by which heat and energy are inter-related and converted and by which heat is transferred. The unit will review major principles of energy conversion and the modes of heat transfer. The basic laws of thermodynamics and the governing equations for heat transfer and thermodynamics will be introduced and subsequently used to solve practical engineering problems involving thermodynamics and heat transfer. The unit will also cover fundamental design principles of power generation systems and heat exchangers.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "MEC2405",
                        "CHE2164"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "MEC3454"
                    ]
                },
                "rules": null
            }
        },
        {
            "code": "MEC4426",
            "credit points": "6",
            "name": "Computer-aided design",
            "unit_details": {
                "overview": "Overview Finite element analysis (FEA) in computer-aided design; finite element formulation; first-order and second-order elements; stiffness matrix; integration points and stress recovery; convergence and mesh refinement; FEA of plane stress and plane strain problems; FEA of axisymmetric problems; FEA of nonlinear materials; FEA of contact problems; FEA of large deformation problems; … For more content click the Read More button below.Finite element analysis (FEA) in computer-aided design; finite element formulation; first-order and second-order elements; stiffness matrix; integration points and stress recovery; convergence and mesh refinement; FEA of plane stress and plane strain problems; FEA of axisymmetric problems; FEA of nonlinear materials; FEA of contact problems; FEA of large deformation problems; FEA of dynamic problems; FEA of fracture mechanics.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "MEC3455",
                        "MAE2401",
                        "TRC2201"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "MAE3426"
                    ]
                },
                "rules": "Prerequisite:And 96 credit points of engineering study. "
            }
        },
        {
            "code": "ENG4701",
            "credit points": "6",
            "name": "Final year project A",
            "unit_details": {
                "overview": "Overview The aim of this capstone unit is to provide an opportunity for you to undertake a substantial individual or small group project. Projects undertaken will integrate and build on content from earlier stages of the course. This unit is the first part of a two-unit project.The aim of this capstone unit is to provide an opportunity for you to undertake a substantial individual or small group project. Projects undertaken will integrate and build on content from earlier stages of the course. This unit is the first part of a two-unit project.",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITE: 18 credit points at level three in engineering or FIT-coded study\nCOREQUISITE: ENG0001 (Clayton-based students) "
            }
        },
        {
            "code": "ENG4702",
            "credit points": "6",
            "name": "Final year project B",
            "unit_details": {
                "overview": "Overview This unit is a continuation of ENG4701 Final year project A. The aim of this capstone unit is to provide an opportunity for you to undertake a substantial individual or small group project. Projects undertaken will integrate and build on content from earlier stages of the course.This unit is a continuation of ENG4701 Final year project A. The aim of this capstone unit is to provide an opportunity for you to undertake a substantial individual or small group project. Projects undertaken will integrate and build on content from earlier stages of the course.",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG4701"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "ECE2131",
            "credit points": "6",
            "name": "Electrical circuits",
            "unit_details": {
                "overview": "Overview This unit provides foundation knowledge for analogue circuit analysis and design. You will be introduced to the fundamentals of linear electronic circuit analysis and design. At the completion of the unit, you will develop skills in using state of the art prototyping and measurement tools for linear electronic circuit analysis … For more content click the Read More button below.\nThe unit will provide a grounding in circuit theory leading to solutions of electrical networks with node and mesh analysis, equivalent sources, two-port representations and simulation. AC analysis with phasors, first and second-order transient responses will be included. Frequency and time response will be developed with Laplace transform techniques.This unit provides foundation knowledge for analogue circuit analysis and design. You will be introduced to the fundamentals of linear electronic circuit analysis and design. At the completion of the unit, you will develop skills in using state of the art prototyping and measurement tools for linear electronic circuit analysis and design. The topics covered in this course include sinusoidal steady-state analysis using phasors and complex impedances, feedback concepts, solid-state electronics, solid-state diodes and diode circuits, field-effect transistors, bipolar junction transistors and operational amplifiers.\nThe unit will provide a grounding in circuit theory leading to solutions of electrical networks with node and mesh analysis, equivalent sources, two-port representations and simulation. AC analysis with phasors, first and second-order transient responses will be included. Frequency and time response will be developed with Laplace transform techniques.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1013",
                        "ENG1002"
                    ],
                    "AND": [
                        "ENG1005",
                        "ENG1005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ECE2031"
                    ]
                },
                "rules": null
            }
        },
        {
            "code": "MAE2505",
            "credit points": "6",
            "name": "Aerospace dynamics",
            "unit_details": {
                "overview": "Overview This unit develops your physical and analytical understanding of concepts of time, space, coordinate systems, particles, rigid bodies, forces, work, energy, mechanical vibration and Newton's Laws of Motion, translating into the ability to formulate and analyse the motion of spacecraft and aircraft under the influence of forces such as lift, … For more content click the Read More button below.This unit develops your physical and analytical understanding of concepts of time, space, coordinate systems, particles, rigid bodies, forces, work, energy, mechanical vibration and Newton's Laws of Motion, translating into the ability to formulate and analyse the motion of spacecraft and aircraft under the influence of forces such as lift, drag, thrust and gravity. You will be taught the fundamentals of kinematics and kinetics of rigid bodies and systems of particles and to carry out dynamic analysis of satellites and orbital spacecraft and aircraft. You will be introduced to properties of the Earth's atmosphere, the forces acting on aircraft and their impact on aircraft performance, resulting in the development of equations for steady level flight, steady climbing and descending flight. This unit is core to understanding the control and manoeuvring of spacecraft and aircraft.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1011",
                        "ENG1001"
                    ],
                    "AND": [
                        "ENG1005",
                        "ENG1005"
                    ]
                },
                "prohibition": {
                    "OR": [
                        "MEC2401",
                        "MAE2406"
                    ],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "MEC2407",
            "credit points": "6",
            "name": "Electromechanics",
            "unit_details": {
                "overview": "Overview Introduction to the design, analysis, and practical manufacture of electromechanical systems, incorporating basic analog DC/AC and digital electrical circuit theory, simple semiconductor and amplifying components, transformers, and sensors and actuators. Mathematics of electromechanical systems is provided, including Laplace transforms and complex algebra. Computational and assignment work (via practicals) to be … For more content click the Read More button below.Introduction to the design, analysis, and practical manufacture of electromechanical systems, incorporating basic analog DC/AC and digital electrical circuit theory, simple semiconductor and amplifying components, transformers, and sensors and actuators. Mathematics of electromechanical systems is provided, including Laplace transforms and complex algebra. Computational and assignment work (via practicals) to be integrated to give you complete understanding of specific examples using modern microelectronic components, sensors, and actuators.Read More about Overview",
                "offerings": {
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "MEC2811",
            "credit points": "6",
            "name": "Manufacturing processes",
            "unit_details": {
                "overview": "Overview This unit focuses on manufacturing processes that can be scaled up for volume production. This includes casting, CNC machining, powder metallurgy and metal forming. For each of these processes, you will learn about each of their strengths, limitations, cost and sustainability aspects. This will enable you to objectively select an … For more content click the Read More button below.This unit focuses on manufacturing processes that can be scaled up for volume production. This includes casting, CNC machining, powder metallurgy and metal forming. For each of these processes, you will learn about each of their strengths, limitations, cost and sustainability aspects. This will enable you to objectively select an appropriate technique for a particular set of requirements. You will also learn to design components that leverage the strengths of each of the different processes to optimally achieve the desired outcomes. You will also have the opportunity to work o a project that put these into practice and gain some hands-on experience.Read More about Overview",
                "offerings": {
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1011",
                        "ENG1001"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "TRC2001",
            "credit points": "6",
            "name": "Introduction to systems engineering",
            "unit_details": {
                "overview": "Overview This unit introduces you to the fundamental principles of some basic systems comprising of mechanical, electrical, electronic, computing and electro-mechanical sub-systems, with an intention to introduce cross-links between them for an integrated design approach towards their application to the development of complex systems.\nSpecial emphasis will be made on introducing … For more content click the Read More button below.\nThis unit would outline the breadth of the knowledge that the mechatronics systems engineer must acquire regarding the features of diverse sub-systems and components that constitute the total system.This unit introduces you to the fundamental principles of some basic systems comprising of mechanical, electrical, electronic, computing and electro-mechanical sub-systems, with an intention to introduce cross-links between them for an integrated design approach towards their application to the development of complex systems.\nSpecial emphasis will be made on introducing sub-systems required for 'inception to completion' of mechatronic systems with practical design examples. The enabling sub-systems for an integrated approach such as sensors, actuators, mechanisms, controllers, hardware interfacing, as well as strategies for risk assessment, interface definition, system integration, human factors, measurement and analysis as required in mechatronics product design & development will also be introduced.\nThis unit would outline the breadth of the knowledge that the mechatronics systems engineer must acquire regarding the features of diverse sub-systems and components that constitute the total system.Read More about Overview",
                "offerings": {
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite: 24 credit pointsProhibition: TRC2000 "
            }
        },
        {
            "code": "MEC3010",
            "credit points": "6",
            "name": "Micro and nanotechnologies: Fabrication and applications",
            "unit_details": {
                "overview": "Overview This unit aims to develop an understanding of micro and nanotechnology methods and techniques in a cleanroom environment, the design of process chains and the applications of devices that are currently being manufactured using them.\nMicro and nanofabrication form the basis of manufacturing any modern miniaturised system from computer chips … For more content click the Read More button below.\nThis unit studies the theoretical aspects of micro and nanotechnologies and how these techniques are employed to design manufacturing strategies of micro and nano-systems, considering real case studies of such devices.This unit aims to develop an understanding of micro and nanotechnology methods and techniques in a cleanroom environment, the design of process chains and the applications of devices that are currently being manufactured using them.\nMicro and nanofabrication form the basis of manufacturing any modern miniaturised system from computer chips to sensors and actuators in smartphones, tablets, cars and other vehicles, and diagnostic systems, biomedical devices and devices for environmental monitoring.\nThis unit studies the theoretical aspects of micro and nanotechnologies and how these techniques are employed to design manufacturing strategies of micro and nano-systems, considering real case studies of such devices.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITE: Completion of 18 credit points of level 2 engineering study "
            }
        },
        {
            "code": "MEC3448",
            "credit points": "6",
            "name": "Engineering technologies",
            "unit_details": {
                "overview": "Overview This unit introduces a range of fundamental technologies, processes and manufacturing methods used in the creation of engineering artefacts and explains their relative merits and limitations. 3D Computer-Aided Design and Manufacturing (CAD/CAM) tools are utilised to design and manufacture using rapid prototyping and additive techniques.This unit introduces a range of fundamental technologies, processes and manufacturing methods used in the creation of engineering artefacts and explains their relative merits and limitations. 3D Computer-Aided Design and Manufacturing (CAD/CAM) tools are utilised to design and manufacture using rapid prototyping and additive techniques.Read More about Overview",
                "offerings": {
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1001",
                        "ENG1011"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "MEC2408"
                    ]
                },
                "rules": null
            }
        },
        {
            "code": "MEC3458",
            "credit points": "6",
            "name": "Experimental project",
            "unit_details": {
                "overview": "Overview Introduction to data acquisition across a range of data types, analogue-digital sampling and signal conditioning. Data acquisition and processing functions using LabView. Current data measurement technologies and equipment, acquisition methodologies used in fluid dynamics, material properties, thermodynamics, control and dynamics. Data analysis methods including error analysis, validation, spectral analysis identification … For more content click the Read More button below.Introduction to data acquisition across a range of data types, analogue-digital sampling and signal conditioning. Data acquisition and processing functions using LabView. Current data measurement technologies and equipment, acquisition methodologies used in fluid dynamics, material properties, thermodynamics, control and dynamics. Data analysis methods including error analysis, validation, spectral analysis identification and interpretation of trends. Introduction to research practices, formation and testing of hypotheses as well as experiment design and project management. Communication skills and techniques, preparation of reports and oral presentations. Occupational health and safety.Read More about Overview",
                "offerings": {},
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite: Must have passed 96 credit points from engineering or science "
            }
        },
        {
            "code": "MEC3459",
            "credit points": "6",
            "name": "Materials selection for engineering design",
            "unit_details": {
                "overview": "Overview This unit introduces you to materials available for the fabrication of engineering components and structures. You will be instructed on the fundamentals of the role of composition and structure of materials in their mechanical properties that are important for engineering design. You will also learn how the materials with undesirable … For more content click the Read More button below.This unit introduces you to materials available for the fabrication of engineering components and structures. You will be instructed on the fundamentals of the role of composition and structure of materials in their mechanical properties that are important for engineering design. You will also learn how the materials with undesirable microstructure can lead to premature failures, particularly as a result of their interaction with aggressive environment. The knowledge thus developed will provide a basis for advanced learning on a systematic approach to materials selection as well as the methods by which the materials with the desired mechanical properties can be processed. Case studies will be presented to highlight the importance of selecting appropriate materials for engineering design.Read More about Overview",
                "offerings": {
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "MAE2401",
                        "MEC2403",
                        "TRC2201"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [
                        "MAE3406",
                        "CHE2167"
                    ],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "MEC3602",
            "credit points": "6",
            "name": "Biomedical microsystems",
            "unit_details": {
                "overview": "Overview This interdisciplinary unit will present the fundamental basis of biomedical microsystems for applications in small-scale engineering, biological sciences, and medicine. Selected topics include the fundamentals of miniaturization, microfabrication and material properties, microscopy methods, sensing and detection methods using microsystems, along with relevant applications and medical device regulations and standards. Biomedical … For more content click the Read More button below.This interdisciplinary unit will present the fundamental basis of biomedical microsystems for applications in small-scale engineering, biological sciences, and medicine. Selected topics include the fundamentals of miniaturization, microfabrication and material properties, microscopy methods, sensing and detection methods using microsystems, along with relevant applications and medical device regulations and standards. Biomedical microsystems are rapidly emerging as a dominant part of the biomedical industry, and these disciplines are central to biomedical engineering.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG1005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITES: Completion of 36 credit points in engineering study (including ENG1005) "
            }
        },
        {
            "code": "MEC3800",
            "credit points": "6",
            "name": "Introduction to reliability engineering",
            "unit_details": {
                "overview": "Overview This unit explores the importance of reliability engineering, with emphasis on mechanical systems. It provides an overview of basic statistical analysis and the evaluation and management of the reliability of a system. Additionally, it also provides an overview of product lifecycle management.\nThe following will be studied:\n\nIntroduction to reliability … For more content click the Read More button below.\nBasic probability and distribution functions\nProbability plotting\nReliability and rate of failure\nReliability prediction and modelling\nReliability of mechanical components and systems\nMaintainability and availability\nFundamentals of product lifecycle management\nProduct lifecycle management systems\nDeployment of the product lifecycle management system.\n\nReliability is the probability that a system will perform its function over a specified period of time and under specified operating conditions. In reliability engineering, the primary focus is on failures and their prevention. Reliability of a system needs to be addressed at every stage of the system development, including design, manufacturing, testing and maintenance.\nProcesses that make up different phases of the product lifecycle, as well as the general architecture of a product lifecycle management system, will also be discussed.This unit explores the importance of reliability engineering, with emphasis on mechanical systems. It provides an overview of basic statistical analysis and the evaluation and management of the reliability of a system. Additionally, it also provides an overview of product lifecycle management.\nThe following will be studied:\n\nIntroduction to reliability engineering\nBasic probability and distribution functions\nProbability plotting\nReliability and rate of failure\nReliability prediction and modelling\nReliability of mechanical components and systems\nMaintainability and availability\nFundamentals of product lifecycle management\nProduct lifecycle management systems\nDeployment of the product lifecycle management system.\n\nReliability is the probability that a system will perform its function over a specified period of time and under specified operating conditions. In reliability engineering, the primary focus is on failures and their prevention. Reliability of a system needs to be addressed at every stage of the system development, including design, manufacturing, testing and maintenance.\nProcesses that make up different phases of the product lifecycle, as well as the general architecture of a product lifecycle management system, will also be discussed.Read More about Overview",
                "offerings": {
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "MEC3828",
            "credit points": "6",
            "name": "Biomedical engineering and healthcare system",
            "unit_details": {
                "overview": "Overview This unit provides you with an overview of the application of Mechanical engineering concepts, such as heat and mass transport, fluid dynamics and control theories in the field of biomedical engineering and healthcare. This is conveyed through consideration of various topics in healthcare and medicine, and their comprehension through ordinary … For more content click the Read More button below.\nThe following topics will be the focus of this unit:1. Heat transfer in a biological system2. Fluid flow in the circulatory system3. Mass transport in biological tissue4. Medical imaging system5. Physiological modelling6. Glucose insulin system7. Cardiopulmonary system8. Mechanical ventilation system9. Ethics and biosafety\nTopics 1 - 3 cover the application of classical engineering theories to describe biophysical processes of the human body.\nTopic 4 introduces students to different medical imaging systems, such as infrared thermography, computed tomography (CT), magnetic resonance imaging (MRI) and ultrasound.\nTopic 5 introduces the concept of physiological modelling.\nThis is followed by Topics 6 - 8, where the application of physiological modelling in important human systems are studied.\nFinally, Topic 9 provides an overview of the importance of ethics compliance and biosafety in biomedical engineering.This unit provides you with an overview of the application of Mechanical engineering concepts, such as heat and mass transport, fluid dynamics and control theories in the field of biomedical engineering and healthcare. This is conveyed through consideration of various topics in healthcare and medicine, and their comprehension through ordinary and partial differential equations. You will learn to solve these differential equations analytically and numerically using the commercial software COMSOL Multiphysics and Matlab.\nThe following topics will be the focus of this unit:1. Heat transfer in a biological system2. Fluid flow in the circulatory system3. Mass transport in biological tissue4. Medical imaging system5. Physiological modelling6. Glucose insulin system7. Cardiopulmonary system8. Mechanical ventilation system9. Ethics and biosafety\nTopics 1 - 3 cover the application of classical engineering theories to describe biophysical processes of the human body.\nTopic 4 introduces students to different medical imaging systems, such as infrared thermography, computed tomography (CT), magnetic resonance imaging (MRI) and ultrasound.\nTopic 5 introduces the concept of physiological modelling.\nThis is followed by Topics 6 - 8, where the application of physiological modelling in important human systems are studied.\nFinally, Topic 9 provides an overview of the importance of ethics compliance and biosafety in biomedical engineering.Read More about Overview",
                "offerings": {
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "RSE3030",
            "credit points": "6",
            "name": "Ventilation for surface and underground spaces",
            "unit_details": {
                "overview": "Overview This unit provides the fundamentals of ventilation for surface and underground spaces, including properties of air, gas, heat, dust and pollutants control, principles of airflow, ventilation network theory, as well as surface and underground ventilation systems design, with the emphasis on analysis and practical application.This unit provides the fundamentals of ventilation for surface and underground spaces, including properties of air, gas, heat, dust and pollutants control, principles of airflow, ventilation network theory, as well as surface and underground ventilation systems design, with the emphasis on analysis and practical application.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "CIV2263",
                        "MEC2404",
                        "CHE2161"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prohibition: MNE3030 "
            }
        },
        {
            "code": "RSE3241",
            "credit points": "6",
            "name": "Hydropower",
            "unit_details": {
                "overview": "Overview This unit covers all aspects of hydropower, including the fundamental physics behind energy storage in potential energy, design of hydropower systems (dam walls and reservoirs, penstock piping and tunnelling, power house design (turbine and generator), tailrace and electrical connection). The operation of hydropower stations and their influence on the integrated … For more content click the Read More button below.This unit covers all aspects of hydropower, including the fundamental physics behind energy storage in potential energy, design of hydropower systems (dam walls and reservoirs, penstock piping and tunnelling, power house design (turbine and generator), tailrace and electrical connection). The operation of hydropower stations and their influence on the integrated electrical system. The unit covers recent developments in hydropower, in particular, the current trend towards more pumped hydro energy storage. Lectures will be delivered by both academic staff and industry experts who work on real-world hydropower projects.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005",
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "TRC3000",
            "credit points": "6",
            "name": "Automation project",
            "unit_details": {
                "overview": "Overview You will learn the planning and communication skills required to undertake a group project. An introduction will be given to the evolution of mechatronic technologies, design tools and methodologies, concurrent engineering design support tools, mechatronics design process and requirement interpretation. The acquisition of these skills will be motivated and tested … For more content click the Read More button below.You will learn the planning and communication skills required to undertake a group project. An introduction will be given to the evolution of mechatronic technologies, design tools and methodologies, concurrent engineering design support tools, mechatronics design process and requirement interpretation. The acquisition of these skills will be motivated and tested by applying them in a group project to design and build a mechatronic system. The mechatronic system will be based on a microcontroller together with appropriate mechanical structure, sensors and actuators.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "TRC4407"
                    ]
                },
                "rules": "PREREQUISITE: Completion of 18 credit points of level 2 engineering study "
            }
        },
        {
            "code": "TRC3500",
            "credit points": "6",
            "name": "Sensors and artificial perception",
            "unit_details": {
                "overview": "Overview The unit provides an introduction to transducer principles and the background to classify them in terms of performance and characteristics. A range of commonly available sensors are considered. Electronic components and data acquisition/digital signal processing software used in sensor systems are examined. Advanced sensory systems and associated programming techniques are … For more content click the Read More button below.The unit provides an introduction to transducer principles and the background to classify them in terms of performance and characteristics. A range of commonly available sensors are considered. Electronic components and data acquisition/digital signal processing software used in sensor systems are examined. Advanced sensory systems and associated programming techniques are introduced using robotic systems as an example domain.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisites: (ECE2031 or ECE2131 or ECE2061) and (ECE2071 or FIT1008 or (FIT1029 and FIT1040)) "
            }
        },
        {
            "code": "ECE4179",
            "credit points": "6",
            "name": "Neural networks and deep learning",
            "unit_details": {
                "overview": "Overview This unit introduces fundamentals of deep learning and how it can solve problems in many areas, such as image classification, filter design and natural language processing. Neural networks are first described and how training can be achieved with backpropagation. Various forms of deep neural networks are developed, such as multilayer … For more content click the Read More button below.This unit introduces fundamentals of deep learning and how it can solve problems in many areas, such as image classification, filter design and natural language processing. Neural networks are first described and how training can be achieved with backpropagation. Various forms of deep neural networks are developed, such as multilayer perceptrons, convolution neural networks and recurrent neural networks. The mathematics of stochastic optimisation is used to interpret and understand the behaviour and training of these networks. Programming approaches are discussed for training and deploying neural networks. Deep learning technologies and design examples are discussed in areas such as driverless cars, personal cognitive assistants and mastering of games such as GO.Read More about Overview",
                "offerings": {
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005",
                        "ECE2071"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisites: Or ENG2092 in place of ENG2005 "
            }
        },
        {
            "code": "ENG4700",
            "credit points": "6",
            "name": "Engineering technology for biomedical imaging and sensing",
            "unit_details": {
                "overview": "Overview Introduction to biomedical engineering from the perspective of engineering-based technologies of sensing and imaging. Topics include: basis of light and radiation, principles of synchrotron operation, practical study at the Australian synchrotron, human physiology for engineers, principles of detection and sensing of signals, biomedically relevant properties and phenomena. During this time … For more content click the Read More button below.Introduction to biomedical engineering from the perspective of engineering-based technologies of sensing and imaging. Topics include: basis of light and radiation, principles of synchrotron operation, practical study at the Australian synchrotron, human physiology for engineers, principles of detection and sensing of signals, biomedically relevant properties and phenomena. During this time project teams are formed and project proposals are developed. Project work continues with groups and individuals combining projects, allocated resources, knowledge and skills to develop a biomedical sensing device.Read More about Overview",
                "offerings": {},
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite: Completion of 90 credit points "
            }
        },
        {
            "code": "MEC4416",
            "credit points": "6",
            "name": "Momentum, energy & mass transport in engineering systems",
            "unit_details": {
                "overview": "Overview Unsteady heat conduction, numerical solutions to multi-dimensional conduction problems. Derivation of general governing equations for fluid flow, heat transfer and mass transfer. Free and forced convection heat transfer in laminar and turbulent flow regimes. Fundamentals of mass transfer. Introduction to two-phase heat transfer. Applications to mechanical engineering systems: fuel cells … For more content click the Read More button below.Unsteady heat conduction, numerical solutions to multi-dimensional conduction problems. Derivation of general governing equations for fluid flow, heat transfer and mass transfer. Free and forced convection heat transfer in laminar and turbulent flow regimes. Fundamentals of mass transfer. Introduction to two-phase heat transfer. Applications to mechanical engineering systems: fuel cells and alternative energy devices, heat pipes in electronics cooling, micro-scale heat transfer and bioheat transfer.Read More about Overview",
                "offerings": {},
                "prerequisite": {
                    "OR": [
                        "MEC4408",
                        "CHE2163",
                        "MEC3454",
                        "CHE2161"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "MEC4417",
            "credit points": "6",
            "name": "Refrigeration and air conditioning",
            "unit_details": {
                "overview": "Overview Review of mass and energy conservation and transfer processes; psychrometry and moist air properties; factors influencing human comfort; calculation of building thermal loads; simulation packages for calculating building loads; air conditioning systems; fans, pumps, ducts, etc in air conditioning plant; control systems in air conditioning plant; vapour compression and absorption … For more content click the Read More button below.Review of mass and energy conservation and transfer processes; psychrometry and moist air properties; factors influencing human comfort; calculation of building thermal loads; simulation packages for calculating building loads; air conditioning systems; fans, pumps, ducts, etc in air conditioning plant; control systems in air conditioning plant; vapour compression and absorption refrigeration; air conditioning and refrigeration in transportation; industrial fieldwork.Read More about Overview",
                "offerings": {
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "MEC3451",
                        "MEC2405"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "If you are currently enrolled in E6013 Master of Applied Engineering, you are exempt from the prerequisites requirement. "
            }
        },
        {
            "code": "MEC4418",
            "credit points": "6",
            "name": "Control systems",
            "unit_details": {
                "overview": "Overview Instruction on the basics of automatic control design, including analysis and design techniques (with MATLAB/SIMULINK). Assumes you have the ability to form and use classical and state-space models of linear systems, can calculate responses in time and frequency domain, and have experience in using MATLAB. Control system design through root-locus, … For more content click the Read More button below.Instruction on the basics of automatic control design, including analysis and design techniques (with MATLAB/SIMULINK). Assumes you have the ability to form and use classical and state-space models of linear systems, can calculate responses in time and frequency domain, and have experience in using MATLAB. Control system design through root-locus, frequency response, direct pole-placement, and state estimation, with concepts of linear systems, controllability, and observability. Introductions to robust stability, PID control design, digital systems, and optimal control design methods will also be provided.Read More about Overview",
                "offerings": {},
                "prerequisite": {
                    "OR": [
                        "MEC3457",
                        "MAE3408",
                        "TRC3600"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "MEC4425",
            "credit points": "6",
            "name": "Micro/nano solid and fluid mechanics",
            "unit_details": {
                "overview": "Overview Introducing micro and nano-technology in the design of next-generation microelectromechanical systems, microfluidic devices and biomedical applications. Basic concepts and physics of small-scale systems are covered. Topics include: scaling effects, nanofabrication techniques, continuum mechanical theories, low Reynolds number flows, capillary effects and interfacial flows, flows in channels of arbitrary dimensions, convective-diffusive … For more content click the Read More button below.Introducing micro and nano-technology in the design of next-generation microelectromechanical systems, microfluidic devices and biomedical applications. Basic concepts and physics of small-scale systems are covered. Topics include: scaling effects, nanofabrication techniques, continuum mechanical theories, low Reynolds number flows, capillary effects and interfacial flows, flows in channels of arbitrary dimensions, convective-diffusive mass transport, electro hydrodynamics including classical double layer theory, electrophoresis, electro-osmosis, dielectric polarisation and dielectrophoresis. The course also focuses on device applications, specifically MEMS sensors and actuators and lab-on-chip devices, through hands-on laboratory sessions (held at Melbourne Centre for Nanofabrication).Read More about Overview",
                "offerings": {},
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite: Or 120 points of engineering study and TRC2200, TRC3200 "
            }
        },
        {
            "code": "MEC4428",
            "credit points": "6",
            "name": "Advanced dynamics",
            "unit_details": {
                "overview": "Overview Focus on advanced kinematics and dynamics with a variety of applications in fluid and solid mechanics, robotics and electromechanical systems. Study of how kinematic constraints are incorporated into forming the governing equations and their relationship with constraint forces. Dynamics incorporating collisions. Using rotating coordinate systems to solve dynamics problems. Two- … For more content click the Read More button below.Focus on advanced kinematics and dynamics with a variety of applications in fluid and solid mechanics, robotics and electromechanical systems. Study of how kinematic constraints are incorporated into forming the governing equations and their relationship with constraint forces. Dynamics incorporating collisions. Using rotating coordinate systems to solve dynamics problems. Two- and three-dimensional rigid body dynamics. Consideration of nonlinearities in the dynamic response of everyday structures. Instruction on advanced topics in analytical dynamics, incorporating D'Alembert's principle, Hamilton's principle and the general Lagrange equations. Reinforcement of concepts through computer analysis using Matlab or Mathematica.Read More about Overview",
                "offerings": {},
                "prerequisite": {
                    "OR": [
                        "MEC3453",
                        "MAE3404",
                        "TRC3200"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "MEC4444",
            "credit points": "6",
            "name": "Introduction to engineering acoustics",
            "unit_details": {
                "overview": "Overview Fundamentals of sound and sound propagation, wave equation, Helmholtz equation, absorption, impedance and intensity, silencers. Transmission from one medium to another, applications and optimisation. Transmission through walls, mass law, coincidence and resonance. Sound transmission in the atmosphere, inverse square law, excess attenuation. Radiation of sound, directivity. Sound in enclosed spaces. … For more content click the Read More button below.Fundamentals of sound and sound propagation, wave equation, Helmholtz equation, absorption, impedance and intensity, silencers. Transmission from one medium to another, applications and optimisation. Transmission through walls, mass law, coincidence and resonance. Sound transmission in the atmosphere, inverse square law, excess attenuation. Radiation of sound, directivity. Sound in enclosed spaces. Noise sources, noise reduction techniques, noise legislation and regulation, acceptable noise levels, hearing conservation, measurement and analysis of noise, design for low noise.Read More about Overview",
                "offerings": {
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "MEC3453",
                        "TRC3200"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "If you are currently enrolled in E6013 Master of Applied Engineering, you are exempt from the prerequisites requirement. "
            }
        },
        {
            "code": "MEC4446",
            "credit points": "6",
            "name": "Composite structures",
            "unit_details": {
                "overview": "Overview Specific modulus and specific strength; 3D stress and 3D strain tensors; anisotropic elasticity; composite lamina and composite laminate; hygrothermal strain and hygrothermal stress analysis of composite structures; failure theories for a composite lamina; micromechanical analysis of a composite lamina; classical lamination theory for composite laminate, failure analysis of composite laminates, … For more content click the Read More button below.Specific modulus and specific strength; 3D stress and 3D strain tensors; anisotropic elasticity; composite lamina and composite laminate; hygrothermal strain and hygrothermal stress analysis of composite structures; failure theories for a composite lamina; micromechanical analysis of a composite lamina; classical lamination theory for composite laminate, failure analysis of composite laminates, design of composite laminates, finite element analysis of composite materials and structures.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "MAE4426"
                    ]
                },
                "rules": "Prerequisite: 120 credit points of engineering study "
            }
        },
        {
            "code": "MEC4447",
            "credit points": "6",
            "name": "Computers in fluids and energy",
            "unit_details": {
                "overview": "Overview Computational Fluid Dynamics (CFD) is a well-established analysis, design and optimisation approach for industrial fluid and heat transfer problems. Examples include turbomachinery, vehicle aerodynamics and aeronautics. It is also a powerful research tool and is being increasingly used to answer fundamental questions in a wide range of fields, from astrophysics … For more content click the Read More button below.Computational Fluid Dynamics (CFD) is a well-established analysis, design and optimisation approach for industrial fluid and heat transfer problems. Examples include turbomachinery, vehicle aerodynamics and aeronautics. It is also a powerful research tool and is being increasingly used to answer fundamental questions in a wide range of fields, from astrophysics to nanomaterials. This Unit provides an introduction to this mathematically sophisticated discipline. This involves a review of the equations governing motion and energy of fluids, the mathematical properties of these equations and the relevance of such properties to obtaining numerical solutions. The basics of numerical discretization and solution methods will be discussed. The Unit will also introduce you to using commercial CFD packages in analysing complex industrial problems involving fluids.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ECE3093",
                        "MAE3456",
                        "MEC3456",
                        "MEC3456"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "MEC4456",
            "credit points": "6",
            "name": "Robotics",
            "unit_details": {
                "overview": "Overview Spatial descriptions and transformations. Manipulator forward and inverse kinematics. Differential relationships and Jacobian. Manipulator dynamics: Lagrangian and Newton Euler formulations. Design of mechanisms and end-effectors. Actuation, sensing and control. Computational geometry for design, manufacture, and path planning. Robotics in manufacturing and automation. Techniques for modelling, simulation and programming of robotic … For more content click the Read More button below.Spatial descriptions and transformations. Manipulator forward and inverse kinematics. Differential relationships and Jacobian. Manipulator dynamics: Lagrangian and Newton Euler formulations. Design of mechanisms and end-effectors. Actuation, sensing and control. Computational geometry for design, manufacture, and path planning. Robotics in manufacturing and automation. Techniques for modelling, simulation and programming of robotic tasks. Advanced mathematical formulations. Introduction to advanced robotics. A self-directed learning component completes the unit.Read More about Overview",
                "offerings": {},
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "MEC3457"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "TRC4800"
                    ]
                },
                "rules": null
            }
        },
        {
            "code": "MEC4459",
            "credit points": "6",
            "name": "Wind engineering",
            "unit_details": {
                "overview": "Overview This unit introduces aerodynamic concepts applicable to both wind energy and wind engineering. It conveys the fundamentals of the wind environment, and how the wind interacts with both turbines to generate power, and structures to cause loads.\nThe unit will be conveyed in three sections: the wind environment, wind energy … For more content click the Read More button below.\nWind engineering is a broad field that concerns the manner that the wind resource can be understood and harnessed for the benefit of society, and the need to understand the potentially damaging effects for design purposes, such as wind effects on structures. Examples of wind engineering areas include the effect of wind on structures and their surrounding environment, building ventilation, pollution dispersion, and energy production from wind.\nYou will first develop an understanding of the natural wind environment, which is essential to both the assessment of the performance of wind turbines and the estimation of structural wind loads. The significance of the wind environment to engineering problems, both structural and mechanical, is explored. The section on wind energy aerodynamic considers the science associated with the production of power from the wind. An understanding of the wind resource and the aerodynamics of wind turbines, including turbine performance, analysis methods, wind turbine siting, and blade/component loading will be developed. The wind engineering section is primarily concerned with understanding wind effects on structures, although other wind engineering problems such as pedestrian level winds, pollutions dispersion and wind-generated noise are discussed. The techniques (including wind tunnel and code-based) available to the engineer, when estimating wind loads, are introduced and applied, providing experience in solving practical engineering problems.This unit introduces aerodynamic concepts applicable to both wind energy and wind engineering. It conveys the fundamentals of the wind environment, and how the wind interacts with both turbines to generate power, and structures to cause loads.\nThe unit will be conveyed in three sections: the wind environment, wind energy and wind engineering.\nWind engineering is a broad field that concerns the manner that the wind resource can be understood and harnessed for the benefit of society, and the need to understand the potentially damaging effects for design purposes, such as wind effects on structures. Examples of wind engineering areas include the effect of wind on structures and their surrounding environment, building ventilation, pollution dispersion, and energy production from wind.\nYou will first develop an understanding of the natural wind environment, which is essential to both the assessment of the performance of wind turbines and the estimation of structural wind loads. The significance of the wind environment to engineering problems, both structural and mechanical, is explored. The section on wind energy aerodynamic considers the science associated with the production of power from the wind. An understanding of the wind resource and the aerodynamics of wind turbines, including turbine performance, analysis methods, wind turbine siting, and blade/component loading will be developed. The wind engineering section is primarily concerned with understanding wind effects on structures, although other wind engineering problems such as pedestrian level winds, pollutions dispersion and wind-generated noise are discussed. The techniques (including wind tunnel and code-based) available to the engineer, when estimating wind loads, are introduced and applied, providing experience in solving practical engineering problems.Read More about Overview",
                "offerings": {},
                "prerequisite": {
                    "OR": [
                        "CIV2263",
                        "MEC2404",
                        "MAE2404"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite: And 120 credit points of engineering study. "
            }
        },
        {
            "code": "MEC4801",
            "credit points": "6",
            "name": "Non-destructive testing and inspection",
            "unit_details": {
                "overview": "Overview This unit explores various established techniques such as dye penetration, magnetic particle, eddy current, ultrasonic and radiography for non-destructive testing (NDT) and contrasts them with destructive methods. Industry standards for NDT and acceptance standards will be included. Case studies from a variety of industries which include microelectronics, aerospace, marine, railway … For more content click the Read More button below.This unit explores various established techniques such as dye penetration, magnetic particle, eddy current, ultrasonic and radiography for non-destructive testing (NDT) and contrasts them with destructive methods. Industry standards for NDT and acceptance standards will be included. Case studies from a variety of industries which include microelectronics, aerospace, marine, railway and petrochemical industries will be discussed.Read More about Overview",
                "offerings": {
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite\nMust have passed 96 credit points from Engineering or Science "
            }
        },
        {
            "code": "MEC4802",
            "credit points": "6",
            "name": "Sustainable engineering and design with nanomaterials",
            "unit_details": {
                "overview": "Overview Sustainable engineering and design with nanomaterials explores the selection, design and characterising of nanomaterials in developing sustainable engineering solutions that are verified using the life cycle assessment tool to enable you to design nanomaterials which are beneficial to the social and economic advancement. Examples include mineral nanotubes, titanium dioxide nanoparticles, … For more content click the Read More button below.Sustainable engineering and design with nanomaterials explores the selection, design and characterising of nanomaterials in developing sustainable engineering solutions that are verified using the life cycle assessment tool to enable you to design nanomaterials which are beneficial to the social and economic advancement. Examples include mineral nanotubes, titanium dioxide nanoparticles, carbon nanotubes, polymer nanocomposites, and bionanocomposites. The ability to design nanomaterials are developed through an appreciation of the theory and working principles of various preparation methods and characterisation techniques.Read More about Overview",
                "offerings": {},
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "MEC3459"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "MEC4803",
            "credit points": "6",
            "name": "Internal combustion engines",
            "unit_details": {
                "overview": "Overview This unit is an advanced undergraduate module, which aims to develop an indepth understanding of current and future internal combustion engines technologies. This unit covers fundamental concepts, principles and applications of internal combustion engines and related components.\nThe following topics will be covered in depth in this unit:\n1. Design … For more content click the Read More button below.\n2. Performance, efficiency and energy flow\n3. Fuel delivery and gas exchange processes\n4. Combustion, heat-release and work transfer\n5. After-treatment system, emission and test regulations.This unit is an advanced undergraduate module, which aims to develop an indepth understanding of current and future internal combustion engines technologies. This unit covers fundamental concepts, principles and applications of internal combustion engines and related components.\nThe following topics will be covered in depth in this unit:\n1. Design features, function and layout of various internal combustion engines\n2. Performance, efficiency and energy flow\n3. Fuel delivery and gas exchange processes\n4. Combustion, heat-release and work transfer\n5. After-treatment system, emission and test regulations.Read More about Overview",
                "offerings": {
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "MEC2405",
                        "CHE2164"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "MEC4804",
            "credit points": "6",
            "name": "Clean energy materials",
            "unit_details": {
                "overview": "Overview This unit aims to introduce materials that revolutionise the current world with various energy options and future development trends. This unit covers fundamental concepts, principles and applications of energy materials, focusing on the design and development of advanced materials for sustainable energy generation and storage system. The following materials will … For more content click the Read More button below.This unit aims to introduce materials that revolutionise the current world with various energy options and future development trends. This unit covers fundamental concepts, principles and applications of energy materials, focusing on the design and development of advanced materials for sustainable energy generation and storage system. The following materials will be discussed, such as semiconductors for photovoltaics, solar cells, thermoelectric materials, piezoelectric materials, fuel cells, hydrogen production and storage. Preparation techniques and testing methods of energy materials will be included.Read More about Overview",
                "offerings": {
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITE: Completion of 90 credit points of engineering study.\nIf you are currently enrolled in E6013 Master of Applied Engineering, you are exempt from this rule. "
            }
        },
        {
            "code": "TRC4200",
            "credit points": "6",
            "name": "Engineering cyber-physical systems",
            "unit_details": {
                "overview": "Overview The unit aims to impart knowledge, skills, and experience required to prepare graduates for the impending digital transformation driving the convergence of technologies that result in Cyber-Physical Systems (CPS). An introduction will be given to Cyber-Physical Systems (CPS). The evolution of key technologies, transformation to digital chains and the need … For more content click the Read More button below.The unit aims to impart knowledge, skills, and experience required to prepare graduates for the impending digital transformation driving the convergence of technologies that result in Cyber-Physical Systems (CPS). An introduction will be given to Cyber-Physical Systems (CPS). The evolution of key technologies, transformation to digital chains and the need to seamlessly combine organisational and technological issues into a single framework will be discussed. A real-life scenario will be used to motivate you to apply CPS technologies to design and develop Smart Systems in any domain of their specialisation and interest. Using the concept of Learning Factories (LF) - a platform to impart experience-based knowledge - the developed solution will be built and tested as a group project.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "MEC3457",
                        "MAE3408",
                        "MEC2402",
                        "ECE3091"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Additional prerequisite:\nCompletion of 96 credit points of engineering study which includes the prerequisite units mentioned. "
            }
        },
        {
            "code": "TRC4800",
            "credit points": "6",
            "name": "Robotics",
            "unit_details": {
                "overview": "Overview The unit will cover the fundamentals of robotics and robotic automation. The contents include spatial descriptions and transformations, manipulator forward and inverse kinematics, differential relationships and the Jacobian. Manipulator dynamics. Problem specification and solution preparation. Manipulator and end-effector configuration and design. Manipulator position control, involving sensing and actuation. Robotics in … For more content click the Read More button below.The unit will cover the fundamentals of robotics and robotic automation. The contents include spatial descriptions and transformations, manipulator forward and inverse kinematics, differential relationships and the Jacobian. Manipulator dynamics. Problem specification and solution preparation. Manipulator and end-effector configuration and design. Manipulator position control, involving sensing and actuation. Robotics in manufacturing and automation. Task Planning and techniques for modelling, simulation and programming of robotic tasks. Computational geometry for design and manufacture. Introduction to autonomous systems.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "TRC3600",
                        "MEC3457"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "MEC4456"
                    ]
                },
                "rules": null
            }
        },
        {
            "code": "MEC5801",
            "credit points": "6",
            "name": "Industrial ecology",
            "unit_details": {
                "overview": "Overview This new unit will provide analytical tools and methods for implementing principles of industrial ecology. The course will encompass sustainability concepts and tools on the potential role of industry in reducing environmental burdens throughout the product life cycle from the extraction of raw materials, to the production of goods, dematerialization, … For more content click the Read More button below.This new unit will provide analytical tools and methods for implementing principles of industrial ecology. The course will encompass sustainability concepts and tools on the potential role of industry in reducing environmental burdens throughout the product life cycle from the extraction of raw materials, to the production of goods, dematerialization, and to the use of those goods and to the management of the resulting waste. The practical applications covered in the course will be based largely on current research in the area of life cycle assessment (LCA). Case studies will be used to demonstrate concepts and principles of industrial ecology with the accomplishments of LCA. The unit would take a systems perspective in seeking the answers to questions such as how to improve resource efficiency; how to minimize waste generation; which material to use considering their costs, supply security, and criticality; and how to design an industrial process to minimize its resource and environmental risks. The unit will be highly beneficial for students, researchers, professionals, policymakers and engineers working in the industries.Read More about Overview",
                "offerings": {
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "You must be currently enrolled in a master’s course in engineering or related STEM and in a related discipline. The unit assumes that you have the necessary foundational knowledge. "
            }
        },
        {
            "code": "MEC5881",
            "credit points": "6",
            "name": "Engineering systems performance analysis",
            "unit_details": {
                "overview": "Overview This unit complements systems design. The unit will integrate fundamental concepts in solid and fluid mechanics and dynamics and, in so doing, will highlight the roles they play in determining the performance of an engineering system.\nYou will use advanced computational tools to study how these concepts are crucial to … For more content click the Read More button below.This unit complements systems design. The unit will integrate fundamental concepts in solid and fluid mechanics and dynamics and, in so doing, will highlight the roles they play in determining the performance of an engineering system.\nYou will use advanced computational tools to study how these concepts are crucial to competitive economic performance and to the long-term sustainability of an engineered system.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "T3-57-OS-CHI-SEU-ON-CAMPUS": {
                        "location": [
                            "Suzhou"
                        ],
                        "teaching_period": "Term 3",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "You must be currently enrolled in a master’s course in engineering or related STEM and in a related discipline. The unit assumes that you have the necessary foundational knowledge. "
            }
        },
        {
            "code": "MEC5882",
            "credit points": "6",
            "name": "Instrumentation, sensing and monitoring",
            "unit_details": {
                "overview": "Overview Advanced instrumentation and sensing necessitate a multi-disciplinary approach in order to monitor engineering systems as diverse as renewable energy, aerospace, buildings, transportation, telecommunications and biomedical devices.\nThe monitoring and assessment techniques are founded on the fundamentals of mechanical engineering, electrical and electronic engineering and information technology.\nThe unit covers the … For more content click the Read More button below.\nData visualisation will also be discussed. The unit will explore frequency of monitoring in relation to the volume of data collected and strategies for data reduction.Advanced instrumentation and sensing necessitate a multi-disciplinary approach in order to monitor engineering systems as diverse as renewable energy, aerospace, buildings, transportation, telecommunications and biomedical devices.\nThe monitoring and assessment techniques are founded on the fundamentals of mechanical engineering, electrical and electronic engineering and information technology.\nThe unit covers the exploration of strategies for efficient instrumentation of engineering assets. You will use a range of sensing technologies to gather real-time information and use industry-standard approaches to data analyses, characterisation, fault assessment and reporting methodologies at various stages of product design and product development.\nData visualisation will also be discussed. The unit will explore frequency of monitoring in relation to the volume of data collected and strategies for data reduction.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "You must be currently enrolled in a master’s course in engineering or related STEM and in a related discipline. The unit assumes that you have the necessary foundational knowledge. "
            }
        },
        {
            "code": "MEC5883",
            "credit points": "6",
            "name": "Mechanical systems design",
            "unit_details": {
                "overview": "Overview This unit will emphasise engineering design with a focus on designing a system rather than the individual components of a system. In this way, the unit will integrate mechanical design with material selection, manufacture, and control systems, and the needs of in-service monitoring to optimise system performance. Quality management systems, … For more content click the Read More button below.\nThis unit uses case studies, group work and design projects as key learning methodologies to integrate theoretical knowledge with practical outcomes. You can expect a strong practical focus with extensive use of computer-aided design and analysis software.This unit will emphasise engineering design with a focus on designing a system rather than the individual components of a system. In this way, the unit will integrate mechanical design with material selection, manufacture, and control systems, and the needs of in-service monitoring to optimise system performance. Quality management systems, lean techniques and lifecycle assessment will be applied to the proposed product or service to understand system variability, maximise and maintain value-creation and assess environmental impacts.\nThis unit uses case studies, group work and design projects as key learning methodologies to integrate theoretical knowledge with practical outcomes. You can expect a strong practical focus with extensive use of computer-aided design and analysis software.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "You must be currently enrolled in a master’s course in engineering or related STEM and in a related discipline. The unit assumes that you have the necessary foundational knowledge. "
            }
        },
        {
            "code": "MEC5884",
            "credit points": "6",
            "name": "Sustainable engineering systems",
            "unit_details": {
                "overview": "Overview Sustainable engineering systems are optimised to use resources in a sustainable way - such that the demand of the systems does not deplete the supply of resources and in fact can contribute to that supply.\nThis unit involves a rethink in the way we engineer. At one level, it can … For more content click the Read More button below.Sustainable engineering systems are optimised to use resources in a sustainable way - such that the demand of the systems does not deplete the supply of resources and in fact can contribute to that supply.\nThis unit involves a rethink in the way we engineer. At one level, it can involve water harvesting, co-generation of power or the use of alternative/renewable power sources but at a more fundamental level, it requires us to design smart, adaptive structures and devices.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "You must be currently enrolled in a master’s course in engineering or related STEM and in a related discipline. The unit assumes that you have the necessary foundational knowledge. "
            }
        },
        {
            "code": "MEC5885",
            "credit points": "6",
            "name": "Energy efficiency and sustainability engineering",
            "unit_details": {
                "overview": "Overview This unit explores the theory and practice of the supply of energy, energy management and auditing, and the design of sustainable energy facilities. It deals with the systems needed to create low-energy, sustainable buildings, including passive solar design, energy-efficient heating and air-conditioning, and combined heat and power.\nIn addition, it … For more content click the Read More button below.This unit explores the theory and practice of the supply of energy, energy management and auditing, and the design of sustainable energy facilities. It deals with the systems needed to create low-energy, sustainable buildings, including passive solar design, energy-efficient heating and air-conditioning, and combined heat and power.\nIn addition, it includes coverage of transport energy and energy economics. Case studies from a variety of energy-focused industries such as building services, environmental engineering, heating, ventilation, and air conditioning (HVAC) and architectural technology will be discussed.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "You must be currently enrolled in a master’s course in engineering or related STEM and in a related discipline. The unit assumes that you have the necessary foundational knowledge. "
            }
        },
        {
            "code": "MEC5886",
            "credit points": "6",
            "name": "Sustainable energy technologies",
            "unit_details": {
                "overview": "Overview The unit is designed to provide you with a challenging and intellectually stimulating environment covering numerous aspects of current and future sustainable energy technologies.\nThe unit is intended to introduce and investigate present and emerging trends in the sustainable technologies, including clean fuels, renewable energy systems and hybrid energy systems. … For more content click the Read More button below.The unit is designed to provide you with a challenging and intellectually stimulating environment covering numerous aspects of current and future sustainable energy technologies.\nThe unit is intended to introduce and investigate present and emerging trends in the sustainable technologies, including clean fuels, renewable energy systems and hybrid energy systems. Case studies and discussions with leading energy researchers within the University and elsewhere with emphasis on system approach will be undertaken.Read More about Overview",
                "offerings": {
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "MEC6886"
                    ]
                },
                "rules": "You must be currently enrolled in a master’s course in engineering or related STEM and in a related discipline. The unit assumes that you have the necessary foundational knowledge. "
            }
        },
        {
            "code": "MEC5888",
            "credit points": "6",
            "name": "Renewable energy systems",
            "unit_details": {
                "overview": "Overview This unit examines the thermodynamics of renewable energy systems (principally solar, wind, tidal, hydro, biomass and variants of these); their efficiency; the design of such systems and their selection for differing environments around the globe; reliability of the energy source; trends in renewable energy systems; and the associated environmental and … For more content click the Read More button below.This unit examines the thermodynamics of renewable energy systems (principally solar, wind, tidal, hydro, biomass and variants of these); their efficiency; the design of such systems and their selection for differing environments around the globe; reliability of the energy source; trends in renewable energy systems; and the associated environmental and economic factors. The unit also examines the regulatory environment as a predictor for the uptake of renewable energy systems.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "MEC6888"
                    ]
                },
                "rules": "You must be currently enrolled in a master’s course in engineering or related STEM and in a related discipline. The unit assumes that you have the necessary foundational knowledge. "
            }
        },
        {
            "code": "MEC5891",
            "credit points": "6",
            "name": "Design for additive manufacturing",
            "unit_details": {
                "overview": "Overview Additive manufacturing allows components to be produced with reduced weight, reduced part count, less scrap, and increased complexity compared to conventional manufacturing processes. However, components must be redesigned to take advantage of these advantages. This unit introduces you to the principles of design for additive manufacturing; the optimisation of designs; … For more content click the Read More button below.Additive manufacturing allows components to be produced with reduced weight, reduced part count, less scrap, and increased complexity compared to conventional manufacturing processes. However, components must be redesigned to take advantage of these advantages. This unit introduces you to the principles of design for additive manufacturing; the optimisation of designs; and the practical design-to-product workflow.Read More about Overview",
                "offerings": {
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-OS-CHI-SEU-ON-CAMPUS": {
                        "location": [
                            "Suzhou"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "MEC6891"
                    ]
                },
                "rules": "You must be currently enrolled in a master’s course in engineering or related STEM and in a related discipline. The unit assumes that you have the necessary foundational knowledge. "
            }
        },
        {
            "code": "MEC5897",
            "credit points": "6",
            "name": "Lean manufacturing",
            "unit_details": {
                "overview": "Overview In this unit, you will learn why lean is a key driver for sustainable competitive advantage. You will be introduced to the concepts and principles of lean manufacturing and its relationship to sustainability. Using a range of industry case studies, you will evaluate how to maximise customer value while minimising … For more content click the Read More button below.In this unit, you will learn why lean is a key driver for sustainable competitive advantage. You will be introduced to the concepts and principles of lean manufacturing and its relationship to sustainability. Using a range of industry case studies, you will evaluate how to maximise customer value while minimising waste. You will learn how to analyse process flows in order to establish capacity and identify bottlenecks. Topics covered include lean concepts, resource minimisation, pull vs. push philosophy, just-in time production, value stream mapping, and the impact of these methods on business, environment and social value.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "T3-57-OS-CHI-SEU-ON-CAMPUS": {
                        "location": [
                            "Suzhou"
                        ],
                        "teaching_period": "Term 3",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "CHE5887"
                    ]
                },
                "rules": "You must be currently enrolled in a master’s course in engineering or related STEM and in a related discipline. The unit assumes that you have the necessary foundational knowledge. "
            }
        },
        {
            "code": "TRC5801",
            "credit points": "6",
            "name": "Operations and supply chain management",
            "unit_details": {
                "overview": "Overview This unit covers a combination of the operations management and supply chain management concepts from the strategic, tactical and operational perspectives. These include operations & productivity, supply chain management (including vendor, warehouse and distribution channel management and procurement and outsourcing), project management, managing quality, process strategy, capacity and constraint management, … For more content click the Read More button below.This unit covers a combination of the operations management and supply chain management concepts from the strategic, tactical and operational perspectives. These include operations & productivity, supply chain management (including vendor, warehouse and distribution channel management and procurement and outsourcing), project management, managing quality, process strategy, capacity and constraint management, layout strategies (floor space optimisation), inventory management, material requirement planning and enterprise resource planning, lean operations (including JIT and Kanban) and maintenance and reliability (including Total Productive Maintenance).Read More about Overview",
                "offerings": {
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "You must be currently enrolled in a master’s course in engineering or related STEM and in a related discipline. The unit assumes that you have the necessary foundational knowledge.\n  "
            }
        }
    ]
}