{
    "code": "ROBMCTRN03",
    "credit points": "144",
    "name": "Robotics and mechatronics engineering",
    "core_units": [
        {
            "code": "ECE2071",
            "state": 1,
            "sem": 1,
            "credit points": "6",
            "name": "Computer organisation and programming",
            "unit_details": {
                "overview": "Overview This unit provides an introduction to computers and CPU organisation, assemblers and compilers, and algorithm design for engineering problems and embedded computer systems. It covers the language C and its implementation on a typical computer, including standard data types, arrays, control statements, functions, including ways of parameter passing, C library … For more content click the Read More button below.This unit provides an introduction to computers and CPU organisation, assemblers and compilers, and algorithm design for engineering problems and embedded computer systems. It covers the language C and its implementation on a typical computer, including standard data types, arrays, control statements, functions, including ways of parameter passing, C library functions, pointers, strings, arrays of pointers, structures, linked lists and binary tree data structures, dynamic memory allocations, and calls to assembly language programs. Object-oriented programming is introduced. Software engineering is covered as the methodology of software development and lifecycle models. Operating system concepts are introduced. The unit also includes an introduction to programmable logic controllers (PLCs).Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1003",
                        "ENG1013",
                        "ENG1014"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "ECE2131",
            "state": 1,
            "sem": 1,
            "credit points": "6",
            "name": "Electrical circuits",
            "unit_details": {
                "overview": "Overview This unit provides foundation knowledge for analogue circuit analysis and design. You will be introduced to the fundamentals of linear electronic circuit analysis and design. At the completion of the unit, you will develop skills in using state of the art prototyping and measurement tools for linear electronic circuit analysis … For more content click the Read More button below.\nThe unit will provide a grounding in circuit theory leading to solutions of electrical networks with node and mesh analysis, equivalent sources, two-port representations and simulation. AC analysis with phasors, first and second-order transient responses will be included. Frequency and time response will be developed with Laplace transform techniques.This unit provides foundation knowledge for analogue circuit analysis and design. You will be introduced to the fundamentals of linear electronic circuit analysis and design. At the completion of the unit, you will develop skills in using state of the art prototyping and measurement tools for linear electronic circuit analysis and design. The topics covered in this course include sinusoidal steady-state analysis using phasors and complex impedances, feedback concepts, solid-state electronics, solid-state diodes and diode circuits, field-effect transistors, bipolar junction transistors and operational amplifiers.\nThe unit will provide a grounding in circuit theory leading to solutions of electrical networks with node and mesh analysis, equivalent sources, two-port representations and simulation. AC analysis with phasors, first and second-order transient responses will be included. Frequency and time response will be developed with Laplace transform techniques.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1013",
                        "ENG1002"
                    ],
                    "AND": [
                        "ENG1005",
                        "ENG1005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ECE2031"
                    ]
                },
                "rules": null
            }
        },
        {
            "code": "MEC2402",
            "state": 1,
            "sem": 1,
            "credit points": "6",
            "name": "Design methods",
            "unit_details": {
                "overview": "Overview This unit will help you to develop a systematic method of capturing design requirements, tools for ideation, estimation and decision-making. Primary and secondary manufacturing processes, assembly techniques. Engineering graphics for problem-solving, manufacturing communication and ideation. Report writing, teamwork in solving design problems involving the integration of mechanical elements in prototype … For more content click the Read More button below.This unit will help you to develop a systematic method of capturing design requirements, tools for ideation, estimation and decision-making. Primary and secondary manufacturing processes, assembly techniques. Engineering graphics for problem-solving, manufacturing communication and ideation. Report writing, teamwork in solving design problems involving the integration of mechanical elements in prototype conception, construction and testing.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "MAE2412"
                    ]
                },
                "rules": "Prerequisite: 12 engineering credit points at level 1\nE6011 Master of Professional Engineering - You are exempt from the prerequisite rule if you are enrolled in this course. "
            }
        },
        
        {
            "code": " ",
            "state": 2
        },
        {
            "code": "ENG2005",
            "state": 1,
            "sem": 0,
            "credit points": "6",
            "name": "Advanced engineering mathematics",
            "unit_details": {
                "overview": "Overview This unit introduces advanced mathematical concepts required for all disciplines of engineering that extend on the concepts in ENG1005 Engineering mathematics.\nMajor concepts taught using engineering contexts include multivariable and vector calculus, Fourier series and partial differential equations. Specific topics include partial derivatives, double and triple integrals with change of … For more content click the Read More button below.This unit introduces advanced mathematical concepts required for all disciplines of engineering that extend on the concepts in ENG1005 Engineering mathematics.\nMajor concepts taught using engineering contexts include multivariable and vector calculus, Fourier series and partial differential equations. Specific topics include partial derivatives, double and triple integrals with change of coordinates, vector functions and operators, parametric curves and surfaces, periodic functions, Laplace transforms, ODE boundary value problems, partial differential equation solution techniques and applications.Read More about Overview",
                "offerings": {
                    "NOV12-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "November teaching period",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1014",
                        "ENG1060"
                    ],
                    "AND": [
                        "ENG1005",
                        "ENG1005"
                    ]
                },
                "prohibition": {
                    "OR": [
                        "MTH2010",
                        "MTH2015"
                    ],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "ECE2072",
            "state": 1,
            "sem": 2,
            "credit points": "6",
            "name": "Digital systems",
            "unit_details": {
                "overview": "Overview This unit introduces you to modern logic design techniques, hardware used and common representations. Topics include two and multi-level combinational logic, decoders, multiplexers, arithmetic circuits, programmable and steering logic, flip-flops, registers, counters, RAM and ROM. Using this hardware the design component will include finite state machine design and applications to … For more content click the Read More button below.This unit introduces you to modern logic design techniques, hardware used and common representations. Topics include two and multi-level combinational logic, decoders, multiplexers, arithmetic circuits, programmable and steering logic, flip-flops, registers, counters, RAM and ROM. Using this hardware the design component will include finite state machine design and applications to computer data path control. This will incorporate simple analogue and digital I/O interfacing. Programmable logic devices will be covered, and the use of a hardware description language for describing, synthesising and testing digital logic. Laboratories cover logic design, implementation, and testing.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite: 24 credit points from the Faculty of Engineering or the Faculty of Information Technology\nE6011 Master of Professional Engineering - You are exempt from the prerequisite rule if you are enrolled in this course. "
            }
        },
        {
            "code": "TRC2201",
            "state": 1,
            "sem": 2,
            "credit points": "6",
            "name": "Mechanics",
            "unit_details": {
                "overview": "Overview Kinematics: position, velocity and acceleration; relative motion analysis and applications for particles and rigid bodies. Dynamics: the translational and rotational motion of free and constrained forces, their origin and significance; equation of motion, the principle of impulse and momentum, principles of work and energy, analysis of planar motion, fundamentals of … For more content click the Read More button below.Kinematics: position, velocity and acceleration; relative motion analysis and applications for particles and rigid bodies. Dynamics: the translational and rotational motion of free and constrained forces, their origin and significance; equation of motion, the principle of impulse and momentum, principles of work and energy, analysis of planar motion, fundamentals of mechanical vibrations. Strength of materials: stress and strain in 2D and 3D space, Hookes law, shear force and bending moments, moments of area, deflection of beams, equilibrium and compatibility equations, stress and strain transformation, Mohr circle, simple failure criteria, elastic instability - buckling.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "MEC2401"
                    ]
                },
                "rules": "Prerequisite: Completion of 42 credit points "
            }
        },
        
        {
            "code": " ",
            "state": 2
        },
        {
            "code": "ECE3161",
            "state": 1,
            "sem": 1,
            "credit points": "6",
            "name": "Analogue electronics",
            "unit_details": {
                "overview": "Overview The unit consolidates MOS and BJT single ended amplifiers, and introduces the design of advanced analogue building blocks, such as differential amplifier circuits, current mirrors, reference voltage circuits, regulators and operational amplifiers. Opamp design and its corresponding frequency response, as well as ways to improve arising stability issues (e.g. using … For more content click the Read More button below.The unit consolidates MOS and BJT single ended amplifiers, and introduces the design of advanced analogue building blocks, such as differential amplifier circuits, current mirrors, reference voltage circuits, regulators and operational amplifiers. Opamp design and its corresponding frequency response, as well as ways to improve arising stability issues (e.g. using pole compensation) are discussed.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ECE2131",
                        "ECE2031"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ECE3062"
                    ]
                },
                "rules": "E6011 Master of Professional Engineering - You are exempt from the prerequisite rule if you are enrolled in this course. "
            }
        },
        {
            "code": "TRC3200",
            "state": 1,
            "sem": 1,
            "credit points": "6",
            "name": "Dynamical systems",
            "unit_details": {
                "overview": "Overview Instruction on the basics of dynamics of mechatronic systems, incorporating electromagnetics into advanced dynamics analysis via d'Alembert's Principle and the virtual power method, Hamilton's and Lagrange's equations, and bond graphs. Focus on applications of dynamics in mechatronics, with kinematics and dynamics of robotic structures, magneto-electro-mechanical transducers, motors and electrical circuits. … For more content click the Read More button below.Instruction on the basics of dynamics of mechatronic systems, incorporating electromagnetics into advanced dynamics analysis via d'Alembert's Principle and the virtual power method, Hamilton's and Lagrange's equations, and bond graphs. Focus on applications of dynamics in mechatronics, with kinematics and dynamics of robotic structures, magneto-electro-mechanical transducers, motors and electrical circuits. Reinforcement of concepts using computer analysis on simple mechatronic systems.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "TRC2201",
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "MEC3453"
                    ]
                },
                "rules": null
            }
        },
        {
            "code": "TRC3500",
            "state": 1,
            "sem": 1,
            "credit points": "6",
            "name": "Sensors and artificial perception",
            "unit_details": {
                "overview": "Overview The unit provides an introduction to transducer principles and the background to classify them in terms of performance and characteristics. A range of commonly available sensors are considered. Electronic components and data acquisition/digital signal processing software used in sensor systems are examined. Advanced sensory systems and associated programming techniques are … For more content click the Read More button below.The unit provides an introduction to transducer principles and the background to classify them in terms of performance and characteristics. A range of commonly available sensors are considered. Electronic components and data acquisition/digital signal processing software used in sensor systems are examined. Advanced sensory systems and associated programming techniques are introduced using robotic systems as an example domain.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisites: (ECE2031 or ECE2131 or ECE2061) and (ECE2071 or FIT1008 or (FIT1029 and FIT1040)) "
            }
        },
        
        {
            "code": " ",
            "state": 2
        },
        {
            "code": "TRC3600",
            "state": 1,
            "sem": 2,
            "credit points": "6",
            "name": "Modelling and control",
            "unit_details": {
                "overview": "Overview This unit commences with the modeling of various dynamic engineering systems, followed by the analysis of their transient and steady-state responses. More sophisticated analytical methods such as root locus and frequency response will be explored and will build the foundation for controller design in the future. Modeling via state-space methods … For more content click the Read More button below.This unit commences with the modeling of various dynamic engineering systems, followed by the analysis of their transient and steady-state responses. More sophisticated analytical methods such as root locus and frequency response will be explored and will build the foundation for controller design in the future. Modeling via state-space methods will also be briefly covered.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [
                        "MAE3408",
                        "MEC3457"
                    ],
                    "AND": []
                },
                "rules": null
            }
        },
        
        {
            "code": "ECE4078",
            "state": 1,
            "sem": 2,
            "credit points": "6",
            "name": "Intelligent robotics",
            "unit_details": {
                "overview": "Overview Intelligent robotics concerns the melding of artificial perception, strategic reasoning and robotic action in potentially unstructured and time-varying environments to fulfil useful physical tasks, whether in industry or for security, healthcare, search and rescue or civil defence etc. This unit covers topics underpinning the above requirements, including sensors, sensor fusion, … For more content click the Read More button below.Intelligent robotics concerns the melding of artificial perception, strategic reasoning and robotic action in potentially unstructured and time-varying environments to fulfil useful physical tasks, whether in industry or for security, healthcare, search and rescue or civil defence etc. This unit covers topics underpinning the above requirements, including sensors, sensor fusion, machine perception, environmental mapping/monitoring, path planning, localisation, mechanisms, artificial intelligence methodologies and application domains.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ECE2071"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ECE5178"
                    ]
                },
                "rules": "PREREQUISITES: Or FIT1002 or TRC2400 or (FIT1029 and FIT1040)\nIf you are currently enrolled in E6013 Master of Applied Engineering, you are exempt from the prerequisite requirement. "
            }
        },
        {
            "code": "ECE4179",
            "state": 1,
            "sem": 2,
            "credit points": "6",
            "name": "Neural networks and deep learning",
            "unit_details": {
                "overview": "Overview This unit introduces fundamentals of deep learning and how it can solve problems in many areas, such as image classification, filter design and natural language processing. Neural networks are first described and how training can be achieved with backpropagation. Various forms of deep neural networks are developed, such as multilayer … For more content click the Read More button below.This unit introduces fundamentals of deep learning and how it can solve problems in many areas, such as image classification, filter design and natural language processing. Neural networks are first described and how training can be achieved with backpropagation. Various forms of deep neural networks are developed, such as multilayer perceptrons, convolution neural networks and recurrent neural networks. The mathematics of stochastic optimisation is used to interpret and understand the behaviour and training of these networks. Programming approaches are discussed for training and deploying neural networks. Deep learning technologies and design examples are discussed in areas such as driverless cars, personal cognitive assistants and mastering of games such as GO.Read More about Overview",
                "offerings": {
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005",
                        "ECE2071"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisites: Or ENG2092 in place of ENG2005 "
            }
        },
        
        {
            "code": " ",
            "state": 2
        },
        {
            "code": "ENG4701",
            "state": 1,
            "sem": 0,
            "credit points": "6",
            "name": "Final year project A",
            "unit_details": {
                "overview": "Overview The aim of this capstone unit is to provide an opportunity for you to undertake a substantial individual or small group project. Projects undertaken will integrate and build on content from earlier stages of the course. This unit is the first part of a two-unit project.The aim of this capstone unit is to provide an opportunity for you to undertake a substantial individual or small group project. Projects undertaken will integrate and build on content from earlier stages of the course. This unit is the first part of a two-unit project.",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITE: 18 credit points at level three in engineering or FIT-coded study\nCOREQUISITE: ENG0001 (Clayton-based students) "
            }
        },

        {
            "code": "TRC4800",
            "state": 1,
            "sem": 1,
            "credit points": "6",
            "name": "Robotics",
            "unit_details": {
                "overview": "Overview The unit will cover the fundamentals of robotics and robotic automation. The contents include spatial descriptions and transformations, manipulator forward and inverse kinematics, differential relationships and the Jacobian. Manipulator dynamics. Problem specification and solution preparation. Manipulator and end-effector configuration and design. Manipulator position control, involving sensing and actuation. Robotics in … For more content click the Read More button below.The unit will cover the fundamentals of robotics and robotic automation. The contents include spatial descriptions and transformations, manipulator forward and inverse kinematics, differential relationships and the Jacobian. Manipulator dynamics. Problem specification and solution preparation. Manipulator and end-effector configuration and design. Manipulator position control, involving sensing and actuation. Robotics in manufacturing and automation. Task Planning and techniques for modelling, simulation and programming of robotic tasks. Computational geometry for design and manufacture. Introduction to autonomous systems.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "TRC3600",
                        "MEC3457"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "MEC4456"
                    ]
                },
                "rules": null
            }
        },
        {
            "code": "ECE4076",
            "state": 1,
            "sem": 1,
            "credit points": "6",
            "name": "Computer vision",
            "unit_details": {
                "overview": "Overview This unit aims to develop an understanding of methods for extracting useful information (eg 3-D structure; object size, motion, shape, location and identity, etc) from images. It will allow you to understand how to construct computer vision systems for robotics, surveillance, medical imaging, and related application areas.This unit aims to develop an understanding of methods for extracting useful information (eg 3-D structure; object size, motion, shape, location and identity, etc) from images. It will allow you to understand how to construct computer vision systems for robotics, surveillance, medical imaging, and related application areas.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ECE2071"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": " ",
            "state": 2
        },
        {
            "code": "ENG4702",
            "state": 1,
            "sem": 0,
            "credit points": "6",
            "name": "Final year project B",
            "unit_details": {
                "overview": "Overview This unit is a continuation of ENG4701 Final year project A. The aim of this capstone unit is to provide an opportunity for you to undertake a substantial individual or small group project. Projects undertaken will integrate and build on content from earlier stages of the course.This unit is a continuation of ENG4701 Final year project A. The aim of this capstone unit is to provide an opportunity for you to undertake a substantial individual or small group project. Projects undertaken will integrate and build on content from earlier stages of the course.",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG4701"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "TRC4002",
            "state": 1,
            "sem": 2,
            "credit points": "6",
            "name": "Professional practice",
            "unit_details": {
                "overview": "Overview This unit provides an introduction to aspects of management relevant to the needs of the professional mechatronics engineer. You will be introduced to a range of topics including the role of a manager, organizations, financial management, marketing and planning, legal issues and professional ethics.This unit provides an introduction to aspects of management relevant to the needs of the professional mechatronics engineer. You will be introduced to a range of topics including the role of a manager, organizations, financial management, marketing and planning, legal issues and professional ethics.",
                "offerings": {
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ECE4099"
                    ]
                },
                "rules": "PREREQUISITE: Completion of 96 credit points in engineering study. "
            }
        },
        {
            "code": "ECE4191",
            "state": 1,
            "sem": 2,
            "credit points": "6",
            "name": "Engineering integrated design",
            "unit_details": {
                "overview": "This unit extends the level of complexity of electronic design by integrating and applying core knowledge in electrical and computer systems engineering. You will use linear and non-linear electronics, computer engineering and communications engineering to tackle a group project, apply project management skills and extend your experience of working in groups. The project will extend the design processes introduced in the earlier units to a larger, more complex and less constrained problem that integrates multiple sub-disciplines of your course. The project will be complemented by lectures in project management, including working with teams, project management tools and techniques, and written and verbal communication. Frameworks for analysing the life cycles of systems are introduced. Tools and techniques to aid decision-making are provided.",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": ["ECE3073","ECE3141","TRC3500"],
                    "AND": ["ECE2072","ECE3161"]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": ""
            }
        },


        {
            "code": " ",
            "state": 2
        },


        {
            "code": "ECE2111",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Signals and systems",
            "unit_details": {
                "overview": "Overview This unit provides foundations for the electrical engineering areas of control, signal processing and communications. The unit introduces concepts of continuous-time and discrete-time signals, their sampling and aliasing issues. Complex numbers, in particular, complex exponentials are introduced along with their representation as phasors, leading to periodic waveforms, Fourier series and … For more content click the Read More button below.This unit provides foundations for the electrical engineering areas of control, signal processing and communications. The unit introduces concepts of continuous-time and discrete-time signals, their sampling and aliasing issues. Complex numbers, in particular, complex exponentials are introduced along with their representation as phasors, leading to periodic waveforms, Fourier series and the signal frequency spectrum. Modification of spectra will be described using FIR filters, discrete-time systems, the unit-sample response, discrete convolution, linear time-invariant systems, convolution integrals, the continuous-time Fourier transform, windowing, DFT, FFT, time-frequency spectrum analysis, spectrogram, and Laplace Transform. Connecting frequency response and time response completes the unit.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1014",
                        "ENG1060"
                    ],
                    "AND": [
                        "ENG1005",
                        "ENG1005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ECE2011"
                    ]
                },
                "rules": "E6011 Master of Professional Engineering - You are exempt from the prerequisite rule if you are enrolled in this course. "
            }
        },
        {
            "code": "MAE2505",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Aerospace dynamics",
            "unit_details": {
                "overview": "Overview This unit develops your physical and analytical understanding of concepts of time, space, coordinate systems, particles, rigid bodies, forces, work, energy, mechanical vibration and Newton's Laws of Motion, translating into the ability to formulate and analyse the motion of spacecraft and aircraft under the influence of forces such as lift, … For more content click the Read More button below.This unit develops your physical and analytical understanding of concepts of time, space, coordinate systems, particles, rigid bodies, forces, work, energy, mechanical vibration and Newton's Laws of Motion, translating into the ability to formulate and analyse the motion of spacecraft and aircraft under the influence of forces such as lift, drag, thrust and gravity. You will be taught the fundamentals of kinematics and kinetics of rigid bodies and systems of particles and to carry out dynamic analysis of satellites and orbital spacecraft and aircraft. You will be introduced to properties of the Earth's atmosphere, the forces acting on aircraft and their impact on aircraft performance, resulting in the development of equations for steady level flight, steady climbing and descending flight. This unit is core to understanding the control and manoeuvring of spacecraft and aircraft.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1011",
                        "ENG1001"
                    ],
                    "AND": [
                        "ENG1005",
                        "ENG1005"
                    ]
                },
                "prohibition": {
                    "OR": [
                        "MEC2401",
                        "MAE2406"
                    ],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "ECE3051",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Electrical energy systems",
            "unit_details": {
                "overview": "Overview The unit begins by considering electrical machines, looking at DC machines, induction motors, synchronous motors and other types of motors under fixed and variable speed operation. Then thyristor rectifiers and switched power converters are presented, looking at their use for electrical energy conversion in general and variable speed motor control … For more content click the Read More button below.The unit begins by considering electrical machines, looking at DC machines, induction motors, synchronous motors and other types of motors under fixed and variable speed operation. Then thyristor rectifiers and switched power converters are presented, looking at their use for electrical energy conversion in general and variable speed motor control in particular. Finally, single and three phase AC networks, power factor correction, and electrical power generation, transmission and distribution networks are explored. Particular focus is given here to three phase transformers, transmission line modelling, quality of electrical supply, electrical protection systems, and power system control.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ECE2131"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "E6011 Master of Professional Engineering - You are exempt from the prerequisite rule if you are enrolled in this course. "
            }
        },
        {
            "code": "ECE3073",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Computer systems",
            "unit_details": {
                "overview": "Overview This unit provides an introduction to computer architecture using a modern microprocessor as an example. Practical considerations involved in interconnecting logic element are explored, along with software and hardware techniques for interfacing computers to peripheral devices. An introduction to communication protocols used to connect local peripheral devices to a microprocessor, … For more content click the Read More button below.This unit provides an introduction to computer architecture using a modern microprocessor as an example. Practical considerations involved in interconnecting logic element are explored, along with software and hardware techniques for interfacing computers to peripheral devices. An introduction to communication protocols used to connect local peripheral devices to a microprocessor, including RS232/RS422/RS485, CAN bus and i2C is provided. Real-time systems including concurrency, inter-process communications and scheduling are introduced.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisites: ECE2072 and one of: ECE2071, FIT1008, FIT1029 and FIT1040 Prohibitions: ECE3703, GSE2303, GSE3802, TEC3174, TRC3300 "
            }
        },
        {
            "code": "ECE3141",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Information and networks",
            "unit_details": {
                "overview": "Overview This unit provides an introduction to underlying technologies, major components and system-wide architectures of modern telecommunication systems. After introducing concepts of block and stream delivery, requirements of a telecommunications network and representation of analogue signals (e.g. voice and video) in digital form, the unit will cover all the major functions … For more content click the Read More button below.This unit provides an introduction to underlying technologies, major components and system-wide architectures of modern telecommunication systems. After introducing concepts of block and stream delivery, requirements of a telecommunications network and representation of analogue signals (e.g. voice and video) in digital form, the unit will cover all the major functions in layered architectures. Topics to be covered include multiplexing, basic line transmission and modulation, error protection and correction, packet switching, LAN protocols and the TCP/IP protocols on which the Internet is built. Particular emphasis is given to the major functions that combine to allow communication across key modern digital telecommunication systems such as the Internet, mobile telephony, digital TV and Digital Audio Broadcasting.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ECE2041"
                    ]
                },
                "rules": "Prerequisite: VCE specialist mathematics and physics or equivalent units "
            }
        },
        {
            "code": "MEC3010",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Micro and nanotechnologies: Fabrication and applications",
            "unit_details": {
                "overview": "Overview This unit aims to develop an understanding of micro and nanotechnology methods and techniques in a cleanroom environment, the design of process chains and the applications of devices that are currently being manufactured using them.\nMicro and nanofabrication form the basis of manufacturing any modern miniaturised system from computer chips … For more content click the Read More button below.\nThis unit studies the theoretical aspects of micro and nanotechnologies and how these techniques are employed to design manufacturing strategies of micro and nano-systems, considering real case studies of such devices.This unit aims to develop an understanding of micro and nanotechnology methods and techniques in a cleanroom environment, the design of process chains and the applications of devices that are currently being manufactured using them.\nMicro and nanofabrication form the basis of manufacturing any modern miniaturised system from computer chips to sensors and actuators in smartphones, tablets, cars and other vehicles, and diagnostic systems, biomedical devices and devices for environmental monitoring.\nThis unit studies the theoretical aspects of micro and nanotechnologies and how these techniques are employed to design manufacturing strategies of micro and nano-systems, considering real case studies of such devices.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITE: Completion of 18 credit points of level 2 engineering study "
            }
        },
        {
            "code": "MEC3416",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Machine design",
            "unit_details": {
                "overview": "Overview In this integrative level 3 unit, students of mechanical engineering programs are introduced to the design of machine elements covering bearings, shafts, welds, fasteners, gears etc. This leads to an examination of techniques for improving engineering designs based on economic and functional considerations. Geometric and economic tolerancing is further explored. … For more content click the Read More button below.In this integrative level 3 unit, students of mechanical engineering programs are introduced to the design of machine elements covering bearings, shafts, welds, fasteners, gears etc. This leads to an examination of techniques for improving engineering designs based on economic and functional considerations. Geometric and economic tolerancing is further explored. The use of solid modelling software to simulate the behaviour of mechanical devices and produce engineering drawings is introduced. The integration of design skills and related engineering studies is covered through a group exercise to design a mechanical device.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITE: Completion of 18 credit points of level 2 engineering study\nE6011 Master of Professional Engineering - You are exempt from the prerequisite rule if you are enrolled in this course. "
            }
        },
        {
            "code": "MEC3459",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Materials selection for engineering design",
            "unit_details": {
                "overview": "Overview This unit introduces you to materials available for the fabrication of engineering components and structures. You will be instructed on the fundamentals of the role of composition and structure of materials in their mechanical properties that are important for engineering design. You will also learn how the materials with undesirable … For more content click the Read More button below.This unit introduces you to materials available for the fabrication of engineering components and structures. You will be instructed on the fundamentals of the role of composition and structure of materials in their mechanical properties that are important for engineering design. You will also learn how the materials with undesirable microstructure can lead to premature failures, particularly as a result of their interaction with aggressive environment. The knowledge thus developed will provide a basis for advanced learning on a systematic approach to materials selection as well as the methods by which the materials with the desired mechanical properties can be processed. Case studies will be presented to highlight the importance of selecting appropriate materials for engineering design.Read More about Overview",
                "offerings": {
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "MAE2401",
                        "MEC2403",
                        "TRC2201"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [
                        "MAE3406",
                        "CHE2167"
                    ],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "MEC3602",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Biomedical microsystems",
            "unit_details": {
                "overview": "Overview This interdisciplinary unit will present the fundamental basis of biomedical microsystems for applications in small-scale engineering, biological sciences, and medicine. Selected topics include the fundamentals of miniaturization, microfabrication and material properties, microscopy methods, sensing and detection methods using microsystems, along with relevant applications and medical device regulations and standards. Biomedical … For more content click the Read More button below.This interdisciplinary unit will present the fundamental basis of biomedical microsystems for applications in small-scale engineering, biological sciences, and medicine. Selected topics include the fundamentals of miniaturization, microfabrication and material properties, microscopy methods, sensing and detection methods using microsystems, along with relevant applications and medical device regulations and standards. Biomedical microsystems are rapidly emerging as a dominant part of the biomedical industry, and these disciplines are central to biomedical engineering.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG1005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITES: Completion of 36 credit points in engineering study (including ENG1005) "
            }
        },
        {
            "code": "ECE4044",
            "state": 10,
            "sem": 0,
            "credit points": "6",
            "name": "Telecommunications protocols",
            "unit_details": {
                "overview": "Overview In this unit, you study the fundamentals of telecommunication network protocols by having the Internet's software architecture as its primary focus. Many protocols used in the application, transport, and network layers are examined and analysed. Client-server and peer-to-peer application architectures and their features are compared and contrasted. Reliable communication over … For more content click the Read More button below.In this unit, you study the fundamentals of telecommunication network protocols by having the Internet's software architecture as its primary focus. Many protocols used in the application, transport, and network layers are examined and analysed. Client-server and peer-to-peer application architectures and their features are compared and contrasted. Reliable communication over an unreliable network layer, connection establishment and teardown, and multiplexing issues are covered. Protocols for network security, techniques for providing confidentiality, authentication, non-repudiation and message integrity are also studied. Finally, protocols used for network management are analysed.Read More about Overview",
                "offerings": {},
                "prerequisite": {
                    "OR": [
                        "ECE3141",
                        "ECE2041"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "ECE4045",
            "state": 10,
            "sem": 0,
            "credit points": "6",
            "name": "Network performance",
            "unit_details": {
                "overview": "Overview This unit addresses the fundamental concepts and analytical tools for modelling, predicting and improving the performance of telecommunication networks. It also introduces simulation methods. First, performance modelling of a packet switch is covered. Then, a comparative analysis of routing algorithms is covered from a graph theory perspective. Third, methods to … For more content click the Read More button below.This unit addresses the fundamental concepts and analytical tools for modelling, predicting and improving the performance of telecommunication networks. It also introduces simulation methods. First, performance modelling of a packet switch is covered. Then, a comparative analysis of routing algorithms is covered from a graph theory perspective. Third, methods to provide an integrated service to a set of traffic demands with different qualities of service are studied. Then, congestion in telecommunication networks is covered, and effectiveness of various congestion and flow control algorithms and protocols are investigated. The focus then shifts to individual links and nodes, and queuing theory is introduced and its applications in networks are analysed. Then, recent advances are studied to show how the analytical and simulation knowledge learnt in this unit could be applied in real life.Read More about Overview",
                "offerings": {},
                "prerequisite": {
                    "OR": [
                        "ECE2041",
                        "ECE3141"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prohibition: ECE5045 "
            }
        },
        {
            "code": "ECE4053",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Power system analysis",
            "unit_details": {
                "overview": "Overview This unit aims to develop the foundation for exploring tools and methods to analyse electric power systems. It provides an introduction to main elements such as generators, transformers, transmission lines, and loads and their mathematical models. Then using these models, the unit presents analytical tools to analyse the power system … For more content click the Read More button below.This unit aims to develop the foundation for exploring tools and methods to analyse electric power systems. It provides an introduction to main elements such as generators, transformers, transmission lines, and loads and their mathematical models. Then using these models, the unit presents analytical tools to analyse the power system in steady state and under fault conditions. In particular, tools and techniques for power flow, symmetrical and unsymmetrical faults, voltage control, frequency control, and system stability will be studied in detail. Finally, electromagnetic transients in power systems will be introduced.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisites\nECE2131 and ECE3051\nProhibitions\nECE5507, ECE5053, ECE5503 "
            }
        },
        {
            "code": "ECE4055",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Power electronic converters",
            "unit_details": {
                "overview": "Overview The unit presents a structured treatment of the design of switched-mode power electronic converters. The unit starts with passive diode rectifiers followed by thyristor rectifiers. Introducing various semi-conductor active switches, commutation cells and pulse width modulation techniques, various active power electronics converters including DC/DC buck and boost converters, flyback converters, … For more content click the Read More button below.The unit presents a structured treatment of the design of switched-mode power electronic converters. The unit starts with passive diode rectifiers followed by thyristor rectifiers. Introducing various semi-conductor active switches, commutation cells and pulse width modulation techniques, various active power electronics converters including DC/DC buck and boost converters, flyback converters, resonant converters, two-level DC/AC converters, and three-level DC/AC converters will be studied in detail. Finally, a few real-world applications such as variable speed drives and power filters are presented as examples.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ECE2131"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ECE5155"
                    ]
                },
                "rules": null
            }
        },
        {
            "code": "ECE4063",
            "state": 10,
            "sem": 0,
            "credit points": "6",
            "name": "Large scale digital design",
            "unit_details": {
                "overview": "Overview The unit aims to develop a fundamental understanding of the performance, specification and fabrication of large scale digital circuits. You will become experienced at the design, simulation, verification and debugging of complex large scale digital circuits using a Hardware Description Language (HDL) and current CAD tools with FPGA development boards. … For more content click the Read More button below.The unit aims to develop a fundamental understanding of the performance, specification and fabrication of large scale digital circuits. You will become experienced at the design, simulation, verification and debugging of complex large scale digital circuits using a Hardware Description Language (HDL) and current CAD tools with FPGA development boards. Two group design projects will be undertaken: one involving an HDL using FPGA devices and another involving custom VLSI CMOS design and simulationRead More about Overview",
                "offerings": {},
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ECE2131",
                        "ECE2072"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisites: Or (ECE2061 or TRC2500) and ECE2072 Prohibitions: ECE4604. ECE5063, ECE5604 "
            }
        },
        {
            "code": "ECE4081",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Medical instrumentation",
            "unit_details": {
                "overview": "Overview This unit shows how engineering principles are used in the design and construction of biomedical instrumentation. This includes the application of electrochemistry to biological membranes, application of cable theory to nerve axons, application of electronic design principles to the recording of biological electrical signals, application of quantitative optics to spectrometry. … For more content click the Read More button below.This unit shows how engineering principles are used in the design and construction of biomedical instrumentation. This includes the application of electrochemistry to biological membranes, application of cable theory to nerve axons, application of electronic design principles to the recording of biological electrical signals, application of quantitative optics to spectrometry. In addition, the operating principles of a wide range of medical and laboratory instruments will be explored, ranging from ECG machines, pressure transducers to cochlear and vision implants.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ECE2131"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "ECE4146",
            "state": 10,
            "sem": 0,
            "credit points": "6",
            "name": "Multimedia technologies",
            "unit_details": {
                "overview": "Overview This unit provides an understanding of the nature and limits of processing of media (image, video, audio) for telecommunications, storage, interpretation and analysis. It includes compression of multimedia from basic information theoretic concepts through to advanced video (e.g. MPEG), image (JPEG, JPEG2000) and audio (CELP, MP3, AAC, Dolby Digital) coding. … For more content click the Read More button below.This unit provides an understanding of the nature and limits of processing of media (image, video, audio) for telecommunications, storage, interpretation and analysis. It includes compression of multimedia from basic information theoretic concepts through to advanced video (e.g. MPEG), image (JPEG, JPEG2000) and audio (CELP, MP3, AAC, Dolby Digital) coding. XML-based metadata systems are used to illustrate concepts of content characterisation and discovery. The ability of modern network protocols to support media streaming is related directly to service requirements such as error and delay tolerance. Where media is intended for human consumption, the characteristics of human perception of image and sound determine minimum quality requirements, but also reveal limitations that can be exploited when compressing media data. Machine interpretation and analysis of multimedia is also investigated. Case studies in media analysis (e.g. Shazam), delivery (video on demand) and consumption (digital cinema) are used to illustrate the technologies investigated.Read More about Overview",
                "offerings": {},
                "prerequisite": {
                    "OR": [
                        "ECE3141",
                        "ECE2041"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "ENG4700",
            "state": 10,
            "sem": 0,
            "credit points": "6",
            "name": "Engineering technology for biomedical imaging and sensing",
            "unit_details": {
                "overview": "Overview Introduction to biomedical engineering from the perspective of engineering-based technologies of sensing and imaging. Topics include: basis of light and radiation, principles of synchrotron operation, practical study at the Australian synchrotron, human physiology for engineers, principles of detection and sensing of signals, biomedically relevant properties and phenomena. During this time … For more content click the Read More button below.Introduction to biomedical engineering from the perspective of engineering-based technologies of sensing and imaging. Topics include: basis of light and radiation, principles of synchrotron operation, practical study at the Australian synchrotron, human physiology for engineers, principles of detection and sensing of signals, biomedically relevant properties and phenomena. During this time project teams are formed and project proposals are developed. Project work continues with groups and individuals combining projects, allocated resources, knowledge and skills to develop a biomedical sensing device.Read More about Overview",
                "offerings": {},
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite: Completion of 90 credit points "
            }
        },
        {
            "code": "MEC4416",
            "state": 10,
            "sem": 0,
            "credit points": "6",
            "name": "Momentum, energy & mass transport in engineering systems",
            "unit_details": {
                "overview": "Overview Unsteady heat conduction, numerical solutions to multi-dimensional conduction problems. Derivation of general governing equations for fluid flow, heat transfer and mass transfer. Free and forced convection heat transfer in laminar and turbulent flow regimes. Fundamentals of mass transfer. Introduction to two-phase heat transfer. Applications to mechanical engineering systems: fuel cells … For more content click the Read More button below.Unsteady heat conduction, numerical solutions to multi-dimensional conduction problems. Derivation of general governing equations for fluid flow, heat transfer and mass transfer. Free and forced convection heat transfer in laminar and turbulent flow regimes. Fundamentals of mass transfer. Introduction to two-phase heat transfer. Applications to mechanical engineering systems: fuel cells and alternative energy devices, heat pipes in electronics cooling, micro-scale heat transfer and bioheat transfer.Read More about Overview",
                "offerings": {},
                "prerequisite": {
                    "OR": [
                        "MEC4408",
                        "CHE2163",
                        "MEC3454",
                        "CHE2161"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "MEC4425",
            "state": 10,
            "sem": 0,
            "credit points": "6",
            "name": "Micro/nano solid and fluid mechanics",
            "unit_details": {
                "overview": "Overview Introducing micro and nano-technology in the design of next-generation microelectromechanical systems, microfluidic devices and biomedical applications. Basic concepts and physics of small-scale systems are covered. Topics include: scaling effects, nanofabrication techniques, continuum mechanical theories, low Reynolds number flows, capillary effects and interfacial flows, flows in channels of arbitrary dimensions, convective-diffusive … For more content click the Read More button below.Introducing micro and nano-technology in the design of next-generation microelectromechanical systems, microfluidic devices and biomedical applications. Basic concepts and physics of small-scale systems are covered. Topics include: scaling effects, nanofabrication techniques, continuum mechanical theories, low Reynolds number flows, capillary effects and interfacial flows, flows in channels of arbitrary dimensions, convective-diffusive mass transport, electro hydrodynamics including classical double layer theory, electrophoresis, electro-osmosis, dielectric polarisation and dielectrophoresis. The course also focuses on device applications, specifically MEMS sensors and actuators and lab-on-chip devices, through hands-on laboratory sessions (held at Melbourne Centre for Nanofabrication).Read More about Overview",
                "offerings": {},
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite: Or 120 points of engineering study and TRC2200, TRC3200 "
            }
        },
        {
            "code": "MEC4426",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Computer-aided design",
            "unit_details": {
                "overview": "Overview Finite element analysis (FEA) in computer-aided design; finite element formulation; first-order and second-order elements; stiffness matrix; integration points and stress recovery; convergence and mesh refinement; FEA of plane stress and plane strain problems; FEA of axisymmetric problems; FEA of nonlinear materials; FEA of contact problems; FEA of large deformation problems; … For more content click the Read More button below.Finite element analysis (FEA) in computer-aided design; finite element formulation; first-order and second-order elements; stiffness matrix; integration points and stress recovery; convergence and mesh refinement; FEA of plane stress and plane strain problems; FEA of axisymmetric problems; FEA of nonlinear materials; FEA of contact problems; FEA of large deformation problems; FEA of dynamic problems; FEA of fracture mechanics.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "MEC3455",
                        "MAE2401",
                        "TRC2201"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "MAE3426"
                    ]
                },
                "rules": "Prerequisite:And 96 credit points of engineering study. "
            }
        },
        {
            "code": "MEC4428",
            "state": 10,
            "sem": 0,
            "credit points": "6",
            "name": "Advanced dynamics",
            "unit_details": {
                "overview": "Overview Focus on advanced kinematics and dynamics with a variety of applications in fluid and solid mechanics, robotics and electromechanical systems. Study of how kinematic constraints are incorporated into forming the governing equations and their relationship with constraint forces. Dynamics incorporating collisions. Using rotating coordinate systems to solve dynamics problems. Two- … For more content click the Read More button below.Focus on advanced kinematics and dynamics with a variety of applications in fluid and solid mechanics, robotics and electromechanical systems. Study of how kinematic constraints are incorporated into forming the governing equations and their relationship with constraint forces. Dynamics incorporating collisions. Using rotating coordinate systems to solve dynamics problems. Two- and three-dimensional rigid body dynamics. Consideration of nonlinearities in the dynamic response of everyday structures. Instruction on advanced topics in analytical dynamics, incorporating D'Alembert's principle, Hamilton's principle and the general Lagrange equations. Reinforcement of concepts through computer analysis using Matlab or Mathematica.Read More about Overview",
                "offerings": {},
                "prerequisite": {
                    "OR": [
                        "MEC3453",
                        "MAE3404",
                        "TRC3200"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "MEC4446",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Composite structures",
            "unit_details": {
                "overview": "Overview Specific modulus and specific strength; 3D stress and 3D strain tensors; anisotropic elasticity; composite lamina and composite laminate; hygrothermal strain and hygrothermal stress analysis of composite structures; failure theories for a composite lamina; micromechanical analysis of a composite lamina; classical lamination theory for composite laminate, failure analysis of composite laminates, … For more content click the Read More button below.Specific modulus and specific strength; 3D stress and 3D strain tensors; anisotropic elasticity; composite lamina and composite laminate; hygrothermal strain and hygrothermal stress analysis of composite structures; failure theories for a composite lamina; micromechanical analysis of a composite lamina; classical lamination theory for composite laminate, failure analysis of composite laminates, design of composite laminates, finite element analysis of composite materials and structures.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "MAE4426"
                    ]
                },
                "rules": "Prerequisite: 120 credit points of engineering study "
            }
        },
        {
            "code": "MEC4802",
            "state": 10,
            "sem": 0,
            "credit points": "6",
            "name": "Sustainable engineering and design with nanomaterials",
            "unit_details": {
                "overview": "Overview Sustainable engineering and design with nanomaterials explores the selection, design and characterising of nanomaterials in developing sustainable engineering solutions that are verified using the life cycle assessment tool to enable you to design nanomaterials which are beneficial to the social and economic advancement. Examples include mineral nanotubes, titanium dioxide nanoparticles, … For more content click the Read More button below.Sustainable engineering and design with nanomaterials explores the selection, design and characterising of nanomaterials in developing sustainable engineering solutions that are verified using the life cycle assessment tool to enable you to design nanomaterials which are beneficial to the social and economic advancement. Examples include mineral nanotubes, titanium dioxide nanoparticles, carbon nanotubes, polymer nanocomposites, and bionanocomposites. The ability to design nanomaterials are developed through an appreciation of the theory and working principles of various preparation methods and characterisation techniques.Read More about Overview",
                "offerings": {},
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "MEC3459"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "TRC4200",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Engineering cyber-physical systems",
            "unit_details": {
                "overview": "Overview The unit aims to impart knowledge, skills, and experience required to prepare graduates for the impending digital transformation driving the convergence of technologies that result in Cyber-Physical Systems (CPS). An introduction will be given to Cyber-Physical Systems (CPS). The evolution of key technologies, transformation to digital chains and the need … For more content click the Read More button below.The unit aims to impart knowledge, skills, and experience required to prepare graduates for the impending digital transformation driving the convergence of technologies that result in Cyber-Physical Systems (CPS). An introduction will be given to Cyber-Physical Systems (CPS). The evolution of key technologies, transformation to digital chains and the need to seamlessly combine organisational and technological issues into a single framework will be discussed. A real-life scenario will be used to motivate you to apply CPS technologies to design and develop Smart Systems in any domain of their specialisation and interest. Using the concept of Learning Factories (LF) - a platform to impart experience-based knowledge - the developed solution will be built and tested as a group project.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "MEC3457",
                        "MAE3408",
                        "MEC2402",
                        "ECE3091"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Additional prerequisite:\nCompletion of 96 credit points of engineering study which includes the prerequisite units mentioned. "
            }
        },
        {
            "code": "TRC4802",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Thermo-fluids and power systems",
            "unit_details": {
                "overview": "Overview This unit provides the discipline basis for applications in energy, power and motive force where fluids are involved. It also provides a basic level of knowledge and problem-solving capability in heat transfer. These disciplines are central to mechanical engineering and, as a consequence, are essential knowledge for mechatronic engineers whose … For more content click the Read More button below.This unit provides the discipline basis for applications in energy, power and motive force where fluids are involved. It also provides a basic level of knowledge and problem-solving capability in heat transfer. These disciplines are central to mechanical engineering and, as a consequence, are essential knowledge for mechatronic engineers whose designs usually have mechanical elements.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [
                        "MEC2404",
                        "MEC2405",
                        "TRC2200"
                    ],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "TRC4902",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Mechatronics and manufacturing",
            "unit_details": {
                "overview": "Overview This unit aims to develop an understanding of the mechatronic engineer's role in the manufacturing industry, manufacturing processes including 3D printing, fundamentals and automation using a CNC controller. Different manufacturing systems: cellular and flexible manufacturing systems will be analysed. Recent advancement in the industry: Industry 4.0 and digital twins will … For more content click the Read More button below.This unit aims to develop an understanding of the mechatronic engineer's role in the manufacturing industry, manufacturing processes including 3D printing, fundamentals and automation using a CNC controller. Different manufacturing systems: cellular and flexible manufacturing systems will be analysed. Recent advancement in the industry: Industry 4.0 and digital twins will be introduced. Modern manufacturing management will be presented and discussed to improve quality and productivity by removing non-value added processes to reduce the production cycle and increase the product life-cycle. This will include lean manufacturing, agile manufacturing and virtual manufacturing. This unit also includes the design of flexible manufacturing systems which is capable of producing a variety of products. The manufacturing support systems such as process planning and control and computer-aided process planning using a variant technique and a generative process planning technique with Artificial Intelligence (AI) will be covered in this unit. Finally, the design of flexible manufacturing systems for a variety of products will be studied to reduce production lot size and the design of assembly manufacturing lines will be optimised.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "MEC2402",
                        "TRC3000"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "If you are currently enrolled in E6013 Master of Applied Engineering, you are exempt from the prerequisites requirement. "
            }
        },
        {
            "code": "ECE5881",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Real-time system design",
            "unit_details": {
                "overview": "Overview The unit aims to enable you to understand, analyse, specify, design and test real-time systems using both hardware and software development. Migration between software and hardware will be considered as an approach to meet design criterion such as speed, throughput, energy usage and cost.\nThe design, analysis and implementation of … For more content click the Read More button below.\nYou will complete a major team design project that includes hardware and software design of a real-time system.The unit aims to enable you to understand, analyse, specify, design and test real-time systems using both hardware and software development. Migration between software and hardware will be considered as an approach to meet design criterion such as speed, throughput, energy usage and cost.\nThe design, analysis and implementation of real-time operating systems will be studied and will include scheduling policies, process creation and management, inter-process communication and synchronisation, efficient handling of I/O and communication.\nYou will complete a major team design project that includes hardware and software design of a real-time system.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ECE4075"
                    ]
                },
                "rules": "You must be currently enrolled in a master’s course in engineering or related STEM and in a related discipline. The unit assumes you have the necessary foundational knowledge equivalent to ECE2071 and ECE2072. "
            }
        },
        {
            "code": "ECE5882",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Advanced electronics design",
            "unit_details": {
                "overview": "Overview This is an advanced unit in electronics design. You will be provided with an in-depth knowledge of radio frequency (RF) and microwave circuits and systems. The unit builds on your' basic electronic knowledge obtained from your undergraduate engineering degree to a more advanced analog and RF electronics, with more theory … For more content click the Read More button below.\nThe unit will teach you the detailed design principles of passive and active electronic devices at radio frequencies. You will learn to use CAD design software packages for assignments and projects. Important analogue and RF building components such as amplifiers, filters, oscillators, modulators, mixers and phase-locked loops will be taught. Topics such as noise and interference in electronic circuits will also be covered.\nYou will undertake a group project where RF/mixed-signal circuits will be designed, built and tested in the laboratory.This is an advanced unit in electronics design. You will be provided with an in-depth knowledge of radio frequency (RF) and microwave circuits and systems. The unit builds on your' basic electronic knowledge obtained from your undergraduate engineering degree to a more advanced analog and RF electronics, with more theory and applications of electronics.\nThe unit will teach you the detailed design principles of passive and active electronic devices at radio frequencies. You will learn to use CAD design software packages for assignments and projects. Important analogue and RF building components such as amplifiers, filters, oscillators, modulators, mixers and phase-locked loops will be taught. Topics such as noise and interference in electronic circuits will also be covered.\nYou will undertake a group project where RF/mixed-signal circuits will be designed, built and tested in the laboratory.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "You must be currently enrolled in a master’s course in engineering or related STEM and in a related discipline. The unit assumes you have the necessary foundational knowledge equivalent to ECE3161. "
            }
        },
        {
            "code": "ECE5883",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Advanced signal processing",
            "unit_details": {
                "overview": "Overview The unit introduces the fundamentals of statistical signal processing with emphasis on stochastic models, estimation theory, parametric and non-parametric modelling and least squares methods.\nAfter a review of basic probability and random processes, the use of stochastic models for real world signals is illustrated. A family of algorithms for the … For more content click the Read More button below.\nSpecifically, linear stochastic models are presented and the importance of correlation structure in deriving the parameters of such models is illustrated.\nThe unit also covers how parametric and non-parametric models as well as statistical techniques are used to extract information from data signals corrupted by noise. The concept of estimation from real world data is presented, as opposed to the basic analysis of signals, transfer functions and power spectra. In particular, the fundamentals of linear estimation theory and optimal filtering to design advanced signal processing algorithms are presented.The unit introduces the fundamentals of statistical signal processing with emphasis on stochastic models, estimation theory, parametric and non-parametric modelling and least squares methods.\nAfter a review of basic probability and random processes, the use of stochastic models for real world signals is illustrated. A family of algorithms for the creation, efficient representation and effective modelling is presented.\nSpecifically, linear stochastic models are presented and the importance of correlation structure in deriving the parameters of such models is illustrated.\nThe unit also covers how parametric and non-parametric models as well as statistical techniques are used to extract information from data signals corrupted by noise. The concept of estimation from real world data is presented, as opposed to the basic analysis of signals, transfer functions and power spectra. In particular, the fundamentals of linear estimation theory and optimal filtering to design advanced signal processing algorithms are presented.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "You must be currently enrolled in a master’s course in engineering or related STEM and in a related discipline. The unit assumes you have the necessary foundational knowledge equivalent to ECE2111 and ECE2191\n  "
            }
        },
        {
            "code": "ECE5884",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Wireless communications",
            "unit_details": {
                "overview": "Overview This unit introduces the fundamentals of wireless communications and networking. You will learn about the characteristics of wireless channels, coding, modulation techniques, methods of combating fading including space, time and frequency diversity, multiple access techniques and cellular networks.\nA selection of more advanced topics will also be covered including MIMO … For more content click the Read More button below.This unit introduces the fundamentals of wireless communications and networking. You will learn about the characteristics of wireless channels, coding, modulation techniques, methods of combating fading including space, time and frequency diversity, multiple access techniques and cellular networks.\nA selection of more advanced topics will also be covered including MIMO systems, heterogeneous networks, cognitive and cooperative communications.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "You must be currently enrolled in a master’s course in engineering or related STEM and in a related discipline. The unit assumes you have the necessary foundational knowledge equivalent to ECE3141 "
            }
        },
        {
            "code": "ECE5886",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Smart grids",
            "unit_details": {
                "overview": "Overview The Smart Grid unit provides a comprehensive knowledge about the Smart Grid and how it is to be operated and protected for improving sustainability and energy savings. The core of the unit is intelligent infrastructure for Smart Grid and its heightening vulnerability, and how to protect it effectively.\nThe basic … For more content click the Read More button below.\nThe unit will conclude with defining concept, design and purpose of the Smart Grid, reviewing current and relevant technologies developed, assessing its vulnerabilities to a cyber-attack, and finding effective protective mechanisms for the grid.The Smart Grid unit provides a comprehensive knowledge about the Smart Grid and how it is to be operated and protected for improving sustainability and energy savings. The core of the unit is intelligent infrastructure for Smart Grid and its heightening vulnerability, and how to protect it effectively.\nThe basic economic fundamentals of power systems and conventional and renewable power generation in regulated and deregulated environment are introduced first. The basic concepts of intelligent control, application of intelligent agents in grid technology, and intelligent components commonly used in Smart Grids are extensively discussed afterward. Also included is how distribution networks adapt to intermittent energy sources (e.g. solar and wind) through the use of smart grids, emerging technologies and energy storage systems.\nThe unit will conclude with defining concept, design and purpose of the Smart Grid, reviewing current and relevant technologies developed, assessing its vulnerabilities to a cyber-attack, and finding effective protective mechanisms for the grid.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "You must be currently enrolled in a master’s course in engineering or related STEM and in a related discipline. The unit assumes that you have the necessary foundational knowledge. "
            }
        },
        {
            "code": "MEC5881",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Engineering systems performance analysis",
            "unit_details": {
                "overview": "Overview This unit complements systems design. The unit will integrate fundamental concepts in solid and fluid mechanics and dynamics and, in so doing, will highlight the roles they play in determining the performance of an engineering system.\nYou will use advanced computational tools to study how these concepts are crucial to … For more content click the Read More button below.This unit complements systems design. The unit will integrate fundamental concepts in solid and fluid mechanics and dynamics and, in so doing, will highlight the roles they play in determining the performance of an engineering system.\nYou will use advanced computational tools to study how these concepts are crucial to competitive economic performance and to the long-term sustainability of an engineered system.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "T3-57-OS-CHI-SEU-ON-CAMPUS": {
                        "location": [
                            "Suzhou"
                        ],
                        "teaching_period": "Term 3",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "You must be currently enrolled in a master’s course in engineering or related STEM and in a related discipline. The unit assumes that you have the necessary foundational knowledge. "
            }
        },
        {
            "code": "MEC5882",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Instrumentation, sensing and monitoring",
            "unit_details": {
                "overview": "Overview Advanced instrumentation and sensing necessitate a multi-disciplinary approach in order to monitor engineering systems as diverse as renewable energy, aerospace, buildings, transportation, telecommunications and biomedical devices.\nThe monitoring and assessment techniques are founded on the fundamentals of mechanical engineering, electrical and electronic engineering and information technology.\nThe unit covers the … For more content click the Read More button below.\nData visualisation will also be discussed. The unit will explore frequency of monitoring in relation to the volume of data collected and strategies for data reduction.Advanced instrumentation and sensing necessitate a multi-disciplinary approach in order to monitor engineering systems as diverse as renewable energy, aerospace, buildings, transportation, telecommunications and biomedical devices.\nThe monitoring and assessment techniques are founded on the fundamentals of mechanical engineering, electrical and electronic engineering and information technology.\nThe unit covers the exploration of strategies for efficient instrumentation of engineering assets. You will use a range of sensing technologies to gather real-time information and use industry-standard approaches to data analyses, characterisation, fault assessment and reporting methodologies at various stages of product design and product development.\nData visualisation will also be discussed. The unit will explore frequency of monitoring in relation to the volume of data collected and strategies for data reduction.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "You must be currently enrolled in a master’s course in engineering or related STEM and in a related discipline. The unit assumes that you have the necessary foundational knowledge. "
            }
        },
        {
            "code": "MEC5883",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Mechanical systems design",
            "unit_details": {
                "overview": "Overview This unit will emphasise engineering design with a focus on designing a system rather than the individual components of a system. In this way, the unit will integrate mechanical design with material selection, manufacture, and control systems, and the needs of in-service monitoring to optimise system performance. Quality management systems, … For more content click the Read More button below.\nThis unit uses case studies, group work and design projects as key learning methodologies to integrate theoretical knowledge with practical outcomes. You can expect a strong practical focus with extensive use of computer-aided design and analysis software.This unit will emphasise engineering design with a focus on designing a system rather than the individual components of a system. In this way, the unit will integrate mechanical design with material selection, manufacture, and control systems, and the needs of in-service monitoring to optimise system performance. Quality management systems, lean techniques and lifecycle assessment will be applied to the proposed product or service to understand system variability, maximise and maintain value-creation and assess environmental impacts.\nThis unit uses case studies, group work and design projects as key learning methodologies to integrate theoretical knowledge with practical outcomes. You can expect a strong practical focus with extensive use of computer-aided design and analysis software.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "You must be currently enrolled in a master’s course in engineering or related STEM and in a related discipline. The unit assumes that you have the necessary foundational knowledge. "
            }
        },
        {
            "code": "MEC5884",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Sustainable engineering systems",
            "unit_details": {
                "overview": "Overview Sustainable engineering systems are optimised to use resources in a sustainable way - such that the demand of the systems does not deplete the supply of resources and in fact can contribute to that supply.\nThis unit involves a rethink in the way we engineer. At one level, it can … For more content click the Read More button below.Sustainable engineering systems are optimised to use resources in a sustainable way - such that the demand of the systems does not deplete the supply of resources and in fact can contribute to that supply.\nThis unit involves a rethink in the way we engineer. At one level, it can involve water harvesting, co-generation of power or the use of alternative/renewable power sources but at a more fundamental level, it requires us to design smart, adaptive structures and devices.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "You must be currently enrolled in a master’s course in engineering or related STEM and in a related discipline. The unit assumes that you have the necessary foundational knowledge. "
            }
        },
        {
            "code": "MEC5885",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Energy efficiency and sustainability engineering",
            "unit_details": {
                "overview": "Overview This unit explores the theory and practice of the supply of energy, energy management and auditing, and the design of sustainable energy facilities. It deals with the systems needed to create low-energy, sustainable buildings, including passive solar design, energy-efficient heating and air-conditioning, and combined heat and power.\nIn addition, it … For more content click the Read More button below.This unit explores the theory and practice of the supply of energy, energy management and auditing, and the design of sustainable energy facilities. It deals with the systems needed to create low-energy, sustainable buildings, including passive solar design, energy-efficient heating and air-conditioning, and combined heat and power.\nIn addition, it includes coverage of transport energy and energy economics. Case studies from a variety of energy-focused industries such as building services, environmental engineering, heating, ventilation, and air conditioning (HVAC) and architectural technology will be discussed.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "You must be currently enrolled in a master’s course in engineering or related STEM and in a related discipline. The unit assumes that you have the necessary foundational knowledge. "
            }
        },
        {
            "code": "MEC5888",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Renewable energy systems",
            "unit_details": {
                "overview": "Overview This unit examines the thermodynamics of renewable energy systems (principally solar, wind, tidal, hydro, biomass and variants of these); their efficiency; the design of such systems and their selection for differing environments around the globe; reliability of the energy source; trends in renewable energy systems; and the associated environmental and … For more content click the Read More button below.This unit examines the thermodynamics of renewable energy systems (principally solar, wind, tidal, hydro, biomass and variants of these); their efficiency; the design of such systems and their selection for differing environments around the globe; reliability of the energy source; trends in renewable energy systems; and the associated environmental and economic factors. The unit also examines the regulatory environment as a predictor for the uptake of renewable energy systems.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "MEC6888"
                    ]
                },
                "rules": "You must be currently enrolled in a master’s course in engineering or related STEM and in a related discipline. The unit assumes that you have the necessary foundational knowledge. "
            }
        },
        {
            "code": "BMS1021",
            "state": 3,
            "sem": 1,
            "credit points": "6",
            "name": "Cells, tissues and organisms",
            "units": {
                "overview": "Overview This unit introduces the student to the fundamental units of life (the cells) and explores how cells come together to form primary tissues which subsequently combine to form the organ systems and ultimately the living organism.\nCellular structure and metabolism is studied including the chemical constituents of living cells and … For more content click the Read More button below.\nThe unit also introduces students to the microbial world and explores the structure and function of the immune system and how the body develops an immune response.This unit introduces the student to the fundamental units of life (the cells) and explores how cells come together to form primary tissues which subsequently combine to form the organ systems and ultimately the living organism.\nCellular structure and metabolism is studied including the chemical constituents of living cells and the biological reactions that take place in them. Basic developmental biology concepts associated with the patterning of the body plan and embryological origins of cells and tissues are introduced.\nThe unit also introduces students to the microbial world and explores the structure and function of the immune system and how the body develops an immune response.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [
                        "BIO1011",
                        "BIO1022"
                    ],
                    "AND": []
                },
                "rules": "Corequisite: Must be enrolled in one of the following:\n\nBachelor of Biomedical Science (including double degree programs)\nBachelor of Biomedical Science (Scholar Program)\nBachelor of Engineering (honours) (including double degree programs)\n "
            },
            "minor": []
        },
        {
            "code": "CHE1010",
            "state": 3,
            "Sem": 2,
            "credit points": "6",
            "name": "Grand challenges in chemical engineering: Delivering sustainable food, water and energy",
            "units": {
                "overview": "Overview Providing food, water and energy to the world's people in an environmentally sustainable manner is an engineering grand challenge that must be solved in a concerted manner. New scientific discovery and engineering processes are urgently needed, and chemical engineering must provide key solutions in all three areas. This unit will … For more content click the Read More button below.\nThe basic principles of the discipline will be introduced, including heat and material transfer, thermodynamics, fluid dynamics, (bio)chemical reactions engineering and process design/control. Chemical engineering concepts will be developed within workshops and practicals complemented with practical laboratory experience. There will also be an opportunity for activities where, within teams, you will design chemical engineering solutions to important issues or opportunities.\nThis unit is aimed at all engineering students and may be of special interest to those attracted to environmental engineering, biological engineering, civil engineering (water specialisation) and chemical engineering.Providing food, water and energy to the world's people in an environmentally sustainable manner is an engineering grand challenge that must be solved in a concerted manner. New scientific discovery and engineering processes are urgently needed, and chemical engineering must provide key solutions in all three areas. This unit will explore the core concepts and applications of sustainable chemical engineering through interesting case studies drawn from food, water and energy engineering presented by a mix of academic specialists and industry representatives in each area.\nThe basic principles of the discipline will be introduced, including heat and material transfer, thermodynamics, fluid dynamics, (bio)chemical reactions engineering and process design/control. Chemical engineering concepts will be developed within workshops and practicals complemented with practical laboratory experience. There will also be an opportunity for activities where, within teams, you will design chemical engineering solutions to important issues or opportunities.\nThis unit is aimed at all engineering students and may be of special interest to those attracted to environmental engineering, biological engineering, civil engineering (water specialisation) and chemical engineering.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITES:\nAustralian VCE Mathematical methods (Units 3 & 4) or VCE Specialist mathematics (Units 3 & 4) or equivalent.\nCO-REQUISITE: \nYou must be enrolled in the Bachelor of Engineering (Honours) or an engineering double degree or with permission from the Faculty of Engineering. "
            },
            "minor": []
        },
        {
            "code": "CHM1011",
            "state": 3,
            "Sem": 1,
            "credit points": "6",
            "name": "Chemistry 1",
            "units": {
                "overview": "Overview This unit has been designed such that some previous understanding of chemistry is beneficial, but the unit is underpinned by a support structure for those who are relatively new to the subject. On completion of this unit, you will have gained an understanding of the main chemical principles underpining chemical … For more content click the Read More button below.This unit has been designed such that some previous understanding of chemistry is beneficial, but the unit is underpinned by a support structure for those who are relatively new to the subject. On completion of this unit, you will have gained an understanding of the main chemical principles underpining chemical element, chemical reactivity and equilibria.  A number of important topics including atomic structure, bonding and reaction stoichiometry will be introduced to prepare you for a deeper exploration of chemistry. The concepts developed within the workshops and tutorials are complemented through a laboratory program where you will have the opportunity to use a variety of analytical techniques and design your own experiments to solve a range of chemical problems.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PROHIBITION: CHM1051 "
            },
            "minor": []
        },
        {
            "code": "CHM1051",
            "state": 3,
            "Sem": 1,
            "credit points": "6",
            "name": "Chemistry 1 advanced",
            "units": {
                "overview": "Overview This unit has been designed for students who have demonstrated a strong aptitude for chemistry during secondary studies. On completion of this unit, you will be able to apply their understanding of the main chemical principles underpinning chemical elements, chemical reactivity and equilibria. A number of important topics including atomic … For more content click the Read More button below.This unit has been designed for students who have demonstrated a strong aptitude for chemistry during secondary studies. On completion of this unit, you will be able to apply their understanding of the main chemical principles underpinning chemical elements, chemical reactivity and equilibria. A number of important topics including atomic structure, bonding and reaction stoichiometry will be developed to prepare students for a deeper exploration of chemistry. The concepts developed within the workshops are complemented through an extended laboratory program where you will have the opportunity to use a variety of analytical techniques and design your own experiments to solve a range of chemical problems.Read More about Overview",
                "offerings": {
                    "OCT-MY-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "October intake teaching period, Malaysia campus",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITE: VCE Units 3 and 4 Chemistry (raw study score >=37) Or ATAR >=90 PROHIBITION: CHM1011, CHM1031 "
            },
            "minor": []
        },
        {
            "code": "ENE1621",
            "state": 3,
            "Sem": 1,
            "credit points": "6",
            "name": "Environmental engineering",
            "units": {
                "overview": "Overview Introduce concepts of sustainable development, the demands of population and economic growth, industrialisation and urbanisation, energy demand and usage, and human environmental disturbance. Two environmental case studies will be covered in detail, designed to illustrate by way of example many of the considerations that underpin many environmental issues/conflicts/ethics. These are … For more content click the Read More button below.Introduce concepts of sustainable development, the demands of population and economic growth, industrialisation and urbanisation, energy demand and usage, and human environmental disturbance. Two environmental case studies will be covered in detail, designed to illustrate by way of example many of the considerations that underpin many environmental issues/conflicts/ethics. These are climate change and sustainable cities. The multi-disciplinary nature of environmental problems is emphasised together with the need to understand and communicate with other professional and community groups.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            },
            "minor": []
        },
        {
            "code": "ENG1021",
            "state": 3,
            "Sem": 2,
            "credit points": "6",
            "name": "Spatial communication in engineering",
            "units": {
                "overview": "Overview This unit introduces the fundamentals of spatial communication in engineering. This project-oriented unit includes an introduction to engineering drawing, spatial measurement, and spatial visualisation. You will work with various spatial visualisation tools. Starting from hand sketching, you will learn how to produce engineering drawings, collect spatial data, and develop spatial … For more content click the Read More button below.This unit introduces the fundamentals of spatial communication in engineering. This project-oriented unit includes an introduction to engineering drawing, spatial measurement, and spatial visualisation. You will work with various spatial visualisation tools. Starting from hand sketching, you will learn how to produce engineering drawings, collect spatial data, and develop spatial visualisations.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            },
            "minor": []
        },
        {
            "code": "ENG1051",
            "state": 3,
            "Sem": 1,
            "credit points": "6",
            "name": "Materials for energy and sustainability",
            "units": {
                "overview": "Overview The key engineering challenge in the 21st century and beyond is the efficient use of energy and the Earth's resources. Energy supply drives our daily life, and there exist challenges in all of clean energy, renewable energy, energy transmission, energy storage, light materials, and energy-efficient manufacturing. In addition, the physical … For more content click the Read More button below.\nIn this unit, the fundamentals of the structure, design, and application of materials are covered. Attributes such as modulus, strength, toughness, chemical stability, electrical, magnetic, and thermal properties are explained in terms of atomic bonding, crystal defects and polycrystalline microstructure - and how this relates to end users.\nA particular focus will be given to \"processing-structure-property\" relationships, which is at the core of Materials Engineering, with the subjects' concepts elaborated in the context of materials for the efficient use of energy and other resources. Examples will include aerospace materials and functional materials, amongst others.The key engineering challenge in the 21st century and beyond is the efficient use of energy and the Earth's resources. Energy supply drives our daily life, and there exist challenges in all of clean energy, renewable energy, energy transmission, energy storage, light materials, and energy-efficient manufacturing. In addition, the physical infrastructure on which our daily lives depend requires the sustainable use of the finite resources at our disposal. All of these issues are Materials Engineering issues.\nIn this unit, the fundamentals of the structure, design, and application of materials are covered. Attributes such as modulus, strength, toughness, chemical stability, electrical, magnetic, and thermal properties are explained in terms of atomic bonding, crystal defects and polycrystalline microstructure - and how this relates to end users.\nA particular focus will be given to \"processing-structure-property\" relationships, which is at the core of Materials Engineering, with the subjects' concepts elaborated in the context of materials for the efficient use of energy and other resources. Examples will include aerospace materials and functional materials, amongst others.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITES:\nAustralian VCE Mathematical methods (Units 3 & 4) or VCE Specialist mathematics (Units 3 & 4) or equivalent\nAND \nAustralian VCE Chemistry (Units 3 & 4) or Australian VCE Physics (Units 3 & 4) or equivalent "
            },
            "minor": []
        },
        {
            "code": "FIT1056",
            "state": 3,
            "Sem": 2,
            "credit points": "6",
            "name": "Collaborative engineering for web applications",
            "units": {
                "overview": "Overview Some might describe engineering through a purely mathematical lens; however, it necessarily includes a liberal application of domain specific knowledge (engineering fields) and technology (hardware and software) to solve problems, especially at scale. Large-scale software projects are a critical part of all engineering fields in industry. Perhaps a chemical engineering … For more content click the Read More button below.Some might describe engineering through a purely mathematical lens; however, it necessarily includes a liberal application of domain specific knowledge (engineering fields) and technology (hardware and software) to solve problems, especially at scale. Large-scale software projects are a critical part of all engineering fields in industry. Perhaps a chemical engineering firm might need a system to simulate biochemical reactions to find better ways for producing green hydrogen. Or a civil engineering firm might need to identify the relationship between changes to playground designs and their impact on safety. Through this unit, you will work on a large-scale software project (web application) in remote teams working independently and collaboratively. The project will give you an appreciation of how large software projects can be decomposed into smaller segments, built and integrated into individual systems. You also gain an understanding of the abilities and limitations of such systems (within the context of web development) and learn methodological processes that support this. You will develop programming skills for web development (HTML, CSS and Javascript). Some prior programming knowledge would be advantageous, but not required.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ENG1003"
                    ]
                },
                "rules": null
            },
            "minor": []
        },
        {
            "code": "MAT1830",
            "state": 3,
            "Sem": 1,
            "credit points": "6",
            "name": "Discrete mathematics for computer science",
            "units": {
                "overview": "Overview This unit introduces fundamental discrete mathematics topics including combinatorics, sets, relations and functions; methods of logic and proof, especially proof by induction; probability theory, Bayes' theorem; recursion; recurrence relations; trees and other graphs. It establishes the mathematical basis required for studies in Computer Science and Software Engineering.This unit introduces fundamental discrete mathematics topics including combinatorics, sets, relations and functions; methods of logic and proof, especially proof by induction; probability theory, Bayes' theorem; recursion; recurrence relations; trees and other graphs. It establishes the mathematical basis required for studies in Computer Science and Software Engineering.Read More about Overview",
                "offerings": {
                    "OCT-MY-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "October intake teaching period, Malaysia campus",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ITI9004"
                    ]
                },
                "rules": "Prerequisite: VCE Specialist Mathematics or Mathematical Methods units 3 and 4 with a raw study score of at least 25 or Further maths with a raw study score of at least 35. Prohibition: MAT1077, MTH1112 "
            },
            "minor": []
        },
        {
            "code": "PHS1002",
            "state": 3,
            "Sem": 2,
            "credit points": "6",
            "name": "Physics for engineering",
            "units": {
                "overview": "Overview This unit relates key principles of physics to engineering and technology, and shows how physics, including quantum and nano-science, creates useful new technologies. In the Newtonian mechanics topics you will explore the traditional concepts of dynamics, such as energy, momentum and angular momentum, and explore their connections and applications to … For more content click the Read More button below.This unit relates key principles of physics to engineering and technology, and shows how physics, including quantum and nano-science, creates useful new technologies. In the Newtonian mechanics topics you will explore the traditional concepts of dynamics, such as energy, momentum and angular momentum, and explore their connections and applications to a variety of systems, including rocket propulsion, precession and planetary orbits. Within the Electromagnetism topics you will learn about electric and magnetic fields and their effects, as well as explore techniques for determining these fields and understanding their nature as light. In the Quantum physics topic you will explore modern physics concepts such as the uncertainty principle, the probabilistic interpretation of wave functions and atomic models and stimulated emission and explore their connection to technologies like the atomic force microscope and lasers. During the activities for the practical component you will develop measurement, analysis, and communication skills.Read More about Overview",
                "offerings": {
                    "OCT-MY-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "October intake teaching period, Malaysia campus",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "COREQUISITE: Recommend MTH1030 or ENG1005.Note: supporting mathematics studies are required for progression towards the Astrophysics and Physics majors. PREREQUISITE: PHS1001 or PHS1080 or PHS1031 or BMS1031 or VCE Physics (raw study score 25 or above), and ENG1090 or MTH1010 or VCE Mathematical Methods (raw study score 25 or above). PROHIBITION: PHS1011, PHS1022, ENG1081 "
            },
            "minor": []
        },
        {
            "code": "RSE1010",
            "state": 3,
            "Sem": 2,
            "credit points": "6",
            "name": "Natural resources engineering",
            "units": {
                "overview": "Overview This unit provides basic fundamental and practical aspects of resources engineering and introduces the activities which are involved in a resources engineering project. Resources engineers improve and maintain the sustainability of the earth's resources through efficient design and application of technology. The unit highlights the key concepts associated with the … For more content click the Read More button below.\nThe unit includes optional field trips, one during the mid-session break and another one towards the end of the semester so that students can observe the practical aspects of resources engineering and better understand the works that are involved in a resources operation. The field trips include both renewable energy and mining operations These are important as resources engineering is a practice-oriented field in which both fundamentals and practice must be used in an integrated manner for successful outcomes.This unit provides basic fundamental and practical aspects of resources engineering and introduces the activities which are involved in a resources engineering project. Resources engineers improve and maintain the sustainability of the earth's resources through efficient design and application of technology. The unit highlights the key concepts associated with the resources industry through two modules, including mining and renewable energy, and demonstrates the strong link between the mining and renewable energy sectors.\nThe unit includes optional field trips, one during the mid-session break and another one towards the end of the semester so that students can observe the practical aspects of resources engineering and better understand the works that are involved in a resources operation. The field trips include both renewable energy and mining operations These are important as resources engineering is a practice-oriented field in which both fundamentals and practice must be used in an integrated manner for successful outcomes.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            },
            "minor": []
        },
        {
            "code": "ECE2072",
            "credit points": "6",
            "state": 3,
            "Sem": 2,
            "name": "Digital systems",
            "units": {
                "overview": "Overview This unit introduces you to modern logic design techniques, hardware used and common representations. Topics include two and multi-level combinational logic, decoders, multiplexers, arithmetic circuits, programmable and steering logic, flip-flops, registers, counters, RAM and ROM. Using this hardware the design component will include finite state machine design and applications to … For more content click the Read More button below.This unit introduces you to modern logic design techniques, hardware used and common representations. Topics include two and multi-level combinational logic, decoders, multiplexers, arithmetic circuits, programmable and steering logic, flip-flops, registers, counters, RAM and ROM. Using this hardware the design component will include finite state machine design and applications to computer data path control. This will incorporate simple analogue and digital I/O interfacing. Programmable logic devices will be covered, and the use of a hardware description language for describing, synthesising and testing digital logic. Laboratories cover logic design, implementation, and testing.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite: 24 credit points from the Faculty of Engineering or the Faculty of Information Technology\nE6011 Master of Professional Engineering - You are exempt from the prerequisite rule if you are enrolled in this course. "
            },
            "minor": []
        },
        {
            "code": "FIT2085",
            "state": 3,
            "Sem": 0,
            "credit points": "6",
            "name": "Introduction to computer science for engineers",
            "units": {
                "overview": "Overview This unit introduces students to core problem-solving, analytical skills, and methodologies useful for developing flexible, robust, and maintainable software. In doing this, it covers a range of conceptual levels, from fundamental algorithms and data structures, down to their efficient implementation as well as complexity. Topics include data types, data structures, … For more content click the Read More button below.This unit introduces students to core problem-solving, analytical skills, and methodologies useful for developing flexible, robust, and maintainable software. In doing this, it covers a range of conceptual levels, from fundamental algorithms and data structures, down to their efficient implementation as well as complexity. Topics include data types, data structures, algorithms, algorithmic complexity, recursion, and their practical applications.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1003",
                        "ENG1013",
                        "ENG1014"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "FIT1008",
                        "FIT1054"
                    ]
                },
                "rules": null
            },
            "minor": []
        },
        {
            "code": "MAE2505",
            "state": 3,
            "Sem": 2,
            "credit points": "6",
            "name": "Aerospace dynamics",
            "units": {
                "overview": "Overview This unit develops your physical and analytical understanding of concepts of time, space, coordinate systems, particles, rigid bodies, forces, work, energy, mechanical vibration and Newton's Laws of Motion, translating into the ability to formulate and analyse the motion of spacecraft and aircraft under the influence of forces such as lift, … For more content click the Read More button below.This unit develops your physical and analytical understanding of concepts of time, space, coordinate systems, particles, rigid bodies, forces, work, energy, mechanical vibration and Newton's Laws of Motion, translating into the ability to formulate and analyse the motion of spacecraft and aircraft under the influence of forces such as lift, drag, thrust and gravity. You will be taught the fundamentals of kinematics and kinetics of rigid bodies and systems of particles and to carry out dynamic analysis of satellites and orbital spacecraft and aircraft. You will be introduced to properties of the Earth's atmosphere, the forces acting on aircraft and their impact on aircraft performance, resulting in the development of equations for steady level flight, steady climbing and descending flight. This unit is core to understanding the control and manoeuvring of spacecraft and aircraft.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1011",
                        "ENG1001"
                    ],
                    "AND": [
                        "ENG1005",
                        "ENG1005"
                    ]
                },
                "prohibition": {
                    "OR": [
                        "MEC2401",
                        "MAE2406"
                    ],
                    "AND": []
                },
                "rules": null
            },
            "minor": []
        },
        {
            "code": "MEC2404",
            "state": 3,
            "Sem": 2,
            "credit points": "6",
            "name": "Mechanics of fluids",
            "units": {
                "overview": "Overview This unit develops your physical understanding of fluid statics and fluid flow and the interaction of fluid forces with solids.\nTopics include hydrostatics, Reynolds transport theorem, continuity and momentum equations, control volume analysis, the Bernoulli equation, viscous pipe flow, pumps, dimensional analysis, boundary layers, flow measurement techniques and applications of … For more content click the Read More button below.This unit develops your physical understanding of fluid statics and fluid flow and the interaction of fluid forces with solids.\nTopics include hydrostatics, Reynolds transport theorem, continuity and momentum equations, control volume analysis, the Bernoulli equation, viscous pipe flow, pumps, dimensional analysis, boundary layers, flow measurement techniques and applications of fluid forces in flow - lift and drag.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [
                        "MAE2404",
                        "CHE2161"
                    ],
                    "AND": []
                },
                "rules": "Prerequisite: 24 credit points "
            },
            "minor": []
        },
        {
            "code": "CIV4100",
            "state":11,
            "sem":1,
            "credit points": "6",
            "name": "Autonomous vehicle systems",
            "unit_details": {
                "overview": "Overview This unit will introduce students to autonomous systems in general, autonomous vehicle (AV) system in particular, and its development. The unit will provide the fundamental system engineering knowledge of autonomous vehicle systems including the main building blocks, their design, integration and coordination to achieve the ultimate outcome of self-driving in … For more content click the Read More button below.This unit will introduce students to autonomous systems in general, autonomous vehicle (AV) system in particular, and its development. The unit will provide the fundamental system engineering knowledge of autonomous vehicle systems including the main building blocks, their design, integration and coordination to achieve the ultimate outcome of self-driving in a complex and uncertain environment. It will also cover and facilitate the learning in the further development of such systems through working and interacting with the actual autonomous vehicle and its testing and validation processes.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1014",
                        "ENG1060"
                    ],
                    "AND": [
                        "ENG2005",
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "ADDITIONAL PREREQUISITE: 96 cp of engineering study (including ENG1060, ENG2005) "
            }
          },
          {
            "code": "ECE4076",
            "state":11,
            "sem":1,
            "credit points": "6",
            "name": "Computer vision",
            "unit_details": {
                "overview": "Overview This unit aims to develop an understanding of methods for extracting useful information (eg 3-D structure; object size, motion, shape, location and identity, etc) from images. It will allow you to understand how to construct computer vision systems for robotics, surveillance, medical imaging, and related application areas.This unit aims to develop an understanding of methods for extracting useful information (eg 3-D structure; object size, motion, shape, location and identity, etc) from images. It will allow you to understand how to construct computer vision systems for robotics, surveillance, medical imaging, and related application areas.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ECE2071"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "ECE4078",
            "state":11,
            "sem":2,
            "credit points": "6",
            "name": "Intelligent robotics",
            "unit_details": {
                "overview": "Overview Intelligent robotics concerns the melding of artificial perception, strategic reasoning and robotic action in potentially unstructured and time-varying environments to fulfil useful physical tasks, whether in industry or for security, healthcare, search and rescue or civil defence etc. This unit covers topics underpinning the above requirements, including sensors, sensor fusion, … For more content click the Read More button below.Intelligent robotics concerns the melding of artificial perception, strategic reasoning and robotic action in potentially unstructured and time-varying environments to fulfil useful physical tasks, whether in industry or for security, healthcare, search and rescue or civil defence etc. This unit covers topics underpinning the above requirements, including sensors, sensor fusion, machine perception, environmental mapping/monitoring, path planning, localisation, mechanisms, artificial intelligence methodologies and application domains.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ECE2071"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ECE5178"
                    ]
                },
                "rules": "PREREQUISITES: Or FIT1002 or TRC2400 or (FIT1029 and FIT1040)\nIf you are currently enrolled in E6013 Master of Applied Engineering, you are exempt from the prerequisite requirement. "
            }
          },
          {
            "code": "ECE4179",
            "state":11,
            "sem":1,
            "credit points": "6",
            "name": "Neural networks and deep learning",
            "unit_details": {
                "overview": "Overview This unit introduces fundamentals of deep learning and how it can solve problems in many areas, such as image classification, filter design and natural language processing. Neural networks are first described and how training can be achieved with backpropagation. Various forms of deep neural networks are developed, such as multilayer … For more content click the Read More button below.This unit introduces fundamentals of deep learning and how it can solve problems in many areas, such as image classification, filter design and natural language processing. Neural networks are first described and how training can be achieved with backpropagation. Various forms of deep neural networks are developed, such as multilayer perceptrons, convolution neural networks and recurrent neural networks. The mathematics of stochastic optimisation is used to interpret and understand the behaviour and training of these networks. Programming approaches are discussed for training and deploying neural networks. Deep learning technologies and design examples are discussed in areas such as driverless cars, personal cognitive assistants and mastering of games such as GO.Read More about Overview",
                "offerings": {
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005",
                        "ECE2071"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisites: Or ENG2092 in place of ENG2005 "
            }
          },
          
          {
            "code": "ECE2071",
            "state":11,
            "sem":1,
            "credit points": "6",
            "name": "Computer organisation and programming",
            "unit_details": {
                "overview": "Overview This unit provides an introduction to computers and CPU organisation, assemblers and compilers, and algorithm design for engineering problems and embedded computer systems. It covers the language C and its implementation on a typical computer, including standard data types, arrays, control statements, functions, including ways of parameter passing, C library … For more content click the Read More button below.This unit provides an introduction to computers and CPU organisation, assemblers and compilers, and algorithm design for engineering problems and embedded computer systems. It covers the language C and its implementation on a typical computer, including standard data types, arrays, control statements, functions, including ways of parameter passing, C library functions, pointers, strings, arrays of pointers, structures, linked lists and binary tree data structures, dynamic memory allocations, and calls to assembly language programs. Object-oriented programming is introduced. Software engineering is covered as the methodology of software development and lifecycle models. Operating system concepts are introduced. The unit also includes an introduction to programmable logic controllers (PLCs).Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1003",
                        "ENG1013",
                        "ENG1014"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "ECE3093",
            "state":13,
            "sem":1,
            "credit points": "6",
            "name": "Optimisation estimation and numerical methods",
            "unit_details": {
                "overview": "Overview This unit will introduce you to time series analysis, matrix decomposition methods and optimisation in three equal parts. Time series will introduce the concepts of stochastic processes, wide-sense stationarity, autocovariance functions and spectral density. This will lead to the analysis of ARMA (p,g) processes using MATLAB. Matrix decomposition includes singular … For more content click the Read More button below.This unit will introduce you to time series analysis, matrix decomposition methods and optimisation in three equal parts. Time series will introduce the concepts of stochastic processes, wide-sense stationarity, autocovariance functions and spectral density. This will lead to the analysis of ARMA (p,g) processes using MATLAB. Matrix decomposition includes singular value decomposition with applications including data compression, image processing, noise filtering and finding exact and approximate solutions of linear systems. Numerical methods for working efficiently with large matrices and handling ill-conditioned data will be discussed. Methods for unconstrained and constrained optimisation will be presented, with the use of MATLAB.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "FIT3179",
            "state":13,
            "sem":2,
            "credit points": "6",
            "name": "Data visualisation",
            "unit_details": {
                "overview": "Overview Data visualisation is a powerful technique that allows us to use our visual system to understand data. Interactive data visualisation is now common in business, engineering and design and the social and physical sciences. This unit introduces the main kinds of information graphics and interactive visualisation systems and their areas … For more content click the Read More button below.Data visualisation is a powerful technique that allows us to use our visual system to understand data. Interactive data visualisation is now common in business, engineering and design and the social and physical sciences. This unit introduces the main kinds of information graphics and interactive visualisation systems and their areas of application. It investigates the reasons why visualisation can be effective and based on this students will gain experience in critically assessing data visualisations and in designing their own visualisations. You will learn how to create visualisations with representative computer tools and gain experience in creating a data visualisation for an application domain of their choice.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite: Completion of 24 points at first year. "
            }
          },
          {
            "code": "MEC4447",
            "state":13,
            "sem":1,
            "credit points": "6",
            "name": "Computers in fluids and energy",
            "unit_details": {
                "overview": "Overview Computational Fluid Dynamics (CFD) is a well-established analysis, design and optimisation approach for industrial fluid and heat transfer problems. Examples include turbomachinery, vehicle aerodynamics and aeronautics. It is also a powerful research tool and is being increasingly used to answer fundamental questions in a wide range of fields, from astrophysics … For more content click the Read More button below.Computational Fluid Dynamics (CFD) is a well-established analysis, design and optimisation approach for industrial fluid and heat transfer problems. Examples include turbomachinery, vehicle aerodynamics and aeronautics. It is also a powerful research tool and is being increasingly used to answer fundamental questions in a wide range of fields, from astrophysics to nanomaterials. This Unit provides an introduction to this mathematically sophisticated discipline. This involves a review of the equations governing motion and energy of fluids, the mathematical properties of these equations and the relevance of such properties to obtaining numerical solutions. The basics of numerical discretization and solution methods will be discussed. The Unit will also introduce you to using commercial CFD packages in analysing complex industrial problems involving fluids.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ECE3093",
                        "MAE3456",
                        "MEC3456",
                        "MEC3456"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "MTE4590",
            "state":13,
            "sem":2,
            "credit points": "6",
            "name": "Modelling of materials",
            "unit_details": {
                "overview": "Overview An introduction to the computational/modelling approaches currently available in materials science and engineering is provided. The reasons for using modelling approaches are discussed and the different types of models available are outlined. For each of the length scales important in understanding material behaviour (nano-, micro-, meso- and macro-), the available … For more content click the Read More button below.An introduction to the computational/modelling approaches currently available in materials science and engineering is provided. The reasons for using modelling approaches are discussed and the different types of models available are outlined. For each of the length scales important in understanding material behaviour (nano-, micro-, meso- and macro-), the available modelling techniques are outlined and their principles, methods of implementation, advantages, disadvantages and perceived future developments are discussed. Examples of modelling approaches will be selected from all classes of materials. The general methodology used for constructing models is emphasised.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005",
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "BEX3311",
            "state":14,
            "sem":1,
            "credit points": "6",
            "name": "Entrepreneurial mindsets and capabilities",
            "unit_details": {
                "overview": "Overview Entrepreneurship and innovation are driven by our ability to interrogate the world around us and think critically to identify challenges and opportunities worth exploring. The ability to make sense of, and create insight from a problem space or context, powers creative and innovative solutions. Furthermore, the ability to systematically employ … For more content click the Read More button below.\nThis unit provides you with an overall understanding of entrepreneurship and innovation, with a deep dive into cutting edge industry-informed and designed ways of working and hands-on experience in problem exploration. We use design-driven and innovation-focused research, analysis and synthesis tools and techniques to help you tackle a challenge space of your choosing. The unit takes you through human-centred approaches and requires the generation of novel concepts, solutions and tangible concepts to validate with target customers and/or end-users, culminating in an Industry Showcase.\nWhether you want to establish a start-up, work in corporate innovation, or just have a really great toolkit to help you do any job better, this unit will give you the right foundations.Entrepreneurship and innovation are driven by our ability to interrogate the world around us and think critically to identify challenges and opportunities worth exploring. The ability to make sense of, and create insight from a problem space or context, powers creative and innovative solutions. Furthermore, the ability to systematically employ creative thinking and to develop prototypes and approaches to validate hypotheses are crucial skills for entrepreneurs and innovators.\nThis unit provides you with an overall understanding of entrepreneurship and innovation, with a deep dive into cutting edge industry-informed and designed ways of working and hands-on experience in problem exploration. We use design-driven and innovation-focused research, analysis and synthesis tools and techniques to help you tackle a challenge space of your choosing. The unit takes you through human-centred approaches and requires the generation of novel concepts, solutions and tangible concepts to validate with target customers and/or end-users, culminating in an Industry Showcase.\nWhether you want to establish a start-up, work in corporate innovation, or just have a really great toolkit to help you do any job better, this unit will give you the right foundations.Read More about Overview",
                "offerings": {
                    "S1-01-CAULFIELD-ON-CAMPUS": {
                        "location": [
                            "Caulfield"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-CAULFIELD-ONLINE": {
                        "location": [
                            "Caulfield"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "Online"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "You must have completed 72 credit points of study to undertake this unit. "
            }
          },
          {
            "code": "BEX3411",
            "state":14,
            "sem":2,
            "credit points": "6",
            "name": "Building start-ups with impact",
            "unit_details": {
                "overview": "Overview Building start-ups with impact is a unit designed to take what you have developed and learned in BEX2411 Entrepreneurial Mindsets and Capabilities (prerequisite for BEX3411) and bring it to the real world as a venture, not just an idea. This unit is about taking a concept to market and building … For more content click the Read More button below.Building start-ups with impact is a unit designed to take what you have developed and learned in BEX2411 Entrepreneurial Mindsets and Capabilities (prerequisite for BEX3411) and bring it to the real world as a venture, not just an idea. This unit is about taking a concept to market and building a business around it – in a start-up or in an existing firm as an internal venture. You will begin this unit with a concept that you will then build a prototype for, to test and validate in market. Further, you will learn how to develop a service model to make this concept feasible and meet the needs and desires of your target customers and end users. Importantly, you will become skilled at engaging with business modelling techniques to deliver a viable product or service to customers who are willing to pay for it – our challenge to you will be to actually get paying customers by the end of the semester! Once you’ve achieved this, you will be guided to connect and network with investors, companies, community supporters and others in the start-up ecosystem to help you launch and grow.Read More about Overview",
                "offerings": {
                    "S2-01-CAULFIELD-ON-CAMPUS": {
                        "location": [
                            "Caulfield"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CAULFIELD-ONLINE": {
                        "location": [
                            "Caulfield"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "Online"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "BEX2411",
                        "BEX3311"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "FIT3134"
                    ]
                },
                "rules": "You must have completed 72 credit points of study to undertake this unit. "
            }
          },
          {
            "code": "ENG3701",
            "state":14,
            "sem":0,
            "credit points": "6",
            "name": " Entrepreneurial project A",
            "unit_details": {
                "overview": "",
                "offerings": {},
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "ENG3702",
            "state":14,
            "sem":0,
            "credit points": "6",
            "name": "Entrepreneurial project B",
            "unit_details": {
                "overview": "",
                "offerings": {},
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "MEC3010",
            "state":17,
            "sem":1,
            "credit points": "6",
            "name": "Micro and nanotechnologies: Fabrication and applications",
            "unit_details": {
                "overview": "Overview This unit aims to develop an understanding of micro and nanotechnology methods and techniques in a cleanroom environment, the design of process chains and the applications of devices that are currently being manufactured using them.\nMicro and nanofabrication form the basis of manufacturing any modern miniaturised system from computer chips … For more content click the Read More button below.\nThis unit studies the theoretical aspects of micro and nanotechnologies and how these techniques are employed to design manufacturing strategies of micro and nano-systems, considering real case studies of such devices.This unit aims to develop an understanding of micro and nanotechnology methods and techniques in a cleanroom environment, the design of process chains and the applications of devices that are currently being manufactured using them.\nMicro and nanofabrication form the basis of manufacturing any modern miniaturised system from computer chips to sensors and actuators in smartphones, tablets, cars and other vehicles, and diagnostic systems, biomedical devices and devices for environmental monitoring.\nThis unit studies the theoretical aspects of micro and nanotechnologies and how these techniques are employed to design manufacturing strategies of micro and nano-systems, considering real case studies of such devices.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITE: Completion of 18 credit points of level 2 engineering study "
            }
          },
          {
            "code": "CHE3172",
            "state":17,
            "sem":2,
            "credit points": "6",
            "name": "Nanotechnology and materials 1",
            "unit_details": {
                "overview": "Overview This unit introduces the foundation concepts of nanotechnology and nanosynthesis methods, self-assembly of colloids and some characterisation techniques of materials. This unit also covers polymer synthesis and characterisation as well as a number of useful applications of nanotechnology including smart coatings and nanomedicine. The global market and safety associated with … For more content click the Read More button below.This unit introduces the foundation concepts of nanotechnology and nanosynthesis methods, self-assembly of colloids and some characterisation techniques of materials. This unit also covers polymer synthesis and characterisation as well as a number of useful applications of nanotechnology including smart coatings and nanomedicine. The global market and safety associated with nanomaterials and nanotechnology will be described.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "CHM1011",
                        "CHM1022",
                        "CHM1052",
                        "CHM1051"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "MTE4597",
            "state":17,
            "sem":1,
            "credit points": "6",
            "name": "Engineering with nanomaterials",
            "unit_details": {
                "overview": "Overview This unit aims to develop an understanding of synthetic methods, properties and applications of nanomaterials and nanofabrication techniques. The nanomaterials include zero-dimensional nanoparticles, one-dimensional nanostructures (nanotubes, nanorods, nanowires and nanofibres), two-dimensional thin films and three-dimensional nanocomposites. Principles of nanofabrication such as lithography, self-assembly and biomimicry will be introduced. The unit … For more content click the Read More button below.This unit aims to develop an understanding of synthetic methods, properties and applications of nanomaterials and nanofabrication techniques. The nanomaterials include zero-dimensional nanoparticles, one-dimensional nanostructures (nanotubes, nanorods, nanowires and nanofibres), two-dimensional thin films and three-dimensional nanocomposites. Principles of nanofabrication such as lithography, self-assembly and biomimicry will be introduced. The unit will stress the rational design of properties of nanostructured materials and how they may be exploited for every day applications, ranging from food packaging and sunscreens to sensors and energy-related areas.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "MTE2541",
                        "MTE2101",
                        "CHE3172"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "MTE5197"
                    ]
                },
                "rules": null
            }
          },
          {
            "code": "CHE4172",
            "state":17,
            "sem":2,
            "credit points": "6",
            "name": "Nanotechnology and materials 2",
            "unit_details": {
                "overview": "Overview Understanding of synthetic methods, properties and applications of nanomaterials, including zero-dimensional nanoparticles, one-dimensional nanostructures (nanotubes, nanorods, nanowires and nanofibres), two-dimensional thin films, nanoporous materials and nanofabrication techniques such as lithography and self-assembly. Emphasis on advanced nanomaterials and the importance of nanostructured materials used in various chemical engineering applications. Examples of … For more content click the Read More button below.Understanding of synthetic methods, properties and applications of nanomaterials, including zero-dimensional nanoparticles, one-dimensional nanostructures (nanotubes, nanorods, nanowires and nanofibres), two-dimensional thin films, nanoporous materials and nanofabrication techniques such as lithography and self-assembly. Emphasis on advanced nanomaterials and the importance of nanostructured materials used in various chemical engineering applications. Examples of bionanotechnology-inspired nanostructures using biological building blocks in self-assembling processes.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "CHE3172",
                        "MTE2541"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisites: Or MSC2011 "
            }
          },
          {
            "code": "RSE3020",
            "state":16,
            "sem":1,
            "credit points": "6",
            "name": "Resource estimation",
            "unit_details": {
                "overview": "Overview The mineral inventory of a company is quantified through resource or reserve estimates with associated error levels that, in many cases, are unknown. The estimation procedure used by a geologist or engineer should incorporate efforts to minimise errors and assumptions at every level of decision.\nThis unit focuses on resource … For more content click the Read More button below.The mineral inventory of a company is quantified through resource or reserve estimates with associated error levels that, in many cases, are unknown. The estimation procedure used by a geologist or engineer should incorporate efforts to minimise errors and assumptions at every level of decision.\nThis unit focuses on resource and reserve estimation of mineral ores and hydrocarbon deposits, with particular focus on the influence of the in situ geological conditions. You will learn the basics of resource and reserve reporting with particular reference to applicable industry codes. Resource modelling will be taught through computer applications with special consideration of geostatistical techniques.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prohibition: MNE3020 "
            }
          },
          {
            "code": "RSE3040",
            "state":16,
            "sem":2,
            "credit points": "6",
            "name": "Mining systems",
            "unit_details": {
                "overview": "Overview This unit covers underground and surface mining methods and equipment selection for the optimum performance of underground and surface operations. The unit provides a detailed understanding of mining processes and systems engineering along with their key drivers in modern open-cut and underground operations. For each of the mining methods explored … For more content click the Read More button below.This unit covers underground and surface mining methods and equipment selection for the optimum performance of underground and surface operations. The unit provides a detailed understanding of mining processes and systems engineering along with their key drivers in modern open-cut and underground operations. For each of the mining methods explored consideration is given to the mining cycle and access design - eg shafts and/or declines and materials handling. Through practical applications, you will explore the selection of optimal mining systems. For each of the mining systems covered, core risk identification and mitigation are considered.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prohibitions: MNE3040 and MNE3050 "
            }
          },
          {
            "code": "RSE3030",
            "state":16,
            "sem":1,
            "credit points": "6",
            "name": "Ventilation for surface and underground spaces",
            "unit_details": {
                "overview": "Overview This unit provides the fundamentals of ventilation for surface and underground spaces, including properties of air, gas, heat, dust and pollutants control, principles of airflow, ventilation network theory, as well as surface and underground ventilation systems design, with the emphasis on analysis and practical application.This unit provides the fundamentals of ventilation for surface and underground spaces, including properties of air, gas, heat, dust and pollutants control, principles of airflow, ventilation network theory, as well as surface and underground ventilation systems design, with the emphasis on analysis and practical application.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "CIV2263",
                        "MEC2404",
                        "CHE2161"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prohibition: MNE3030 "
            }
          },
          {
            "code": "RSE4010",
            "state":16,
            "sem":2,
            "credit points": "6",
            "name": "Mine planning and scheduling",
            "unit_details": {
                "overview": "Overview This unit deals with the theoretical principles and practical methodologies associated with mine planning and scheduling. Mine planning is an interactive process that includes elements of design, scheduling and evaluation. As part of the planning process, a range of issues has to be considered including, short and long-term planning, mine … For more content click the Read More button below.This unit deals with the theoretical principles and practical methodologies associated with mine planning and scheduling. Mine planning is an interactive process that includes elements of design, scheduling and evaluation. As part of the planning process, a range of issues has to be considered including, short and long-term planning, mine optimisation, cut-off grade analysis and mine evaluation. The unit applies mine planning and scheduling techniques to a case-study project in current state-of-the-art software.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "RSE3020",
                        "RSE3040"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite: Or MNE3020 and MNE3040 Prohibition: MNE4010 "
            }
          },
          {
            "code": "RSE3141",
            "state":18,
            "sem":1,
            "credit points": "6",
            "name": "Solar energy",
            "unit_details": {
                "overview": "Overview This unit covers concepts associated with the solar energy industry including; the characteristics of solar radiation and solar collectors including efficiency evaluation and prediction of long-term performance; system modelling; energy storage; computer simulation and modelling of performance and the economics and financing of solar energy projects.This unit covers concepts associated with the solar energy industry including; the characteristics of solar radiation and solar collectors including efficiency evaluation and prediction of long-term performance; system modelling; energy storage; computer simulation and modelling of performance and the economics and financing of solar energy projects.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG2005",
                        "MTH2010",
                        "MTH2015"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "RSE3241",
            "state":18,
            "sem":2,
            "credit points": "6",
            "name": "Hydropower",
            "unit_details": {
                "overview": "Overview This unit covers all aspects of hydropower, including the fundamental physics behind energy storage in potential energy, design of hydropower systems (dam walls and reservoirs, penstock piping and tunnelling, power house design (turbine and generator), tailrace and electrical connection). The operation of hydropower stations and their influence on the integrated … For more content click the Read More button below.This unit covers all aspects of hydropower, including the fundamental physics behind energy storage in potential energy, design of hydropower systems (dam walls and reservoirs, penstock piping and tunnelling, power house design (turbine and generator), tailrace and electrical connection). The operation of hydropower stations and their influence on the integrated electrical system. The unit covers recent developments in hydropower, in particular, the current trend towards more pumped hydro energy storage. Lectures will be delivered by both academic staff and industry experts who work on real-world hydropower projects.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005",
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "RSE3242",
            "state":18,
            "sem":1,
            "credit points": "6",
            "name": "Geothermal energy",
            "unit_details": {
                "overview": "Overview This unit offers you a practical introduction to all aspects of geothermal energy. The course covers the development of geothermal energy sources for power (from exploration to development and production), as well as alternative uses for these resources. You will learn about the fundamental processes involved in heat and mass … For more content click the Read More button below.This unit offers you a practical introduction to all aspects of geothermal energy. The course covers the development of geothermal energy sources for power (from exploration to development and production), as well as alternative uses for these resources. You will learn about the fundamental processes involved in heat and mass transport in the subsurface, as well as the physics and chemistry involved in electricity production. The course also covers recent developments in geothermal energy - new drilling techniques, enhanced geothermal systems, mineral co-production and low-temperature geothermal systems. You will also be provided with an introduction to the economics surrounding geothermal energy systems.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "RSE3243",
            "state":18,
            "sem":2,
            "credit points": "6",
            "name": "Bioenergy",
            "unit_details": {
                "overview": "Overview This unit provides foundational knowledge of the bioenergy industry, including feedstocks, processing and end-use of products. The unit provides insight into biomass energy resources and bioenergy technologies, including the properties and characteristics of the resources, conversion and utilisation processes, as well as industrial application. Economic cost-effectiveness will be examined. You … For more content click the Read More button below.This unit provides foundational knowledge of the bioenergy industry, including feedstocks, processing and end-use of products. The unit provides insight into biomass energy resources and bioenergy technologies, including the properties and characteristics of the resources, conversion and utilisation processes, as well as industrial application. Economic cost-effectiveness will be examined. You will also conduct a lifecycle analysis of the various pathways to determine the energy return on energy invested. Other issues, such as impacts on food availability, land availability and the social and political impacts, will also be covered.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "TRC3000",
            "state":19,
            "sem":2,
            "credit points": "6",
            "name": "Automation project",
            "unit_details": {
                "overview": "Overview You will learn the planning and communication skills required to undertake a group project. An introduction will be given to the evolution of mechatronic technologies, design tools and methodologies, concurrent engineering design support tools, mechatronics design process and requirement interpretation. The acquisition of these skills will be motivated and tested … For more content click the Read More button below.You will learn the planning and communication skills required to undertake a group project. An introduction will be given to the evolution of mechatronic technologies, design tools and methodologies, concurrent engineering design support tools, mechatronics design process and requirement interpretation. The acquisition of these skills will be motivated and tested by applying them in a group project to design and build a mechatronic system. The mechatronic system will be based on a microcontroller together with appropriate mechanical structure, sensors and actuators.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "TRC4407"
                    ]
                },
                "rules": "PREREQUISITE: Completion of 18 credit points of level 2 engineering study "
            }
          },
          {
            "code": "TRC4200",
            "state":19,
            "sem":1,
            "credit points": "6",
            "name": "Engineering cyber-physical systems",
            "unit_details": {
                "overview": "Overview The unit aims to impart knowledge, skills, and experience required to prepare graduates for the impending digital transformation driving the convergence of technologies that result in Cyber-Physical Systems (CPS). An introduction will be given to Cyber-Physical Systems (CPS). The evolution of key technologies, transformation to digital chains and the need … For more content click the Read More button below.The unit aims to impart knowledge, skills, and experience required to prepare graduates for the impending digital transformation driving the convergence of technologies that result in Cyber-Physical Systems (CPS). An introduction will be given to Cyber-Physical Systems (CPS). The evolution of key technologies, transformation to digital chains and the need to seamlessly combine organisational and technological issues into a single framework will be discussed. A real-life scenario will be used to motivate you to apply CPS technologies to design and develop Smart Systems in any domain of their specialisation and interest. Using the concept of Learning Factories (LF) - a platform to impart experience-based knowledge - the developed solution will be built and tested as a group project.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "MEC3457",
                        "MAE3408",
                        "MEC2402",
                        "ECE3091"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Additional prerequisite:\nCompletion of 96 credit points of engineering study which includes the prerequisite units mentioned. "
            }
          },
          {
            "code": "TRC4902",
            "state":19,
            "sem":2,
            "credit points": "6",
            "name": "Mechatronics and manufacturing",
            "unit_details": {
                "overview": "Overview This unit aims to develop an understanding of the mechatronic engineer's role in the manufacturing industry, manufacturing processes including 3D printing, fundamentals and automation using a CNC controller. Different manufacturing systems: cellular and flexible manufacturing systems will be analysed. Recent advancement in the industry: Industry 4.0 and digital twins will … For more content click the Read More button below.This unit aims to develop an understanding of the mechatronic engineer's role in the manufacturing industry, manufacturing processes including 3D printing, fundamentals and automation using a CNC controller. Different manufacturing systems: cellular and flexible manufacturing systems will be analysed. Recent advancement in the industry: Industry 4.0 and digital twins will be introduced. Modern manufacturing management will be presented and discussed to improve quality and productivity by removing non-value added processes to reduce the production cycle and increase the product life-cycle. This will include lean manufacturing, agile manufacturing and virtual manufacturing. This unit also includes the design of flexible manufacturing systems which is capable of producing a variety of products. The manufacturing support systems such as process planning and control and computer-aided process planning using a variant technique and a generative process planning technique with Artificial Intelligence (AI) will be covered in this unit. Finally, the design of flexible manufacturing systems for a variety of products will be studied to reduce production lot size and the design of assembly manufacturing lines will be optimised.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "MEC2402",
                        "TRC3000"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "If you are currently enrolled in E6013 Master of Applied Engineering, you are exempt from the prerequisites requirement. "
            }
          },
          {
            "code": "ECE3141",
            "state":19,
            "sem":1,
            "credit points": "6",
            "name": "Information and networks",
            "unit_details": {
                "overview": "Overview This unit provides an introduction to underlying technologies, major components and system-wide architectures of modern telecommunication systems. After introducing concepts of block and stream delivery, requirements of a telecommunications network and representation of analogue signals (e.g. voice and video) in digital form, the unit will cover all the major functions … For more content click the Read More button below.This unit provides an introduction to underlying technologies, major components and system-wide architectures of modern telecommunication systems. After introducing concepts of block and stream delivery, requirements of a telecommunications network and representation of analogue signals (e.g. voice and video) in digital form, the unit will cover all the major functions in layered architectures. Topics to be covered include multiplexing, basic line transmission and modulation, error protection and correction, packet switching, LAN protocols and the TCP/IP protocols on which the Internet is built. Particular emphasis is given to the major functions that combine to allow communication across key modern digital telecommunication systems such as the Internet, mobile telephony, digital TV and Digital Audio Broadcasting.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ECE2041"
                    ]
                },
                "rules": "Prerequisite: VCE specialist mathematics and physics or equivalent units "
            }
          },
          {
            "code": "ENE4042",
            "state":20,
            "sem":1,
            "credit points": "6",
            "name": "Environmental impact and risk assessment",
            "unit_details": {
                "overview": "Overview This unit aims to develop an understanding of the role and basis for environmental impact assessment (EIA), environmental risk assessment (ERA) and environmental management systems (EMS). The unit focuses on the processes involved in producing a comprehensive approach to identifying, assessing and planning management processes, with a particular emphasis on … For more content click the Read More button below.This unit aims to develop an understanding of the role and basis for environmental impact assessment (EIA), environmental risk assessment (ERA) and environmental management systems (EMS). The unit focuses on the processes involved in producing a comprehensive approach to identifying, assessing and planning management processes, with a particular emphasis on synthesising technical, regulatory and community issues. The unit aims to encourage you to integrate your existing knowledge in environmental engineering, applying it to real projects. Through lectures, practice classes, individual assignments and group project work, you should develop skills and knowledge in preparing major EIA, ERA and EMS reports, your presentation and communication as well as your engineering context.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [
                        "ENE3608",
                        "ENE4607"
                    ],
                    "AND": []
                },
                "rules": "Prerequisites: Completion of 96 credit points in engineering study or with permission "
            }
          },
          {
            "code": "MTE4593",
            "state":20,
            "sem":2,
            "credit points": "6",
            "name": "Materials and sustainability",
            "unit_details": {
                "overview": "Overview This unit provides an introduction to the political, social and environmental background to materials usage. Major technologies relating to the production, sustainable use and recycling of metals, plastics, glass, electronics, paper and ceramic materials are discussed. Various options involving materials substitution, reclamation, energy recovery and disposal are critically evaluated. The … For more content click the Read More button below.This unit provides an introduction to the political, social and environmental background to materials usage. Major technologies relating to the production, sustainable use and recycling of metals, plastics, glass, electronics, paper and ceramic materials are discussed. Various options involving materials substitution, reclamation, energy recovery and disposal are critically evaluated. The unit considers the economics of materials production, as well as 'cradle-to-grave' analyses of materials, including products and byproducts of the nuclear fuel cycle. In particular, it looks at various life-cycle analysis techniques. We will examine the impact of population, affluence and technology changes on population and ecological footprints with the arrival of the current \"Anthropocene Era\".Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "MTE5193"
                    ]
                },
                "rules": "PREREQUISITE: Completion of 96 credit points in engineering study "
            }
          },
          {
            "code": "ENE2021",
            "state":20,
            "sem":1,
            "credit points": "6",
            "name": "Energy and the environment",
            "unit_details": {
                "overview": "Overview Energy is all around us. From powering household appliances and gas heaters to driving a car across town, it is responsible for making everything that involves movement or activity happen. Although energy cannot be created or destroyed, it is still important for the available energy within our environment to be … For more content click the Read More button below.\nThis unit provides a qualitative and quantitative survey of the physics behind conventional and alternative energy sources. The choice of energy source is also assessed in terms of its environmental impacts, its dependence on critical or scarce resources and the social or political consequences of reliance on that energy source concerning long-term sustainability. Building services and transport are among the largest end-use sectors responsible for energy consumption. Their energy efficiency and decarbonisation will be reviewed. Electricity is one of the most important energy commodities. The discussion on its generation, supply and demand will be expanded.Energy is all around us. From powering household appliances and gas heaters to driving a car across town, it is responsible for making everything that involves movement or activity happen. Although energy cannot be created or destroyed, it is still important for the available energy within our environment to be conserved and used wisely. Our decisions on how we use energy impact the plant's natural systems in complex ways. It is vital that we choose our energy sources carefully and be mindful of the amount of energy we use. The true cost of energy is more than just dollars and cents; there are important environmental and political factors and consequences to consider.\nThis unit provides a qualitative and quantitative survey of the physics behind conventional and alternative energy sources. The choice of energy source is also assessed in terms of its environmental impacts, its dependence on critical or scarce resources and the social or political consequences of reliance on that energy source concerning long-term sustainability. Building services and transport are among the largest end-use sectors responsible for energy consumption. Their energy efficiency and decarbonisation will be reviewed. Electricity is one of the most important energy commodities. The discussion on its generation, supply and demand will be expanded.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ECE3051"
                    ]
                },
                "rules": null
            }
          },
          {
            "code": "ENE3031",
            "state":20,
            "sem":2,
            "credit points": "6",
            "name": "Building sustainability",
            "unit_details": {
                "overview": "Overview This unit will address issues of sustainability in the built environments from a number of perspectives and provide you with a variety of lenses in which the built environments interlock with the human and natural system. You will apply skills and knowledge from this unit, and use a rigorous process … For more content click the Read More button below.This unit will address issues of sustainability in the built environments from a number of perspectives and provide you with a variety of lenses in which the built environments interlock with the human and natural system. You will apply skills and knowledge from this unit, and use a rigorous process of design, simulation, validation, and evaluation, to solve real-world problems. Topics include passive and active technologies, building energy simulation and modelling of different domains in indoor environmental quality, field data acquisition and analysis, building codes and rating system, and the topics intersecting with other fields, such as ubiquitous computing, architecture design, public health, high-performance materials, etc.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG2005",
                        "ENE2503"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "CIV4268",
            "state":20,
            "sem":2,
            "credit points": "6",
            "name": "Water resources management",
            "unit_details": {
                "overview": "Overview This unit considers the quality and quantity aspects of water resources management. Tools and techniques appropriate for design and analysis of water resource systems are introduced, starting from a development of quantitative hydrologic modelling and extending to quantitative prediction of water quality transformations. The fundamental principles of water quantity and … For more content click the Read More button below.This unit considers the quality and quantity aspects of water resources management. Tools and techniques appropriate for design and analysis of water resource systems are introduced, starting from a development of quantitative hydrologic modelling and extending to quantitative prediction of water quality transformations. The fundamental principles of water quantity and quality modelling are also applied within a framework that allows the assessment of water quality in various watercourses.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITE: Completion of 96 cp in engineering study (ENG2005 included) "
            }
          }
    ]
}