{
    "code": "SFTWRENG01",
    "credit points": "144",
    "name": "Software engineering",
    "core_units": [
        {
            "code": "MAT1830",
            "state": 1,
            "sem": 1,
            "credit points": "6",
            "name": "Discrete mathematics for computer science",
            "unit_details": {
                "overview": "Overview This unit introduces fundamental discrete mathematics topics including combinatorics, sets, relations and functions; methods of logic and proof, especially proof by induction; probability theory, Bayes' theorem; recursion; recurrence relations; trees and other graphs. It establishes the mathematical basis required for studies in Computer Science and Software Engineering.This unit introduces fundamental discrete mathematics topics including combinatorics, sets, relations and functions; methods of logic and proof, especially proof by induction; probability theory, Bayes' theorem; recursion; recurrence relations; trees and other graphs. It establishes the mathematical basis required for studies in Computer Science and Software Engineering.Read More about Overview",
                "offerings": {
                    "OCT-MY-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "October intake teaching period, Malaysia campus",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ITI9004"
                    ]
                },
                "rules": "Prerequisite: VCE Specialist Mathematics or Mathematical Methods units 3 and 4 with a raw study score of at least 25 or Further maths with a raw study score of at least 35. Prohibition: MAT1077, MTH1112 "
            }
        },
        {
            "code": "FIT2099",
            "state": 1,
            "sem": 0,
            "credit points": "6",
            "name": "Object oriented design and implementation",
            "unit_details": {
                "overview": "Overview This unit introduces you to object-oriented design principles and their application to the construction of quality software. You will learn the fundamental concepts that underlie modern object-oriented languages, and will learn how to implement your designs using at least one. You will also learn how to use standard notation to … For more content click the Read More button below.This unit introduces you to object-oriented design principles and their application to the construction of quality software. You will learn the fundamental concepts that underlie modern object-oriented languages, and will learn how to implement your designs using at least one. You will also learn how to use standard notation to illustrate your designs.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1014"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "FIT2085",
            "state": 1,
            "sem": 0,
            "credit points": "6",
            "name": "Introduction to computer science for engineers",
            "unit_details": {
                "overview": "Overview This unit introduces students to core problem-solving, analytical skills, and methodologies useful for developing flexible, robust, and maintainable software. In doing this, it covers a range of conceptual levels, from fundamental algorithms and data structures, down to their efficient implementation as well as complexity. Topics include data types, data structures, … For more content click the Read More button below.This unit introduces students to core problem-solving, analytical skills, and methodologies useful for developing flexible, robust, and maintainable software. In doing this, it covers a range of conceptual levels, from fundamental algorithms and data structures, down to their efficient implementation as well as complexity. Topics include data types, data structures, algorithms, algorithmic complexity, recursion, and their practical applications.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1003",
                        "ENG1013",
                        "ENG1014"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "FIT1008",
                        "FIT1054"
                    ]
                },
                "rules": null
            }
        },
        {
            "code": " ",
            "state": 2
        },

        {
            "code": "FIT2004",
            "state": 1,
            "sem": 0,
            "credit points": "6",
            "name": "Algorithms and data structures",
            "unit_details": {
                "overview": "Overview This unit introduces students to problem solving concepts and techniques fundamental to the science of programming. In doing this it covers problem specification, algorithmic design, analysis and implementation. Detailed topics include analysis of best, average and worst-case time and space complexity; introduction to numerical algorithms; recursion; advanced data structures such … For more content click the Read More button below.This unit introduces students to problem solving concepts and techniques fundamental to the science of programming. In doing this it covers problem specification, algorithmic design, analysis and implementation. Detailed topics include analysis of best, average and worst-case time and space complexity; introduction to numerical algorithms; recursion; advanced data structures such as heaps and B-trees; hashing; sorting algorithms; searching algorithms; graph algorithms; and numerical computing.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "FIT1008",
                        "FIT1054",
                        "FIT2085",
                        "FIT2085"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "FIT2101",
            "state": 1,
            "sem": 2,
            "credit points": "6",
            "name": "Software engineering process and management",
            "unit_details": {
                "overview": "Overview A disciplined process is vital to the success of any major software development project. In this unit, you will learn essential skills for managing software development efforts and for working within coordinated teams. You will learn how to decide upon and document your team's structure and process model. Your team … For more content click the Read More button below.\nThere are many factors that can potentially cause a software project to fail. This unit will equip you with techniques to identify and manage these risks, including ethical considerations, and will take a risk-focused approach to project organisation.A disciplined process is vital to the success of any major software development project. In this unit, you will learn essential skills for managing software development efforts and for working within coordinated teams. You will learn how to decide upon and document your team's structure and process model. Your team will be expected to follow the process model they have documented, and to evaluate its effectiveness.\nThere are many factors that can potentially cause a software project to fail. This unit will equip you with techniques to identify and manage these risks, including ethical considerations, and will take a risk-focused approach to project organisation.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1003",
                        "ENG1013",
                        "ENG1060",
                        "ENG1014",
                        "FIT1045"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "FIT2107",
            "state": 1,
            "sem": 2,
            "credit points": "6",
            "name": "Software quality and testing",
            "unit_details": {
                "overview": "Overview This unit focuses on quality assurance issues and techniques in software development projects. It defines software quality and introduces a number of quality assurance measures, including human review and inspection of code artifacts, as well as execution-based testing.\nStudents will apply systematic testing techniques in the context of individual modules … For more content click the Read More button below.This unit focuses on quality assurance issues and techniques in software development projects. It defines software quality and introduces a number of quality assurance measures, including human review and inspection of code artifacts, as well as execution-based testing.\nStudents will apply systematic testing techniques in the context of individual modules and entire systems, using appropriate tools to automate the testing process where possible. Students will systematically document their testing plans and outcomes.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1060",
                        "ENG1014",
                        "ENG1003",
                        "ENG1013",
                        "FIT1045"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": " ",
            "state": 2
        },
        {
            "code": "FIT3077",
            "state": 1,
            "sem": 1,
            "credit points": "6",
            "name": "Software engineering: Architecture and design",
            "unit_details": {
                "overview": "Overview This unit builds on introductory units to analysis and design. It provides the professional software engineer with advanced knowledge and skills in high-level architectural design, its theoretical foundations, industrial best practice, and relevant application context. In the software life-cycle, software architecture sits between analysis/specification and design/implementation. The field of software … For more content click the Read More button below.This unit builds on introductory units to analysis and design. It provides the professional software engineer with advanced knowledge and skills in high-level architectural design, its theoretical foundations, industrial best practice, and relevant application context. In the software life-cycle, software architecture sits between analysis/specification and design/implementation. The field of software architecture has come of age with a thriving research community and numerous high-level models, methods, tools and practices widely used in industry.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "FIT2004",
                        "FIT2081",
                        "FIT2001",
                        "FIT2099"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "FZA3077"
                    ]
                },
                "rules": null
            }
        },
        {
            "code": "FIT3159",
            "state": 1,
            "sem": 1,
            "credit points": "6",
            "name": "Computer architecture",
            "unit_details": {
                "overview": "Overview This unit covers the internal mechanism of computers and how they are organised and programmed. Topics include combinatorial and sequential logic, Boolean Algebra, counters, ripple adders, tree adders, memory/addressing, busses, speed, DMA, data representation, machine arithmetic, microprogramming, caches and cache architectures, virtual memory and translation look-aside buffers, vectored interrupts, polled … For more content click the Read More button below.This unit covers the internal mechanism of computers and how they are organised and programmed. Topics include combinatorial and sequential logic, Boolean Algebra, counters, ripple adders, tree adders, memory/addressing, busses, speed, DMA, data representation, machine arithmetic, microprogramming, caches and cache architectures, virtual memory and translation look-aside buffers, vectored interrupts, polled interrupts, pipelined architecture, superscalar architecture, data dependency, hazards, CISC, RISC, VLIW machine architectures.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "FIT1047",
                        "FIT1008",
                        "FIT2085"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "FIT3170",
            "state": 1,
            "sem": 0,
            "credit points": "1",
            "name": "Software engineering practice",
            "unit_details": {
                "overview": "Overview In this unit, students will undertake a full-year software development project in a self-managing team. Students will apply the skills they learned in prerequisite and co-requisite units to a larger project than any they have encountered to date. Through attempting larger-scale software development they will learn how the techniques they … For more content click the Read More button below.\nThe project will be managed through a heavyweight process model such as the Spiral Model, to ensure students are exposed to a representative example of both heavyweight and lightweight processes (which are covered in FIT2101) through the BSE core.\nFor the first time in their degrees, students will solicit and document requirements from client proxies who are not IT professionals. This builds their communication skills with other stakeholders in preparation for the industry-based project or IBL.In this unit, students will undertake a full-year software development project in a self-managing team. Students will apply the skills they learned in prerequisite and co-requisite units to a larger project than any they have encountered to date. Through attempting larger-scale software development they will learn how the techniques they have encountered in isolation work together as an integrated methodology to make such complex projects feasible.\nThe project will be managed through a heavyweight process model such as the Spiral Model, to ensure students are exposed to a representative example of both heavyweight and lightweight processes (which are covered in FIT2101) through the BSE core.\nFor the first time in their degrees, students will solicit and document requirements from client proxies who are not IT professionals. This builds their communication skills with other stakeholders in preparation for the industry-based project or IBL.Read More about Overview",
                "offerings": {
                    "FY-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Full year",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "FY-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Full year",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "FIT2101",
                        "FIT2107"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": " ",
            "state": 2
        },
        {
            "code": "FIT2100",
            "state": 1,
            "sem": 0,
            "credit points": "6",
            "name": "Operating systems",
            "unit_details": {
                "overview": "Overview This unit will provide students with the knowledge of how a multi-programming, multi-user operating systems operates and it manages and allocate resources to different applications. Students will be able to compare and contrast various resource management allocation strategies. Students will develop and implement code to understand and make use of … For more content click the Read More button below.\nThe topics covered will include an introduction to C Programming which is heavily used in development of operating systems, operating system structure and services, multi-programming processes, CPU scheduling, memory management, device management, synchronisation, deadlocks, virtual memory and file systems.This unit will provide students with the knowledge of how a multi-programming, multi-user operating systems operates and it manages and allocate resources to different applications. Students will be able to compare and contrast various resource management allocation strategies. Students will develop and implement code to understand and make use of operating system services.\nThe topics covered will include an introduction to C Programming which is heavily used in development of operating systems, operating system structure and services, multi-programming processes, CPU scheduling, memory management, device management, synchronisation, deadlocks, virtual memory and file systems.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "FIT1047",
                        "ENG1013",
                        "ENG1003"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "FIT3171",
            "state": 1,
            "sem": 0,
            "credit points": "6",
            "name": "Databases",
            "unit_details": {
                "overview": "Overview This unit will provide an introduction to the concepts of database design and usage and the related issues of data management. You will develop skills in planning, designing, and implementing a data model using an enterprise-scale relational database system (Oracle). Methods and techniques will also be presented to populate, retrieve, … For more content click the Read More button below.This unit will provide an introduction to the concepts of database design and usage and the related issues of data management. You will develop skills in planning, designing, and implementing a data model using an enterprise-scale relational database system (Oracle). Methods and techniques will also be presented to populate, retrieve, update and implement integrity features on data in the implemented database system.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": ["FIT1045","FIT1048","FIT1051","FIT1053","ENG1003","ENG1013"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "FIT2094"
                    ]
                },
                "rules": null
            }
        },
        {
            "code": "FIT3170",
            "state": 1,
            "sem": 0,
            "credit points": "1",
            "name": "Software engineering practice",
            "unit_details": {
                "overview": "Overview In this unit, students will undertake a full-year software development project in a self-managing team. Students will apply the skills they learned in prerequisite and co-requisite units to a larger project than any they have encountered to date. Through attempting larger-scale software development they will learn how the techniques they … For more content click the Read More button below.\nThe project will be managed through a heavyweight process model such as the Spiral Model, to ensure students are exposed to a representative example of both heavyweight and lightweight processes (which are covered in FIT2101) through the BSE core.\nFor the first time in their degrees, students will solicit and document requirements from client proxies who are not IT professionals. This builds their communication skills with other stakeholders in preparation for the industry-based project or IBL.In this unit, students will undertake a full-year software development project in a self-managing team. Students will apply the skills they learned in prerequisite and co-requisite units to a larger project than any they have encountered to date. Through attempting larger-scale software development they will learn how the techniques they have encountered in isolation work together as an integrated methodology to make such complex projects feasible.\nThe project will be managed through a heavyweight process model such as the Spiral Model, to ensure students are exposed to a representative example of both heavyweight and lightweight processes (which are covered in FIT2101) through the BSE core.\nFor the first time in their degrees, students will solicit and document requirements from client proxies who are not IT professionals. This builds their communication skills with other stakeholders in preparation for the industry-based project or IBL.Read More about Overview",
                "offerings": {
                    "FY-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Full year",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "FY-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Full year",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "FIT2101",
                        "FIT2107"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": " ",
            "state": 2
        },
        {
            "code": "FIT4002",
            "state": 1,
            "sem": 0,
            "credit points": "1",
            "name": "Software engineering industry experience studio project",
            "unit_details": {
                "overview": "Overview Students will undertake a large project and work in groups on a software project for a client. The client may be internal to Monash or from the industry or research organisation. In general, projects involve all aspects of the system development lifecycle. Groups are responsible for their own project management, … For more content click the Read More button below.Students will undertake a large project and work in groups on a software project for a client. The client may be internal to Monash or from the industry or research organisation. In general, projects involve all aspects of the system development lifecycle. Groups are responsible for their own project management, with guidance from a supervisor. Some projects will warrant students working in pairs or individually.Read More about Overview",
                "offerings": {
                    "FY-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Full year",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "FY-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Full year",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Corequisite:\n\nFor Clayton E3001 students (and Software Engineering double degree students): ENG0001\n "
            }
        },
        {
            "code": "FIT4165",
            "state": 1,
            "sem": 1,
            "credit points": "6",
            "name": "Computer networks",
            "unit_details": {
                "overview": "Overview The unit introduces computer networks with an explicit software and system-centric focus. It provides skills in data communications, networks, and associated software interfaces, and introduces principles in network design, configuration, management and security.The unit introduces computer networks with an explicit software and system-centric focus. It provides skills in data communications, networks, and associated software interfaces, and introduces principles in network design, configuration, management and security.",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "FIT2100",
                        "FIT3159"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "FIT3165"
                    ]
                },
                "rules": null
            }
        },

        {
            "code": "FIT4701",
            "state": 1,
            "sem": 1,
            "credit points": "6",
            "name": "Final year software engineering project A",
            "unit_details": {
                "overview": "Overview The aim of this capstone unit is to provide an opportunity for you to undertake a substantial individual or small group project. Projects undertaken will integrate and build on content from earlier stages of the course. This unit is the first part of a two-unit project.The aim of this capstone unit is to provide an opportunity for you to undertake a substantial individual or small group project. Projects undertaken will integrate and build on content from earlier stages of the course. This unit is the first part of a two-unit project.",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITE: 18 engineering or FIT credit points at level three.\nCOREQUISITE: ENG0001 (Clayton-based students) "
            }
        },
        {
            "code": " ",
            "state": 2
        },
        {
            "code": "FIT4002",
            "state": 1,
            "sem": 0,
            "credit points": "1",
            "name": "Software engineering industry experience studio project",
            "unit_details": {
                "overview": "Overview Students will undertake a large project and work in groups on a software project for a client. The client may be internal to Monash or from the industry or research organisation. In general, projects involve all aspects of the system development lifecycle. Groups are responsible for their own project management, … For more content click the Read More button below.Students will undertake a large project and work in groups on a software project for a client. The client may be internal to Monash or from the industry or research organisation. In general, projects involve all aspects of the system development lifecycle. Groups are responsible for their own project management, with guidance from a supervisor. Some projects will warrant students working in pairs or individually.Read More about Overview",
                "offerings": {
                    "FY-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Full year",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "FY-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Full year",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Corequisite:\n\nFor Clayton E3001 students (and Software Engineering double degree students): ENG0001\n "
            }
        },
        {
            "code": "FIT4702",
            "state": 1,
            "sem": 2,
            "credit points": "6",
            "name": "Final year software engineering project B",
            "unit_details": {
                "overview": "Overview This unit is a continuation of FIT4701 Final year software engineering project A. The aim of this capstone unit is to provide an opportunity for you to undertake a substantial individual or small group project. Projects undertaken will integrate and build on content from earlier stages of the course.This unit is a continuation of FIT4701 Final year software engineering project A. The aim of this capstone unit is to provide an opportunity for you to undertake a substantial individual or small group project. Projects undertaken will integrate and build on content from earlier stages of the course.",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "FIT4701"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": " ",
            "state": 2
        },
        {
            "code": " ",
            "state": 2
        },

        {
            "code": "FIT3003",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Business intelligence and data warehousing",
            "unit_details": {
                "overview": "Overview Automation and the use of technological tools have resulted in the accumulation of vast volumes of data by modern business organisations. Data warehouses have been set up as repositories to store this data and improved techniques now result in the speedy collection and integration of such data. OLAP technology has … For more content click the Read More button below.Automation and the use of technological tools have resulted in the accumulation of vast volumes of data by modern business organisations. Data warehouses have been set up as repositories to store this data and improved techniques now result in the speedy collection and integration of such data. OLAP technology has resulted in the faster generation of reports and more flexible analysis based on the data repositories. This unit will explore the concepts of data warehousing and OLAP, covering the data processing technological requirements for data warehousing and OLAP and will provide hands on experience on designing data warehousing and OLAP systems.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "FIT2094",
                        "FIT3171"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "FIT3031",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Network security",
            "unit_details": {
                "overview": "Overview This unit will provide students with an understanding of: OSI security architecture; common information risks and requirements; operation of encryption techniques; digital signatures; public key infrastructure; authentication and non-repudiation; intrusion detection and response; firewall defence; privacy and ethics issues; security configurations to PC-based applications; and design of information systems with … For more content click the Read More button below.This unit will provide students with an understanding of: OSI security architecture; common information risks and requirements; operation of encryption techniques; digital signatures; public key infrastructure; authentication and non-repudiation; intrusion detection and response; firewall defence; privacy and ethics issues; security configurations to PC-based applications; and design of information systems with security compliance and security standards and protocols.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "FIT1047",
                        "FIT2093"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "FZA3031"
                    ]
                },
                "rules": null
            }
        },
        {
            "code": "FIT3080",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Artificial intelligence",
            "unit_details": {
                "overview": "Overview This unit includes history of artificial intelligence; intelligent agents; problem solving and search (problem representation, heuristic search, iterative improvement, game playing); knowledge representation and reasoning (extension of material on propositional and first-order logic for artificial intelligence applications, planning, frames and semantic networks); reasoning under uncertainty (belief networks); machine learning (decision … For more content click the Read More button below.This unit includes history of artificial intelligence; intelligent agents; problem solving and search (problem representation, heuristic search, iterative improvement, game playing); knowledge representation and reasoning (extension of material on propositional and first-order logic for artificial intelligence applications, planning, frames and semantic networks); reasoning under uncertainty (belief networks); machine learning (decision trees, Naive Bayes, neural nets and genetic algorithms); language technology.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "MAT1841",
                        "MTH1030",
                        "MTH1035",
                        "ENG1005"
                    ],
                    "AND": [
                        "MAT1830",
                        "MAT1830"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "FIT3094",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Artificial life, artificial intelligence and virtual environments",
            "unit_details": {
                "overview": "Overview This unit introduces topics in Artificial Intelligence (AI) and Artificial Life (ALife) suited to real-time simulation and computer games development. Using a practice-based and programming-led approach, the unit explores elements of the history of these fields, and their application to games, the fields’ fundamental concepts and theory, as well as … For more content click the Read More button below.This unit introduces topics in Artificial Intelligence (AI) and Artificial Life (ALife) suited to real-time simulation and computer games development. Using a practice-based and programming-led approach, the unit explores elements of the history of these fields, and their application to games, the fields’ fundamental concepts and theory, as well as practical techniques and algorithms that can be used to build real-time, interactive games, virtual environments and simulations. Starting with basic concepts in 2D discrete simulation, the unit progresses to continuous 3D models, agent-based models, bio-inspired intelligence and search algorithms. Programs are developed primarily using C++.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "FIT2096"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "FIT3138",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Real time enterprise systems",
            "unit_details": {
                "overview": "Overview This unit provides both a theoretical and practical overview of real time enterprise systems. Real time enterprise systems are configurable information systems packages, implemented on-line that integrate people, technology and information processing. The three integrated processes within and across functional areas are seamlessly interconnected and almost time-lag free in an … For more content click the Read More button below.This unit provides both a theoretical and practical overview of real time enterprise systems. Real time enterprise systems are configurable information systems packages, implemented on-line that integrate people, technology and information processing. The three integrated processes within and across functional areas are seamlessly interconnected and almost time-lag free in an organisation. Topics include systems and technology background, ES evolution, ES lifecycle, implementation and configuration, ES and electronic commerce and ES success and failure factors. The theoretical component will be augmented by detailed case studies which focus on problems faced by real-life companies. For the practical component, laboratory exercises using a well-known enterprise system will be used to deepen student understanding.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite: Completion of 12 points of level two units from Information Technology, Science or Engineering or equivalent. "
            }
        },
        {
            "code": "FIT3139",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Computational modelling and simulation",
            "unit_details": {
                "overview": "Overview This unit provides an overview of computational science and an introduction to its central methods. It covers the role of computational tools and methods in 21st century science, emphasising modelling and simulation. It introduces a variety of models, providing contrasting studies on: continuous versus discrete models; analytical versus numerical models; … For more content click the Read More button below.\nA general overview is provided for each main topic, followed by a detailed technical exploration of one or a few methods selected from the area. These are applied in tutorials and laboratories which also acquaint students with standard scientific computing software (e.g., Mathematica, Matlab, Maple, Sage). Applications are drawn from disciplines including Physics, Biology, Bioinformatics, Chemistry, Social Science.This unit provides an overview of computational science and an introduction to its central methods. It covers the role of computational tools and methods in 21st century science, emphasising modelling and simulation. It introduces a variety of models, providing contrasting studies on: continuous versus discrete models; analytical versus numerical models; deterministic versus stochastic models; and static versus dynamic models. Other topics include: Monte-Carlo methods; epistemology of simulations; visualisation; high-dimensional data analysis; optimisation; limitations of numerical methods; high-performance computing and data-intensive research.\nA general overview is provided for each main topic, followed by a detailed technical exploration of one or a few methods selected from the area. These are applied in tutorials and laboratories which also acquaint students with standard scientific computing software (e.g., Mathematica, Matlab, Maple, Sage). Applications are drawn from disciplines including Physics, Biology, Bioinformatics, Chemistry, Social Science.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisites: One of MAT1841, ENG1091, ENG1005, MTH1030, MTH1035 or equivalent, plus any introductory programming unit (e.g. FIT1045, FIT1048, FIT1051, FIT1053,  ECE2071, or equivalent) "
            }
        },
        {
            "code": "FIT3142",
            "state": 10,
            "sem": 0,
            "credit points": "6",
            "name": "Distributed computing",
            "unit_details": {
                "overview": "",
                "offerings": {},
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "FIT3143",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Parallel computing",
            "unit_details": {
                "overview": "Overview Modern computer systems contain parallelism in both hardware and software. This unit covers parallelism in both general purpose and application specific computer architectures and the programming paradigms that allow parallelism to be exploited in software. The unit examines shared memory and message passing paradigms in hardware and software; concurrency, multithreading … For more content click the Read More button below.Modern computer systems contain parallelism in both hardware and software. This unit covers parallelism in both general purpose and application specific computer architectures and the programming paradigms that allow parallelism to be exploited in software. The unit examines shared memory and message passing paradigms in hardware and software; concurrency, multithreading and synchronicity; parallel, clustered and distributed supercomputing algorithms, languages and software tools and development environments. Students will learn to design and develop parallel algorithms in these paradigms, and apply technical writing and presentation to communicate parallel computing.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "FIT2004"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "FIT3146",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Maker lab",
            "unit_details": {
                "overview": "Overview This unit will enable students to create new artefacts which utilise developments in information technology. The unit will combine the theoretical and technical skills gained in other units into a problem solving context and allow the students to gain the skills needed to create solutions of problems using technology. Students … For more content click the Read More button below.This unit will enable students to create new artefacts which utilise developments in information technology. The unit will combine the theoretical and technical skills gained in other units into a problem solving context and allow the students to gain the skills needed to create solutions of problems using technology. Students will learn valuable research and communication skills as they explore and create using a variety of technologies that support the making process. Student will have the opportunity to explore new technologies and undertake the prototyping and refinement process in an environment that supports independent learning. Students will have the opportunity to use technology to solve a problem which is of interest.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite: Plus 90 points of any units "
            }
        },
        {
            "code": "FIT3152",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Data analytics",
            "unit_details": {
                "overview": "Overview There has been an explosion in the quantity and variety of data collected and routinely analysed by government, business and society at large over recent years. This has been described by some social commentators as the rise of \"big data\" and and the analysts and practitioners who investigate this data … For more content click the Read More button below.There has been an explosion in the quantity and variety of data collected and routinely analysed by government, business and society at large over recent years. This has been described by some social commentators as the rise of \"big data\" and and the analysts and practitioners who investigate this data as \"data scientists.\" This unit will introduce students to the analysis of big data and the role of the data scientist. Techniques covered include data management and transformation, visual analysis, social network analysis, statistical learning, clustering and natural language processing. Students will be introduced to these methods using open source industry standard software. Data and case studies will be drawn from diverse sources. The general principles of analysis, investigation and reporting will be covered. Students will be encouraged to critically reflect on the data analysis process within their own domain of interest.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ETX2250"
                    ]
                },
                "rules": null
            }
        },
        {
            "code": "FIT3154",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Advanced data analysis",
            "unit_details": {
                "overview": "Overview This unit introduces the problem of machine learning and the major kinds of statistical learning used in data analysis. Learning and the different kinds of learning will be covered and their usage discussed. Evaluation techniques and typical application contexts will presented. A series of different models and algorithms will be … For more content click the Read More button below.This unit introduces the problem of machine learning and the major kinds of statistical learning used in data analysis. Learning and the different kinds of learning will be covered and their usage discussed. Evaluation techniques and typical application contexts will presented. A series of different models and algorithms will be presented in an exploratory way: looking at typical data, the basic models and algorithms and their use: linear and logistic regression, support vector machines, Bayesian networks, decision trees, random forests, k-means and clustering, neural-networks, deep learning, and others. Finally, two specialist topics will be covered briefly, statistical learning theory and working with big data.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "FIT2086"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite: Or related statistical background "
            }
        },
        {
            "code": "FIT3155",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Advanced data structures and algorithms",
            "unit_details": {
                "overview": "Overview This unit builds on the concepts learnt in introductory algorithms and data structures study. It covers advanced algorithmic paradigms and problem-solving techniques required to address real-world programming challenges. It explores, in depth, the design and analysis of space-efficient data structures and time-efficient problem solving strategies to be used with them. … For more content click the Read More button below.This unit builds on the concepts learnt in introductory algorithms and data structures study. It covers advanced algorithmic paradigms and problem-solving techniques required to address real-world programming challenges. It explores, in depth, the design and analysis of space-efficient data structures and time-efficient problem solving strategies to be used with them. Topics include amortized analysis, advanced sorting and searching algorithms, new tree/string/graph data structures and algorithms, and number-theoretic algorithms amongst others.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "FIT2004"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "FIT3157",
            "state": 10,
            "sem": 0,
            "credit points": "6",
            "name": "Advanced web design",
            "unit_details": {
                "overview": "Overview Building upon the skills learned in the Interactive media major core units (Interactive media foundations and Interactive media studios 1 & 2), FIT3157 introduces students to the design and development of mobile online media using HTML5, CSS3, JavaScript and WordPress. This unit is broadly divided into three parts, with groups … For more content click the Read More button below.Building upon the skills learned in the Interactive media major core units (Interactive media foundations and Interactive media studios 1 & 2), FIT3157 introduces students to the design and development of mobile online media using HTML5, CSS3, JavaScript and WordPress. This unit is broadly divided into three parts, with groups of four weeks comprising each part. The first and second part of the unit, students will learn the principles and practicalities of responsive web design, touch based interaction and the programming of mobile functionality and animated visual effects. The final four weeks of the unit will cover WordPress content management and theme development, the managing of custom content in WordPress and the building of dynamic WordPress sites.Read More about Overview",
                "offerings": {},
                "prerequisite": {
                    "OR": [
                        "FIT1050",
                        "FIT2092",
                        "ENG1003",
                        "ENG1013"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "FIT3168",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "IT forensics",
            "unit_details": {
                "overview": "Overview This unit provides a broad coverage of digital ICT forensics. You will examine definitions of evidence as they apply to investigations involving the seizure and examination of information technology devices. The unit will introduce you to various tools, techniques and algorithms that may be employed by investigators for acquisition, preservation … For more content click the Read More button below.This unit provides a broad coverage of digital ICT forensics. You will examine definitions of evidence as they apply to investigations involving the seizure and examination of information technology devices. The unit will introduce you to various tools, techniques and algorithms that may be employed by investigators for acquisition, preservation and analysis of evidence. Disk-based (local) and network (remote) forensic environments will be explored. You will also learn of the impediments and complicating factors that can threaten forensic investigations.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "FIT2093"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "FIT3169",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Immersive environments",
            "unit_details": {
                "overview": "Overview FIT3169 introduces students to immersive environment design and production principles using game engine prototyping software. Building upon the 3D creation and editing skills in the prerequisite unit FIT1033 Foundations of 3D, students will learn how to create game levels, import assets (models, sounds, animations), and extend supplied code to visualise … For more content click the Read More button below.FIT3169 introduces students to immersive environment design and production principles using game engine prototyping software. Building upon the 3D creation and editing skills in the prerequisite unit FIT1033 Foundations of 3D, students will learn how to create game levels, import assets (models, sounds, animations), and extend supplied code to visualise interactive virtual environments for a range of applications and devices.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "FIT1033",
                        "DIS1911"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "FIT3173",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Software security",
            "unit_details": {
                "overview": "Overview This unit aims to introduce secure software development issues from the design stage, through to implementation, testing and deployment. Topics studied include the secure software development life cycle, secure software design principles, threat evaluation models, secure coding and development practices, software security testing, deployment and maintenance. Students are provided with … For more content click the Read More button below.This unit aims to introduce secure software development issues from the design stage, through to implementation, testing and deployment. Topics studied include the secure software development life cycle, secure software design principles, threat evaluation models, secure coding and development practices, software security testing, deployment and maintenance. Students are provided with a range of practical exercises and tasks to reinforce their skills including: identification of security bugs in programs written in different programming languages, design, implementation, and testing of secure concurrent and networked applications and identification of vulnerabilities in networked and mobile/wireless applications.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "SSB-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Summer semester B",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "FIT1045",
                        "FIT1048",
                        "FIT1051",
                        "FIT1053",
                        "FIT1053"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "FZA3173"
                    ]
                },
                "rules": null
            }
        },
        {
            "code": "FIT3175",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Usability",
            "unit_details": {
                "overview": "Overview This unit explores the underpinning theories, principles and practices of interface design to achieve usable computer-based systems. It examines issues in the design of system interfaces from a number of perspectives: user, programmer, designer. It explores the application of the relevant theories in practice. The unit will cover topics such … For more content click the Read More button below.This unit explores the underpinning theories, principles and practices of interface design to achieve usable computer-based systems. It examines issues in the design of system interfaces from a number of perspectives: user, programmer, designer. It explores the application of the relevant theories in practice. The unit will cover topics such as methods and tools for developing effective user interfaces, evaluation methods such as the conduct of usability and heuristic evaluations, design of appropriate interface elements including the design of menus and other interaction styles. The unit will also focus on designing for a diverse range of users and environments.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "SSB-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Summer semester B",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        null
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "FIT3176",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Advanced database design",
            "unit_details": {
                "overview": "Overview This unit will introduce advanced concepts in the areas of database design, including document-store, column-store, and graph database design; implementations in non-relational database systems.This unit will introduce advanced concepts in the areas of database design, including document-store, column-store, and graph database design; implementations in non-relational database systems.",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "FIT2094",
                        "FIT3171"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "FIT3178",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "iOS app development",
            "unit_details": {
                "overview": "Overview This unit focuses on the design, development and deployment of mobile apps for iOS using the Swift programming language. Students will learn best practices for iOS development using native frameworks and common design patterns. The unit will explore areas such as mobile UI design, data storage, web services and networking, … For more content click the Read More button below.This unit focuses on the design, development and deployment of mobile apps for iOS using the Swift programming language. Students will learn best practices for iOS development using native frameworks and common design patterns. The unit will explore areas such as mobile UI design, data storage, web services and networking, mobile sensors, use of media, and mobile interface testing. The unit will emphasise hands-on, practical experience with the Xcode development environment and iOS simulator. Students will design and build their own app.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "FIT3179",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Data visualisation",
            "unit_details": {
                "overview": "Overview Data visualisation is a powerful technique that allows us to use our visual system to understand data. Interactive data visualisation is now common in business, engineering and design and the social and physical sciences. This unit introduces the main kinds of information graphics and interactive visualisation systems and their areas … For more content click the Read More button below.Data visualisation is a powerful technique that allows us to use our visual system to understand data. Interactive data visualisation is now common in business, engineering and design and the social and physical sciences. This unit introduces the main kinds of information graphics and interactive visualisation systems and their areas of application. It investigates the reasons why visualisation can be effective and based on this students will gain experience in critically assessing data visualisations and in designing their own visualisations. You will learn how to create visualisations with representative computer tools and gain experience in creating a data visualisation for an application domain of their choice.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite: Completion of 24 points at first year. "
            }
        },
        {
            "code": "FIT3182",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Big data management and processing",
            "unit_details": {
                "overview": "Overview Data engineering is about developing the software (and hardware) infrastructure to support data science. This unit introduces software tools and techniques for data engineering, but not hardware. It will cover an introduction to big data processing, covering volume, variety, and velocity; large volume data processing using parallel technologies; variety data … For more content click the Read More button below.Data engineering is about developing the software (and hardware) infrastructure to support data science. This unit introduces software tools and techniques for data engineering, but not hardware. It will cover an introduction to big data processing, covering volume, variety, and velocity; large volume data processing using parallel technologies; variety data formats, including unstructured and semi-structured data, using NoSQL databases; and velocity data processing, covering data streaming.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "FIT2094",
                        "FIT3171"
                    ],
                    "AND": [
                        "FIT2004",
                        "FIT2004"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Students should have an understanding of database concepts and SQL and Python programming background. "
            }
        },
        {
            "code": "FIT4005",
            "state": 10,
            "sem": 0,
            "credit points": "6",
            "name": "Research methods in information technology",
            "unit_details": {
                "overview": "Overview The aim of this unit is to prepare students to conduct research in an industry IT context. It provides broad coverage of the issues, concepts, methods, and techniques associated with the diverse responsibilities expected from the contemporary IT professional as they evaluate products, conduct R&D and plan product feature development. … For more content click the Read More button below.The aim of this unit is to prepare students to conduct research in an industry IT context. It provides broad coverage of the issues, concepts, methods, and techniques associated with the diverse responsibilities expected from the contemporary IT professional as they evaluate products, conduct R&D and plan product feature development. It introduces students to major research paradigms, the principles of research design, research ethics, and research methods and techniques of data collection and analysis appropriate to research in the IT industry. It covers how to effectively communicate the results of a piece of research through the established method of short-form video. Skills developed and knowledge acquired from this unit will prepare students to plan, conduct and communicate research within an IT organisation, as well as to be knowledgeable and critical interpreters of research more generally.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ITI5125",
                        "FIT5125",
                        "FIT5190",
                        "FIT5143"
                    ]
                },
                "rules": "Prerequisite: Foundation knowledge in computer science or business information systems or information technology and systems fundamentals.\nFor students enrolled in E3001, E3002, E3005, E3010, E3011, E3007: completion of 144 credit points of study in the Bachelor of Software Engineering (Honours) degree. Prohibition: FIT2083** BCS Honours students who have completed FIT2083 are exempt from completing FIT4005 as part of their Honours study but must select an alternative unit with the approval of their course director. However, FIT4005 remains the preferred research methods unit option for BCS Honours students. "
            }
        },
        {
            "code": "FIT4009",
            "state": 10,
            "sem": 0,
            "credit points": "6",
            "name": "Advanced topics in intelligent systems",
            "unit_details": {
                "overview": "Overview Methods from Artificial Intelligence (AI) form the basis for many advanced information systems. These techniques address problems that are difficult to solve or not efficiently solvable with conventional techniques. Building on the undergraduate curriculum this unit introduces the student to advanced AI methods and their applications in information systems.Methods from Artificial Intelligence (AI) form the basis for many advanced information systems. These techniques address problems that are difficult to solve or not efficiently solvable with conventional techniques. Building on the undergraduate curriculum this unit introduces the student to advanced AI methods and their applications in information systems.Read More about Overview",
                "offerings": {},
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite: Completion of the Bachelor of Computer Science or equivalent to the entry requirements for the Honours program. Students must also have enrolment approval from the Honours Coordinator.\nFor students enrolled in E3001, E3002, E3005, E3010, E3011, E3007 completing the Software Engineering specialisation: completion of 144 credit points of study in the Bachelor of Software Engineering (Honours) degree. "
            }
        },
        {
            "code": "FIT5003",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Software security",
            "unit_details": {
                "overview": "Overview This unit aims to introduce the secure software development issues including secure software development life cycle, secure software design principles, secure coding practices, threat evaluation models, secure software testing, deployment and maintenance, software development and security policy integration. Students are provided with a range of practical exercises and tasks to … For more content click the Read More button below.This unit aims to introduce the secure software development issues including secure software development life cycle, secure software design principles, secure coding practices, threat evaluation models, secure software testing, deployment and maintenance, software development and security policy integration. Students are provided with a range of practical exercises and tasks to reinforce their skills including: identification of security bugs in programs written in different programming languages, design, implementation, and testing of secure concurrent and networked applications, identification of vulnerabilities in networked and mobile/wireless applications. In addition, students will learn input validation techniques to minimise security risks, man-in-the-middle attack techniques to be able to build more secure networked applications, practical secure software testing techniques to be able to test applications for security bugs.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "FIT9131",
                        "FIT9133"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ITO5003",
                        "ITI5003"
                    ]
                },
                "rules": "Prerequisites \n\nFor students enrolled in E3001, E3002, E3005, E3010, E3011, E3007: FIT2099.\nFor C6007 students who commenced in 2020: None\n "
            }
        },
        {
            "code": "FIT5032",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Internet applications development",
            "unit_details": {
                "overview": "Overview This unit provides students with the knowledge, understanding and skills required to develop an application system which uses a web interface to a back-end database. The unit assumes a sound basic knowledge of programming and database concepts and skills as developed in the introductory units in these areas. The emphasis … For more content click the Read More button below.\nThe unit will take a strongly practical focus in examining the technology issues involved, and highlight the key issues which a developer needs to address in developing applications of this kind for real-world systems.This unit provides students with the knowledge, understanding and skills required to develop an application system which uses a web interface to a back-end database. The unit assumes a sound basic knowledge of programming and database concepts and skills as developed in the introductory units in these areas. The emphasis in the unit is on mastery of the key concepts and the basic knowledge and skills required to build this kind of application. The unit will provide students with an awareness of the wide range of technologies which are used to support this kind of application, but will examine only a limited number of these technologies to demonstrate the key concepts and their application.\nThe unit will take a strongly practical focus in examining the technology issues involved, and highlight the key issues which a developer needs to address in developing applications of this kind for real-world systems.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "T3-57-OS-CHI-SEU-ON-CAMPUS": {
                        "location": [
                            "Suzhou"
                        ],
                        "teaching_period": "Term 3",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "FIT9131"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ITO5032"
                    ]
                },
                "rules": "Prerequisite:\nFor C6007 students who commended in 2020: None\nFor students enrolled in E3001, E3002,E3005, E3010, E3011, E3007 completing the Software Engineering specialisation: FIT2099 "
            }
        },
        {
            "code": "FIT5037",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Network security",
            "unit_details": {
                "overview": "Overview Network security is an important part of any computer network and essential knowledge for IT professionals. This unit provides fundamental network security for IT students and professionals. It covers wired and wireless communication and network security, security at different layers, computer system security, network services and applications security, basic defence … For more content click the Read More button below.Network security is an important part of any computer network and essential knowledge for IT professionals. This unit provides fundamental network security for IT students and professionals. It covers wired and wireless communication and network security, security at different layers, computer system security, network services and applications security, basic defence systems, cryptography for network security, techniques for identifying system vulnerabilities and penetration testing.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "T3-57-OS-CHI-SEU-ON-CAMPUS": {
                        "location": [
                            "Suzhou"
                        ],
                        "teaching_period": "Term 3",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "FIT9131",
                        "FIT9133",
                        "FIT9136"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ITI5037"
                    ]
                },
                "rules": "Prerequisite:\nFor students enrolled in E3001, E3002,E3005, E3010, E3011, E3007 completing the Software Engineering specialisation: FIT4165\nKnowledge and experience in Networking, Unix system, and basic cryptography. "
            }
        },
        {
            "code": "FIT5042",
            "state": 10,
            "sem": 0,
            "credit points": "6",
            "name": "Enterprise application development for the web",
            "unit_details": {
                "overview": "Overview This unit provides students with an understanding of the design and development of systems that support the large enterprise in a web-based environment. Students will learn of the theoretical issues that need to be considered by the enterprise and how they can affect the development of the enterprise application. A … For more content click the Read More button below.This unit provides students with an understanding of the design and development of systems that support the large enterprise in a web-based environment. Students will learn of the theoretical issues that need to be considered by the enterprise and how they can affect the development of the enterprise application. A number of techniques will be introduced as the technological means to build such an application with specific emphasis on the Java EE technology.Read More about Overview",
                "offerings": {},
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "FIT9131"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite:\nFor C6007 students who commended in 2020: None. \nFor students enrolled in E3001, E3002, E3005, E3010, E3011, E3007 completing the Software Engineering specialisation: FIT2099.  "
            }
        },
        {
            "code": "FIT5046",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Mobile and distributed computing systems",
            "unit_details": {
                "overview": "Overview This unit provides a high level coverage of mobile and distributed computing. It will focus on the underlying concepts and standards of mobile computing. Students will learn techniques to design and develop mobile applications. The unit will also provide students with an understanding of current mobile and distributed technologies such … For more content click the Read More button below.This unit provides a high level coverage of mobile and distributed computing. It will focus on the underlying concepts and standards of mobile computing. Students will learn techniques to design and develop mobile applications. The unit will also provide students with an understanding of current mobile and distributed technologies such as web services, Internet of Things, context-aware computing, location-awareness, wireless sensor networks and current research trends.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-OS-CHI-SEU-ON-CAMPUS": {
                        "location": [
                            "Suzhou"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "FIT9131",
                        "FIT9131"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ITO5046"
                    ]
                },
                "rules": "Prerequisite: For students enrolled in E3001, E3002, E3005, E3010, E3011, E3007 completing the Software Engineering specialisation: FIT2099, FIT3171 and FIT4165. "
            }
        },
        {
            "code": "FIT5124",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Advanced topics in security",
            "unit_details": {
                "overview": "Overview This unit aims to provide students with advanced knowledge of cybersecurity. Advancements in cloud services, mobile computing, and machine learning bring much convenience to our lives, improve our productivity in daily work, and provide us with personalised services. Despite many benefits, these new paradigms incur aggravated security and privacy concerns. … For more content click the Read More button below.This unit aims to provide students with advanced knowledge of cybersecurity. Advancements in cloud services, mobile computing, and machine learning bring much convenience to our lives, improve our productivity in daily work, and provide us with personalised services. Despite many benefits, these new paradigms incur aggravated security and privacy concerns. End-users, enterprises, and governments face growing threats from sophisticated cyber attacks. This unit will study advanced cybersecurity technologies to address those threats in the current practice. Topics include design and implementation of advanced cryptosystems for high-performance applications such as encrypted databases, cryptographic protocols and hardware-assisted approaches for secure computing applications such as privacy-preserving machine learning, and practical post-quantum cryptography that can address the emerging threats of quantum computers. Learning activities will focus on understanding security and privacy issues in cloud and networked systems, encrypted search techniques, cloud storage security, secure multi-party computation techniques, trusted computing, and lattice-based cryptography.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "FIT5163"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ITI5124"
                    ]
                },
                "rules": "Prerequisite: For students enrolled in E3001, E3002, E3005, E3010, E3011, E3007 completing the Software Engineering specialisation: FIT5163 or FIT4165. "
            }
        },
        {
            "code": "FIT5129",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Enterprise IT security - planning, operations and management",
            "unit_details": {
                "overview": "Overview An effective cybersecurity practitioner requires knowledge from multiple disciplines, including computer science, mathematics, psychology, sociology, criminology, law, economics, and engineering. This unit considers the intersection of the technical, psychological, and sociological aspects involved in maintaining security within organisations. The unit will provide students with practical foundations in planning secure networks, … For more content click the Read More button below.An effective cybersecurity practitioner requires knowledge from multiple disciplines, including computer science, mathematics, psychology, sociology, criminology, law, economics, and engineering. This unit considers the intersection of the technical, psychological, and sociological aspects involved in maintaining security within organisations. The unit will provide students with practical foundations in planning secure networks, policy-based operations, and the implementation of security. Students will also be introduced to best practices in dealing with security breaches. Critical reflective and practical skills will be acquired through reflective reading and considering real-world applications.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ITO5129",
                        "ITI5129"
                    ]
                },
                "rules": "Prerequisite: For students enrolled in E3001, E3002, E3005, E3010, E3011, E3007 completing the Software Engineering specialisation: FIT4165. "
            }
        },
        {
            "code": "FIT5133",
            "state": 10,
            "sem": 0,
            "credit points": "6",
            "name": "Enterprise architecture and management",
            "unit_details": {
                "overview": "Overview Covers the core skills for enterprise architects, addressing the structuring and delivery of IT services in organisations. Addresses topics including SaaS, Cloud computing, enterprise 2.0 and other collaborative technologies, services science management and engineering and services strategy.Covers the core skills for enterprise architects, addressing the structuring and delivery of IT services in organisations. Addresses topics including SaaS, Cloud computing, enterprise 2.0 and other collaborative technologies, services science management and engineering and services strategy.",
                "offerings": {},
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "FIT9123"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite: For students enrolled in E3001, E3002, E3005, E3010, E3011, E3007 completing the Software Engineering specialisation: FIT2090. "
            }
        },
        {
            "code": "FIT5137",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Advanced database technology",
            "unit_details": {
                "overview": "Overview This unit examines advanced database technology. This unit particularly covers three main types of advanced database technologies, including (i) document store, (ii) wide column store, and (iii) graph database. These three systems represent the broad spectrum of NoSQL databases. The underlying theoretical foundations, such as database modelling, transactions, and graph … For more content click the Read More button below.This unit examines advanced database technology. This unit particularly covers three main types of advanced database technologies, including (i) document store, (ii) wide column store, and (iii) graph database. These three systems represent the broad spectrum of NoSQL databases. The underlying theoretical foundations, such as database modelling, transactions, and graph query processing will also be explored.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "FIT9132"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisites: \nFor students enrolled in E3001, E3002, E3005, E3010, E3011, E3007 completing the Software Engineering specialisation: FIT3171.\nKnowledge of relational database principles, including SQL.\n  "
            }
        },
        {
            "code": "FIT5140",
            "state": 10,
            "sem": 0,
            "credit points": "6",
            "name": "IoT and mobile applications",
            "unit_details": {
                "overview": "",
                "offerings": {},
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "FIT5145",
            "state": 10,
            "sem": 0,
            "credit points": "6",
            "name": "Introduction to data science",
            "unit_details": {
                "overview": "Overview This unit looks at processes, case studies and simple tools to understand the many facets of working with data, and the significant effort in Data Science over and above the core task of Data Analysis. Working with data as part of a business model and the lifecycle in an organisation … For more content click the Read More button below.This unit looks at processes, case studies and simple tools to understand the many facets of working with data, and the significant effort in Data Science over and above the core task of Data Analysis. Working with data as part of a business model and the lifecycle in an organisation is considered, as well as business processes and case studies. Data and its handling is also introduced: characteristic kinds of data and its collection, data storage and basic kinds of data preparation, data cleaning and data stream processing. Styles of data analysis and outcomes of successful data exploration and analysis are reviewed. Standards, tools and resources are also reviewed. Basic curation and management are reviewed: archival and architectural practice, policy, legal and ethical issues.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "SSB-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Summer semester B",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "FIT9136",
                        "FIT9131",
                        "FIT9133"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ETC5510",
                        "ITI5145",
                        "ITO5145"
                    ]
                },
                "rules": "Prerequisite: For students enrolled in E3001, E3002, E3005, E3010, E3011, E3007 completing the Software Engineering specialisation: FIT2099 "
            }
        },
        {
            "code": "FIT5163",
            "state": 10,
            "sem": 0,
            "credit points": "6",
            "name": "Information and computer security",
            "unit_details": {
                "overview": "Overview The unit aims to provide the students with in depth knowledge of techniques required to deal with security problems in information systems. The main areas of study include symmetric and asymmetric encryption techniques, cryptographic hash functions with related topics of message authentication codes and digital signatures. Study of techniques and … For more content click the Read More button below.The unit aims to provide the students with in depth knowledge of techniques required to deal with security problems in information systems. The main areas of study include symmetric and asymmetric encryption techniques, cryptographic hash functions with related topics of message authentication codes and digital signatures. Study of techniques and algorithms for providing mutual trust include key management and distribution and user authentication to establish trust in the identity of communicating partner are also included. It looks at various management issues, including use and abuse of encryption, distributed systems authentication and integrity management. A range of security applications are used as examples. Students will learn how to apply cryptographic techniques in practice.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "T3-57-OS-CHI-SEU-ON-CAMPUS": {
                        "location": [
                            "Suzhou"
                        ],
                        "teaching_period": "Term 3",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "FIT9137",
                        "FIT9137"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ITO5163",
                        "ITI5163"
                    ]
                },
                "rules": "Prerequisite: For students enrolled in E3001, E3002, E3005, E3010, E3011, E3007 completing the Software Engineering specialisation: FIT4165 Introductory knowledge of computing at the undergraduate level is assumed. "
            }
        },
        {
            "code": "FIT5201",
            "state": 10,
            "sem": 0,
            "credit points": "6",
            "name": "Machine learning",
            "unit_details": {
                "overview": "Overview This unit introduces machine learning and the major kinds of statistical learning models and algorithms used in data analysis. Learning and the different kinds of learning will be covered and their usage will be discussed. The unit presents foundational concepts in machine learning and statistical learning theory, e.g. bias-variance, model … For more content click the Read More button below.This unit introduces machine learning and the major kinds of statistical learning models and algorithms used in data analysis. Learning and the different kinds of learning will be covered and their usage will be discussed. The unit presents foundational concepts in machine learning and statistical learning theory, e.g. bias-variance, model selection, and how model complexity interplays with model's performance on unobserved data. A series of different models and algorithms will be presented and interpreted based on the foundational concepts: linear models for regression and classification (e.g. linear basis function models, logistic regression, Bayesian classifiers, generalised linear models), discriminative and generative models, k-means and latent variable models (e.g. Gaussian mixture model), expectation-maximisation, neural networks and deep learning, and principles in scaling typical supervised and unsupervised learning algorithms to big data using distributed computing.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-OS-CHI-SEU-ON-CAMPUS": {
                        "location": [
                            "Suzhou"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "EPM5027",
                        "MAT9004",
                        "FIT9136",
                        "ETC5252",
                        "ETC5252"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ITO5201",
                        "ITI5201"
                    ]
                },
                "rules": "Prerequisite: For students enrolled in E3001, E3002, E3005, E3010, E3011, E3007 completing the Software Engineering specialisation: FIT2086; for students enrolled in S6001: MTH5530 and MTH5540; For students enrolled in C6005, no specific prerequisites. "
            }
        },
        {
            "code": "FIT5202",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Data processing for big data",
            "unit_details": {
                "overview": "Overview This unit focuses on big data processing, including volume, complexity, and velocity using the latest big data technologies. In big data volume, it covers large volume data processing using parallel technologies. In large dimensionality (or complexity), it covers various data analytics methods for parallel processing. For the velocity, it covers … For more content click the Read More button below.This unit focuses on big data processing, including volume, complexity, and velocity using the latest big data technologies. In big data volume, it covers large volume data processing using parallel technologies. In large dimensionality (or complexity), it covers various data analytics methods for parallel processing. For the velocity, it covers data streaming processing.Read More about Overview",
                "offerings": {
                    "S1-01-MALAYSIA-EVENING": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "Evening"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "SSB-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Summer semester B",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "FIT9131",
                        "FIT9133",
                        "FIT9136",
                        "FIT9136"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ITI5202"
                    ]
                },
                "rules": "Prerequisite:  A working knowledge of Python. "
            }
        },
        {
            "code": "FIT5214",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Blockchain",
            "unit_details": {
                "overview": "Overview Blockchain is regarded as the next revolution of Internet. Applications are not just limited to cryptocurrencies such as Bitcoin, but also extended to different interdisciplinary sectors. This unit is for students to develop basic knowledge of blockchain technology and how they can be used in real-world scenarios such as payment … For more content click the Read More button below.Blockchain is regarded as the next revolution of Internet. Applications are not just limited to cryptocurrencies such as Bitcoin, but also extended to different interdisciplinary sectors. This unit is for students to develop basic knowledge of blockchain technology and how they can be used in real-world scenarios such as payment systems or supply-chain management. Learning activities will focus on understanding different blockchain systems, a broad landscape of supervised and unsupervised learning methods with a focus on the state-of-the-art knowledge for blockchain technologies including consensus, privacy-preserving protocols and smart contract which are rapidly used in different industries.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "FIT5163"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ITO5214"
                    ]
                },
                "rules": "Prerequisite: For students enrolled in E3001, E3002, E3005, E3010, E3011, E3007 completing the Software Engineering specialisation: FIT4165 "
            }
        },
        {
            "code": "FIT5215",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "Deep learning",
            "unit_details": {
                "overview": "Overview Modern machine learning provides core underlying theory and techniques to data science and artificial intelligence. This unit is for students to develop practical knowledge of modern machine learning and deep learning and how they can be used in real-world settings such as image recognition or text clustering via neural embeddings. … For more content click the Read More button below.Modern machine learning provides core underlying theory and techniques to data science and artificial intelligence. This unit is for students to develop practical knowledge of modern machine learning and deep learning and how they can be used in real-world settings such as image recognition or text clustering via neural embeddings. Learning activities will focus on designing machine learning systems, a broad landscape of supervised and unsupervised learning methods with a focus on modern deep learning knowledge for data analytics including deep neural networks, representation learning and embedding methods, and deep models used for time-series data which are rapidly used in science and industry.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "T3-57-OS-CHI-SEU-ON-CAMPUS": {
                        "location": [
                            "Suzhou"
                        ],
                        "teaching_period": "Term 3",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "MAT9004",
                        "EPM5026",
                        "FIT9136",
                        "FIT9133",
                        "FIT9133"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite: For students enrolled in E3001, E3002, E3005, E3010, E3011, E3007 completing the Software Engineering specialisation: FIT2085 "
            }
        },
        {
            "code": "FIT5216",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Modelling discrete optimisation problems",
            "unit_details": {
                "overview": "Overview This unit introduces the fundamentals of modelling for discrete optimisation, focusing on how to rigorously express a discrete optimisation problem in a manner that is can be solved. Topics covered will include decision variables, basic constraints, modelling with sets, modelling with functions, multiple modelling viewpoints, modelling time, common modelling patterns, … For more content click the Read More button below.This unit introduces the fundamentals of modelling for discrete optimisation, focusing on how to rigorously express a discrete optimisation problem in a manner that is can be solved. Topics covered will include decision variables, basic constraints, modelling with sets, modelling with functions, multiple modelling viewpoints, modelling time, common modelling patterns, model translation, and debugging discrete optimisation models. We will examine complex real world problems and see how they can be translated so that they can be solved by modern discrete optimisation technology.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-OS-CHI-SEU-ON-CAMPUS": {
                        "location": [
                            "Suzhou"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "FIT9131",
                        "FIT9133",
                        "FIT9136"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ITO5216"
                    ]
                },
                "rules": "Prerequisite: For students enrolled in E3001, E3002, E3005, E3010, E3011, E3007 completing the Software Engineering specialisation: FIT2099\nPrerequisite: For C6007 students who commended in 2020: None "
            }
        },
        {
            "code": "FIT5217",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Natural language processing",
            "unit_details": {
                "overview": "Overview Natural language processing (NLP) is one of the most important technologies of the information age. Understanding complex language utterances is also a crucial part of artificial intelligence. This unit introduces fundamentals of NLP. It covers techniques for the analysis of words, sentences, and documents as well as applications including information … For more content click the Read More button below.Natural language processing (NLP) is one of the most important technologies of the information age. Understanding complex language utterances is also a crucial part of artificial intelligence. This unit introduces fundamentals of NLP. It covers techniques for the analysis of words, sentences, and documents as well as applications including information extraction, and question answering.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "T3-57-OS-CHI-SEU-ON-CAMPUS": {
                        "location": [
                            "Suzhou"
                        ],
                        "teaching_period": "Term 3",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "FIT5047",
                        "FIT5197",
                        "FIT5201",
                        "FIT5215"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ITO5217"
                    ]
                },
                "rules": "Prerequisite: For students enrolled in E3001, E3002, E3005, E3010, E3011, E3007 completing the Software Engineering specialisation: ENG1005 AND  FIT3080. Prerequisite: Basics of probability and mathematics (discrete & continuous) "
            }
        },
        {
            "code": "FIT5219",
            "state": 10,
            "sem": 0,
            "credit points": "6",
            "name": "Advanced learning and cognitive systems",
            "unit_details": {
                "overview": "",
                "offerings": {},
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "FIT5220",
            "state": 10,
            "sem": 0,
            "credit points": "6",
            "name": "Solving discrete optimisation problems",
            "unit_details": {
                "overview": "",
                "offerings": {},
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "FIT5221",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Intelligent image and video analysis",
            "unit_details": {
                "overview": "Overview This unit will discuss the fundamental and modern concepts in image and video analysis. The students will be introduced to the basics of image processing and low-level vision. The topics related to image formation, operations, features and segmentation will enable students with the understanding for developing vision enabled systems. Concepts … For more content click the Read More button below.This unit will discuss the fundamental and modern concepts in image and video analysis. The students will be introduced to the basics of image processing and low-level vision. The topics related to image formation, operations, features and segmentation will enable students with the understanding for developing vision enabled systems. Concepts related to convolutional neural networks (CNN) will be introduced and recent examples will be thoroughly analysed. Recent computer vision concepts will be discussed from a deep learning perspective. The unit will be balance between the theoretical and the practical implementation aspects of computer vision.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "T3-57-OS-CHI-SEU-ON-CAMPUS": {
                        "location": [
                            "Suzhou"
                        ],
                        "teaching_period": "Term 3",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "FIT5215",
                        "FIT5047",
                        "FIT5197",
                        "FIT5201"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ITO5221"
                    ]
                },
                "rules": "Prerequisite knowledge: Knowledge of data structures, programming in Python/Matlab and linear algebra Prerequisite: For students enrolled in E3001, E3002, E3005, E3010, E3011, E3007 completing the Software Engineering specialisation: FIT2004 AND FIT2086. "
            }
        },
        {
            "code": "FIT5222",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Planning and automated reasoning",
            "unit_details": {
                "overview": "Overview This unit focuses on the foundations of automated planning and reasoning and their real-world applications. Autonomous agents are active agents that independently execute actions to achieve a certain goal or goals. These agents perceive their environment and reason and plan in order to effect their environment and achieve their goals. … For more content click the Read More button below.This unit focuses on the foundations of automated planning and reasoning and their real-world applications. Autonomous agents are active agents that independently execute actions to achieve a certain goal or goals. These agents perceive their environment and reason and plan in order to effect their environment and achieve their goals. This is a very popular and highly researched AI approach and has many significant implications beyond the traditional area of AI (optimisation, robotics, scheduling, etc?). This course will give students the foundations to develop and design their own autonomous agents.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "T3-57-OS-CHI-SEU-ON-CAMPUS": {
                        "location": [
                            "Suzhou"
                        ],
                        "teaching_period": "Term 3",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "FIT5047",
                        "FIT5197"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite: For students enrolled in E3001, E3002, E3005, E3010, E3011, E3007 completing the Software Engineering specialisation: FIT3080. "
            }
        },
        {
            "code": "FIT5223",
            "state": 10,
            "sem": 2,
            "credit points": "6",
            "name": "IT forensics",
            "unit_details": {
                "overview": "Overview This unit provides a broad coverage of (digital) IT forensics. You will examine definitions of evidence as they apply to investigations involving the seizure and examination of information technology devices. The unit will introduce you to various tools, techniques and algorithms that may be employed by investigators for acquisition, preservation, … For more content click the Read More button below.This unit provides a broad coverage of (digital) IT forensics. You will examine definitions of evidence as they apply to investigations involving the seizure and examination of information technology devices. The unit will introduce you to various tools, techniques and algorithms that may be employed by investigators for acquisition, preservation, and analysis of evidence. Disk-based (local) and network (remote) forensic environments will be explored. You will also learn of the impediments and complicating factors that can threaten forensic investigations.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite: For students enrolled in E3001, E3002, E3005, E3010, E3011, E3007 completing the Software Engineering specialisation: FIT4165. "
            }
        },
        {
            "code": "FIT5224",
            "state": 10,
            "sem": 0,
            "credit points": "6",
            "name": "Smart contracts",
            "unit_details": {
                "overview": "",
                "offerings": {},
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "FIT5225",
            "state": 10,
            "sem": 1,
            "credit points": "6",
            "name": "Cloud computing and security",
            "unit_details": {
                "overview": "Overview Cloud computing has emerged as a backend solution for many modern IT applications. It offers on-demand resources and subscription-based services in a pay-as-you-go model to individual and corporate end-users. Cloud computing facilitates setup, implementation, maintenance, and management of the integrated computation and storage services. This unit will enable students to … For more content click the Read More button below.Cloud computing has emerged as a backend solution for many modern IT applications. It offers on-demand resources and subscription-based services in a pay-as-you-go model to individual and corporate end-users. Cloud computing facilitates setup, implementation, maintenance, and management of the integrated computation and storage services. This unit will enable students to develop a basic knowledge of cloud computing technology and design and implement cloud applications using cloud services. It also introduces the security and privacy issues of the off-the-shelf cloud services. Learning activities will focus on understanding cloud delivery and service models, identifying various cloud platforms, and fundamental cloud technologies such as virtualisation, containers, serverless, web services and their security challenges.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-OS-CHI-SEU-ON-CAMPUS": {
                        "location": [
                            "Suzhou"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "FIT9131",
                        "FIT9133",
                        "FIT9136",
                        "FIT9137"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ITO5225"
                    ]
                },
                "rules": "Prerequisite: For students enrolled in E3001, E3002, E3005, E3010, E3011, E3007 completing the Software Engineering specialisation: FIT4165 AND FIT2099. "
            }
        },
        {
            "code": "BMS1021",
            "state": 3,
            "sem": 1,
            "credit points": "6",
            "name": "Cells, tissues and organisms",
            "units": {
                "overview": "Overview This unit introduces the student to the fundamental units of life (the cells) and explores how cells come together to form primary tissues which subsequently combine to form the organ systems and ultimately the living organism.\nCellular structure and metabolism is studied including the chemical constituents of living cells and … For more content click the Read More button below.\nThe unit also introduces students to the microbial world and explores the structure and function of the immune system and how the body develops an immune response.This unit introduces the student to the fundamental units of life (the cells) and explores how cells come together to form primary tissues which subsequently combine to form the organ systems and ultimately the living organism.\nCellular structure and metabolism is studied including the chemical constituents of living cells and the biological reactions that take place in them. Basic developmental biology concepts associated with the patterning of the body plan and embryological origins of cells and tissues are introduced.\nThe unit also introduces students to the microbial world and explores the structure and function of the immune system and how the body develops an immune response.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [
                        "BIO1011",
                        "BIO1022"
                    ],
                    "AND": []
                },
                "rules": "Corequisite: Must be enrolled in one of the following:\n\nBachelor of Biomedical Science (including double degree programs)\nBachelor of Biomedical Science (Scholar Program)\nBachelor of Engineering (honours) (including double degree programs)\n "
            },
            "minor": []
        },
        {
            "code": "CHE1010",
            "state": 3,
            "Sem": 2,
            "credit points": "6",
            "name": "Grand challenges in chemical engineering: Delivering sustainable food, water and energy",
            "units": {
                "overview": "Overview Providing food, water and energy to the world's people in an environmentally sustainable manner is an engineering grand challenge that must be solved in a concerted manner. New scientific discovery and engineering processes are urgently needed, and chemical engineering must provide key solutions in all three areas. This unit will … For more content click the Read More button below.\nThe basic principles of the discipline will be introduced, including heat and material transfer, thermodynamics, fluid dynamics, (bio)chemical reactions engineering and process design/control. Chemical engineering concepts will be developed within workshops and practicals complemented with practical laboratory experience. There will also be an opportunity for activities where, within teams, you will design chemical engineering solutions to important issues or opportunities.\nThis unit is aimed at all engineering students and may be of special interest to those attracted to environmental engineering, biological engineering, civil engineering (water specialisation) and chemical engineering.Providing food, water and energy to the world's people in an environmentally sustainable manner is an engineering grand challenge that must be solved in a concerted manner. New scientific discovery and engineering processes are urgently needed, and chemical engineering must provide key solutions in all three areas. This unit will explore the core concepts and applications of sustainable chemical engineering through interesting case studies drawn from food, water and energy engineering presented by a mix of academic specialists and industry representatives in each area.\nThe basic principles of the discipline will be introduced, including heat and material transfer, thermodynamics, fluid dynamics, (bio)chemical reactions engineering and process design/control. Chemical engineering concepts will be developed within workshops and practicals complemented with practical laboratory experience. There will also be an opportunity for activities where, within teams, you will design chemical engineering solutions to important issues or opportunities.\nThis unit is aimed at all engineering students and may be of special interest to those attracted to environmental engineering, biological engineering, civil engineering (water specialisation) and chemical engineering.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITES:\nAustralian VCE Mathematical methods (Units 3 & 4) or VCE Specialist mathematics (Units 3 & 4) or equivalent.\nCO-REQUISITE: \nYou must be enrolled in the Bachelor of Engineering (Honours) or an engineering double degree or with permission from the Faculty of Engineering. "
            },
            "minor": []
        },
        {
            "code": "CHM1011",
            "state": 3,
            "Sem": 1,
            "credit points": "6",
            "name": "Chemistry 1",
            "units": {
                "overview": "Overview This unit has been designed such that some previous understanding of chemistry is beneficial, but the unit is underpinned by a support structure for those who are relatively new to the subject. On completion of this unit, you will have gained an understanding of the main chemical principles underpining chemical … For more content click the Read More button below.This unit has been designed such that some previous understanding of chemistry is beneficial, but the unit is underpinned by a support structure for those who are relatively new to the subject. On completion of this unit, you will have gained an understanding of the main chemical principles underpining chemical element, chemical reactivity and equilibria.  A number of important topics including atomic structure, bonding and reaction stoichiometry will be introduced to prepare you for a deeper exploration of chemistry. The concepts developed within the workshops and tutorials are complemented through a laboratory program where you will have the opportunity to use a variety of analytical techniques and design your own experiments to solve a range of chemical problems.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PROHIBITION: CHM1051 "
            },
            "minor": []
        },
        {
            "code": "CHM1051",
            "state": 3,
            "Sem": 1,
            "credit points": "6",
            "name": "Chemistry 1 advanced",
            "units": {
                "overview": "Overview This unit has been designed for students who have demonstrated a strong aptitude for chemistry during secondary studies. On completion of this unit, you will be able to apply their understanding of the main chemical principles underpinning chemical elements, chemical reactivity and equilibria. A number of important topics including atomic … For more content click the Read More button below.This unit has been designed for students who have demonstrated a strong aptitude for chemistry during secondary studies. On completion of this unit, you will be able to apply their understanding of the main chemical principles underpinning chemical elements, chemical reactivity and equilibria. A number of important topics including atomic structure, bonding and reaction stoichiometry will be developed to prepare students for a deeper exploration of chemistry. The concepts developed within the workshops are complemented through an extended laboratory program where you will have the opportunity to use a variety of analytical techniques and design your own experiments to solve a range of chemical problems.Read More about Overview",
                "offerings": {
                    "OCT-MY-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "October intake teaching period, Malaysia campus",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITE: VCE Units 3 and 4 Chemistry (raw study score >=37) Or ATAR >=90 PROHIBITION: CHM1011, CHM1031 "
            },
            "minor": []
        },
        {
            "code": "ENE1621",
            "state": 3,
            "Sem": 1,
            "credit points": "6",
            "name": "Environmental engineering",
            "units": {
                "overview": "Overview Introduce concepts of sustainable development, the demands of population and economic growth, industrialisation and urbanisation, energy demand and usage, and human environmental disturbance. Two environmental case studies will be covered in detail, designed to illustrate by way of example many of the considerations that underpin many environmental issues/conflicts/ethics. These are … For more content click the Read More button below.Introduce concepts of sustainable development, the demands of population and economic growth, industrialisation and urbanisation, energy demand and usage, and human environmental disturbance. Two environmental case studies will be covered in detail, designed to illustrate by way of example many of the considerations that underpin many environmental issues/conflicts/ethics. These are climate change and sustainable cities. The multi-disciplinary nature of environmental problems is emphasised together with the need to understand and communicate with other professional and community groups.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            },
            "minor": []
        },
        {
            "code": "ENG1021",
            "state": 3,
            "Sem": 2,
            "credit points": "6",
            "name": "Spatial communication in engineering",
            "units": {
                "overview": "Overview This unit introduces the fundamentals of spatial communication in engineering. This project-oriented unit includes an introduction to engineering drawing, spatial measurement, and spatial visualisation. You will work with various spatial visualisation tools. Starting from hand sketching, you will learn how to produce engineering drawings, collect spatial data, and develop spatial … For more content click the Read More button below.This unit introduces the fundamentals of spatial communication in engineering. This project-oriented unit includes an introduction to engineering drawing, spatial measurement, and spatial visualisation. You will work with various spatial visualisation tools. Starting from hand sketching, you will learn how to produce engineering drawings, collect spatial data, and develop spatial visualisations.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            },
            "minor": []
        },
        {
            "code": "ENG1051",
            "state": 3,
            "Sem": 1,
            "credit points": "6",
            "name": "Materials for energy and sustainability",
            "units": {
                "overview": "Overview The key engineering challenge in the 21st century and beyond is the efficient use of energy and the Earth's resources. Energy supply drives our daily life, and there exist challenges in all of clean energy, renewable energy, energy transmission, energy storage, light materials, and energy-efficient manufacturing. In addition, the physical … For more content click the Read More button below.\nIn this unit, the fundamentals of the structure, design, and application of materials are covered. Attributes such as modulus, strength, toughness, chemical stability, electrical, magnetic, and thermal properties are explained in terms of atomic bonding, crystal defects and polycrystalline microstructure - and how this relates to end users.\nA particular focus will be given to \"processing-structure-property\" relationships, which is at the core of Materials Engineering, with the subjects' concepts elaborated in the context of materials for the efficient use of energy and other resources. Examples will include aerospace materials and functional materials, amongst others.The key engineering challenge in the 21st century and beyond is the efficient use of energy and the Earth's resources. Energy supply drives our daily life, and there exist challenges in all of clean energy, renewable energy, energy transmission, energy storage, light materials, and energy-efficient manufacturing. In addition, the physical infrastructure on which our daily lives depend requires the sustainable use of the finite resources at our disposal. All of these issues are Materials Engineering issues.\nIn this unit, the fundamentals of the structure, design, and application of materials are covered. Attributes such as modulus, strength, toughness, chemical stability, electrical, magnetic, and thermal properties are explained in terms of atomic bonding, crystal defects and polycrystalline microstructure - and how this relates to end users.\nA particular focus will be given to \"processing-structure-property\" relationships, which is at the core of Materials Engineering, with the subjects' concepts elaborated in the context of materials for the efficient use of energy and other resources. Examples will include aerospace materials and functional materials, amongst others.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITES:\nAustralian VCE Mathematical methods (Units 3 & 4) or VCE Specialist mathematics (Units 3 & 4) or equivalent\nAND \nAustralian VCE Chemistry (Units 3 & 4) or Australian VCE Physics (Units 3 & 4) or equivalent "
            },
            "minor": []
        },
        {
            "code": "FIT1056",
            "state": 3,
            "Sem": 2,
            "credit points": "6",
            "name": "Collaborative engineering for web applications",
            "units": {
                "overview": "Overview Some might describe engineering through a purely mathematical lens; however, it necessarily includes a liberal application of domain specific knowledge (engineering fields) and technology (hardware and software) to solve problems, especially at scale. Large-scale software projects are a critical part of all engineering fields in industry. Perhaps a chemical engineering … For more content click the Read More button below.Some might describe engineering through a purely mathematical lens; however, it necessarily includes a liberal application of domain specific knowledge (engineering fields) and technology (hardware and software) to solve problems, especially at scale. Large-scale software projects are a critical part of all engineering fields in industry. Perhaps a chemical engineering firm might need a system to simulate biochemical reactions to find better ways for producing green hydrogen. Or a civil engineering firm might need to identify the relationship between changes to playground designs and their impact on safety. Through this unit, you will work on a large-scale software project (web application) in remote teams working independently and collaboratively. The project will give you an appreciation of how large software projects can be decomposed into smaller segments, built and integrated into individual systems. You also gain an understanding of the abilities and limitations of such systems (within the context of web development) and learn methodological processes that support this. You will develop programming skills for web development (HTML, CSS and Javascript). Some prior programming knowledge would be advantageous, but not required.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ENG1003"
                    ]
                },
                "rules": null
            },
            "minor": []
        },
        {
            "code": "MAT1830",
            "state": 3,
            "Sem": 1,
            "credit points": "6",
            "name": "Discrete mathematics for computer science",
            "units": {
                "overview": "Overview This unit introduces fundamental discrete mathematics topics including combinatorics, sets, relations and functions; methods of logic and proof, especially proof by induction; probability theory, Bayes' theorem; recursion; recurrence relations; trees and other graphs. It establishes the mathematical basis required for studies in Computer Science and Software Engineering.This unit introduces fundamental discrete mathematics topics including combinatorics, sets, relations and functions; methods of logic and proof, especially proof by induction; probability theory, Bayes' theorem; recursion; recurrence relations; trees and other graphs. It establishes the mathematical basis required for studies in Computer Science and Software Engineering.Read More about Overview",
                "offerings": {
                    "OCT-MY-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "October intake teaching period, Malaysia campus",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ITI9004"
                    ]
                },
                "rules": "Prerequisite: VCE Specialist Mathematics or Mathematical Methods units 3 and 4 with a raw study score of at least 25 or Further maths with a raw study score of at least 35. Prohibition: MAT1077, MTH1112 "
            },
            "minor": []
        },
        {
            "code": "PHS1002",
            "state": 3,
            "Sem": 2,
            "credit points": "6",
            "name": "Physics for engineering",
            "units": {
                "overview": "Overview This unit relates key principles of physics to engineering and technology, and shows how physics, including quantum and nano-science, creates useful new technologies. In the Newtonian mechanics topics you will explore the traditional concepts of dynamics, such as energy, momentum and angular momentum, and explore their connections and applications to … For more content click the Read More button below.This unit relates key principles of physics to engineering and technology, and shows how physics, including quantum and nano-science, creates useful new technologies. In the Newtonian mechanics topics you will explore the traditional concepts of dynamics, such as energy, momentum and angular momentum, and explore their connections and applications to a variety of systems, including rocket propulsion, precession and planetary orbits. Within the Electromagnetism topics you will learn about electric and magnetic fields and their effects, as well as explore techniques for determining these fields and understanding their nature as light. In the Quantum physics topic you will explore modern physics concepts such as the uncertainty principle, the probabilistic interpretation of wave functions and atomic models and stimulated emission and explore their connection to technologies like the atomic force microscope and lasers. During the activities for the practical component you will develop measurement, analysis, and communication skills.Read More about Overview",
                "offerings": {
                    "OCT-MY-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "October intake teaching period, Malaysia campus",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "COREQUISITE: Recommend MTH1030 or ENG1005.Note: supporting mathematics studies are required for progression towards the Astrophysics and Physics majors. PREREQUISITE: PHS1001 or PHS1080 or PHS1031 or BMS1031 or VCE Physics (raw study score 25 or above), and ENG1090 or MTH1010 or VCE Mathematical Methods (raw study score 25 or above). PROHIBITION: PHS1011, PHS1022, ENG1081 "
            },
            "minor": []
        },
        {
            "code": "RSE1010",
            "state": 3,
            "Sem": 2,
            "credit points": "6",
            "name": "Natural resources engineering",
            "units": {
                "overview": "Overview This unit provides basic fundamental and practical aspects of resources engineering and introduces the activities which are involved in a resources engineering project. Resources engineers improve and maintain the sustainability of the earth's resources through efficient design and application of technology. The unit highlights the key concepts associated with the … For more content click the Read More button below.\nThe unit includes optional field trips, one during the mid-session break and another one towards the end of the semester so that students can observe the practical aspects of resources engineering and better understand the works that are involved in a resources operation. The field trips include both renewable energy and mining operations These are important as resources engineering is a practice-oriented field in which both fundamentals and practice must be used in an integrated manner for successful outcomes.This unit provides basic fundamental and practical aspects of resources engineering and introduces the activities which are involved in a resources engineering project. Resources engineers improve and maintain the sustainability of the earth's resources through efficient design and application of technology. The unit highlights the key concepts associated with the resources industry through two modules, including mining and renewable energy, and demonstrates the strong link between the mining and renewable energy sectors.\nThe unit includes optional field trips, one during the mid-session break and another one towards the end of the semester so that students can observe the practical aspects of resources engineering and better understand the works that are involved in a resources operation. The field trips include both renewable energy and mining operations These are important as resources engineering is a practice-oriented field in which both fundamentals and practice must be used in an integrated manner for successful outcomes.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            },
            "minor": []
        },
        {
            "code": "ECE2072",
            "credit points": "6",
            "state": 3,
            "Sem": 2,
            "name": "Digital systems",
            "units": {
                "overview": "Overview This unit introduces you to modern logic design techniques, hardware used and common representations. Topics include two and multi-level combinational logic, decoders, multiplexers, arithmetic circuits, programmable and steering logic, flip-flops, registers, counters, RAM and ROM. Using this hardware the design component will include finite state machine design and applications to … For more content click the Read More button below.This unit introduces you to modern logic design techniques, hardware used and common representations. Topics include two and multi-level combinational logic, decoders, multiplexers, arithmetic circuits, programmable and steering logic, flip-flops, registers, counters, RAM and ROM. Using this hardware the design component will include finite state machine design and applications to computer data path control. This will incorporate simple analogue and digital I/O interfacing. Programmable logic devices will be covered, and the use of a hardware description language for describing, synthesising and testing digital logic. Laboratories cover logic design, implementation, and testing.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite: 24 credit points from the Faculty of Engineering or the Faculty of Information Technology\nE6011 Master of Professional Engineering - You are exempt from the prerequisite rule if you are enrolled in this course. "
            },
            "minor": []
        },
        {
            "code": "FIT2085",
            "state": 3,
            "Sem": 0,
            "credit points": "6",
            "name": "Introduction to computer science for engineers",
            "units": {
                "overview": "Overview This unit introduces students to core problem-solving, analytical skills, and methodologies useful for developing flexible, robust, and maintainable software. In doing this, it covers a range of conceptual levels, from fundamental algorithms and data structures, down to their efficient implementation as well as complexity. Topics include data types, data structures, … For more content click the Read More button below.This unit introduces students to core problem-solving, analytical skills, and methodologies useful for developing flexible, robust, and maintainable software. In doing this, it covers a range of conceptual levels, from fundamental algorithms and data structures, down to their efficient implementation as well as complexity. Topics include data types, data structures, algorithms, algorithmic complexity, recursion, and their practical applications.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1003",
                        "ENG1013",
                        "ENG1014"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "FIT1008",
                        "FIT1054"
                    ]
                },
                "rules": null
            },
            "minor": []
        },
        {
            "code": "MAE2505",
            "state": 3,
            "Sem": 2,
            "credit points": "6",
            "name": "Aerospace dynamics",
            "units": {
                "overview": "Overview This unit develops your physical and analytical understanding of concepts of time, space, coordinate systems, particles, rigid bodies, forces, work, energy, mechanical vibration and Newton's Laws of Motion, translating into the ability to formulate and analyse the motion of spacecraft and aircraft under the influence of forces such as lift, … For more content click the Read More button below.This unit develops your physical and analytical understanding of concepts of time, space, coordinate systems, particles, rigid bodies, forces, work, energy, mechanical vibration and Newton's Laws of Motion, translating into the ability to formulate and analyse the motion of spacecraft and aircraft under the influence of forces such as lift, drag, thrust and gravity. You will be taught the fundamentals of kinematics and kinetics of rigid bodies and systems of particles and to carry out dynamic analysis of satellites and orbital spacecraft and aircraft. You will be introduced to properties of the Earth's atmosphere, the forces acting on aircraft and their impact on aircraft performance, resulting in the development of equations for steady level flight, steady climbing and descending flight. This unit is core to understanding the control and manoeuvring of spacecraft and aircraft.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1011",
                        "ENG1001"
                    ],
                    "AND": [
                        "ENG1005",
                        "ENG1005"
                    ]
                },
                "prohibition": {
                    "OR": [
                        "MEC2401",
                        "MAE2406"
                    ],
                    "AND": []
                },
                "rules": null
            },
            "minor": []
        },
        {
            "code": "MEC2404",
            "state": 3,
            "Sem": 2,
            "credit points": "6",
            "name": "Mechanics of fluids",
            "units": {
                "overview": "Overview This unit develops your physical understanding of fluid statics and fluid flow and the interaction of fluid forces with solids.\nTopics include hydrostatics, Reynolds transport theorem, continuity and momentum equations, control volume analysis, the Bernoulli equation, viscous pipe flow, pumps, dimensional analysis, boundary layers, flow measurement techniques and applications of … For more content click the Read More button below.This unit develops your physical understanding of fluid statics and fluid flow and the interaction of fluid forces with solids.\nTopics include hydrostatics, Reynolds transport theorem, continuity and momentum equations, control volume analysis, the Bernoulli equation, viscous pipe flow, pumps, dimensional analysis, boundary layers, flow measurement techniques and applications of fluid forces in flow - lift and drag.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [
                        "MAE2404",
                        "CHE2161"
                    ],
                    "AND": []
                },
                "rules": "Prerequisite: 24 credit points "
            },
            "minor": []
        },
        {
            "code": "CIV4100",
            "state":11,
            "sem":1,
            "credit points": "6",
            "name": "Autonomous vehicle systems",
            "unit_details": {
                "overview": "Overview This unit will introduce students to autonomous systems in general, autonomous vehicle (AV) system in particular, and its development. The unit will provide the fundamental system engineering knowledge of autonomous vehicle systems including the main building blocks, their design, integration and coordination to achieve the ultimate outcome of self-driving in … For more content click the Read More button below.This unit will introduce students to autonomous systems in general, autonomous vehicle (AV) system in particular, and its development. The unit will provide the fundamental system engineering knowledge of autonomous vehicle systems including the main building blocks, their design, integration and coordination to achieve the ultimate outcome of self-driving in a complex and uncertain environment. It will also cover and facilitate the learning in the further development of such systems through working and interacting with the actual autonomous vehicle and its testing and validation processes.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1014",
                        "ENG1060"
                    ],
                    "AND": [
                        "ENG2005",
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "ADDITIONAL PREREQUISITE: 96 cp of engineering study (including ENG1060, ENG2005) "
            }
          },
          {
            "code": "ECE4076",
            "state":11,
            "sem":1,
            "credit points": "6",
            "name": "Computer vision",
            "unit_details": {
                "overview": "Overview This unit aims to develop an understanding of methods for extracting useful information (eg 3-D structure; object size, motion, shape, location and identity, etc) from images. It will allow you to understand how to construct computer vision systems for robotics, surveillance, medical imaging, and related application areas.This unit aims to develop an understanding of methods for extracting useful information (eg 3-D structure; object size, motion, shape, location and identity, etc) from images. It will allow you to understand how to construct computer vision systems for robotics, surveillance, medical imaging, and related application areas.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ECE2071"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "ECE4078",
            "state":11,
            "sem":2,
            "credit points": "6",
            "name": "Intelligent robotics",
            "unit_details": {
                "overview": "Overview Intelligent robotics concerns the melding of artificial perception, strategic reasoning and robotic action in potentially unstructured and time-varying environments to fulfil useful physical tasks, whether in industry or for security, healthcare, search and rescue or civil defence etc. This unit covers topics underpinning the above requirements, including sensors, sensor fusion, … For more content click the Read More button below.Intelligent robotics concerns the melding of artificial perception, strategic reasoning and robotic action in potentially unstructured and time-varying environments to fulfil useful physical tasks, whether in industry or for security, healthcare, search and rescue or civil defence etc. This unit covers topics underpinning the above requirements, including sensors, sensor fusion, machine perception, environmental mapping/monitoring, path planning, localisation, mechanisms, artificial intelligence methodologies and application domains.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ECE2071"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ECE5178"
                    ]
                },
                "rules": "PREREQUISITES: Or FIT1002 or TRC2400 or (FIT1029 and FIT1040)\nIf you are currently enrolled in E6013 Master of Applied Engineering, you are exempt from the prerequisite requirement. "
            }
          },
          {
            "code": "ECE4179",
            "state":11,
            "sem":1,
            "credit points": "6",
            "name": "Neural networks and deep learning",
            "unit_details": {
                "overview": "Overview This unit introduces fundamentals of deep learning and how it can solve problems in many areas, such as image classification, filter design and natural language processing. Neural networks are first described and how training can be achieved with backpropagation. Various forms of deep neural networks are developed, such as multilayer … For more content click the Read More button below.This unit introduces fundamentals of deep learning and how it can solve problems in many areas, such as image classification, filter design and natural language processing. Neural networks are first described and how training can be achieved with backpropagation. Various forms of deep neural networks are developed, such as multilayer perceptrons, convolution neural networks and recurrent neural networks. The mathematics of stochastic optimisation is used to interpret and understand the behaviour and training of these networks. Programming approaches are discussed for training and deploying neural networks. Deep learning technologies and design examples are discussed in areas such as driverless cars, personal cognitive assistants and mastering of games such as GO.Read More about Overview",
                "offerings": {
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005",
                        "ECE2071"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisites: Or ENG2092 in place of ENG2005 "
            }
          },
          
          {
            "code": "ECE2071",
            "state":11,
            "sem":1,
            "credit points": "6",
            "name": "Computer organisation and programming",
            "unit_details": {
                "overview": "Overview This unit provides an introduction to computers and CPU organisation, assemblers and compilers, and algorithm design for engineering problems and embedded computer systems. It covers the language C and its implementation on a typical computer, including standard data types, arrays, control statements, functions, including ways of parameter passing, C library … For more content click the Read More button below.This unit provides an introduction to computers and CPU organisation, assemblers and compilers, and algorithm design for engineering problems and embedded computer systems. It covers the language C and its implementation on a typical computer, including standard data types, arrays, control statements, functions, including ways of parameter passing, C library functions, pointers, strings, arrays of pointers, structures, linked lists and binary tree data structures, dynamic memory allocations, and calls to assembly language programs. Object-oriented programming is introduced. Software engineering is covered as the methodology of software development and lifecycle models. Operating system concepts are introduced. The unit also includes an introduction to programmable logic controllers (PLCs).Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG1003",
                        "ENG1013",
                        "ENG1014"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "ECE3093",
            "state":13,
            "sem":1,
            "credit points": "6",
            "name": "Optimisation estimation and numerical methods",
            "unit_details": {
                "overview": "Overview This unit will introduce you to time series analysis, matrix decomposition methods and optimisation in three equal parts. Time series will introduce the concepts of stochastic processes, wide-sense stationarity, autocovariance functions and spectral density. This will lead to the analysis of ARMA (p,g) processes using MATLAB. Matrix decomposition includes singular … For more content click the Read More button below.This unit will introduce you to time series analysis, matrix decomposition methods and optimisation in three equal parts. Time series will introduce the concepts of stochastic processes, wide-sense stationarity, autocovariance functions and spectral density. This will lead to the analysis of ARMA (p,g) processes using MATLAB. Matrix decomposition includes singular value decomposition with applications including data compression, image processing, noise filtering and finding exact and approximate solutions of linear systems. Numerical methods for working efficiently with large matrices and handling ill-conditioned data will be discussed. Methods for unconstrained and constrained optimisation will be presented, with the use of MATLAB.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "FIT3179",
            "state":13,
            "sem":2,
            "credit points": "6",
            "name": "Data visualisation",
            "unit_details": {
                "overview": "Overview Data visualisation is a powerful technique that allows us to use our visual system to understand data. Interactive data visualisation is now common in business, engineering and design and the social and physical sciences. This unit introduces the main kinds of information graphics and interactive visualisation systems and their areas … For more content click the Read More button below.Data visualisation is a powerful technique that allows us to use our visual system to understand data. Interactive data visualisation is now common in business, engineering and design and the social and physical sciences. This unit introduces the main kinds of information graphics and interactive visualisation systems and their areas of application. It investigates the reasons why visualisation can be effective and based on this students will gain experience in critically assessing data visualisations and in designing their own visualisations. You will learn how to create visualisations with representative computer tools and gain experience in creating a data visualisation for an application domain of their choice.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite: Completion of 24 points at first year. "
            }
          },
          {
            "code": "MEC4447",
            "state":13,
            "sem":1,
            "credit points": "6",
            "name": "Computers in fluids and energy",
            "unit_details": {
                "overview": "Overview Computational Fluid Dynamics (CFD) is a well-established analysis, design and optimisation approach for industrial fluid and heat transfer problems. Examples include turbomachinery, vehicle aerodynamics and aeronautics. It is also a powerful research tool and is being increasingly used to answer fundamental questions in a wide range of fields, from astrophysics … For more content click the Read More button below.Computational Fluid Dynamics (CFD) is a well-established analysis, design and optimisation approach for industrial fluid and heat transfer problems. Examples include turbomachinery, vehicle aerodynamics and aeronautics. It is also a powerful research tool and is being increasingly used to answer fundamental questions in a wide range of fields, from astrophysics to nanomaterials. This Unit provides an introduction to this mathematically sophisticated discipline. This involves a review of the equations governing motion and energy of fluids, the mathematical properties of these equations and the relevance of such properties to obtaining numerical solutions. The basics of numerical discretization and solution methods will be discussed. The Unit will also introduce you to using commercial CFD packages in analysing complex industrial problems involving fluids.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ECE3093",
                        "MAE3456",
                        "MEC3456",
                        "MEC3456"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "MTE4590",
            "state":13,
            "sem":2,
            "credit points": "6",
            "name": "Modelling of materials",
            "unit_details": {
                "overview": "Overview An introduction to the computational/modelling approaches currently available in materials science and engineering is provided. The reasons for using modelling approaches are discussed and the different types of models available are outlined. For each of the length scales important in understanding material behaviour (nano-, micro-, meso- and macro-), the available … For more content click the Read More button below.An introduction to the computational/modelling approaches currently available in materials science and engineering is provided. The reasons for using modelling approaches are discussed and the different types of models available are outlined. For each of the length scales important in understanding material behaviour (nano-, micro-, meso- and macro-), the available modelling techniques are outlined and their principles, methods of implementation, advantages, disadvantages and perceived future developments are discussed. Examples of modelling approaches will be selected from all classes of materials. The general methodology used for constructing models is emphasised.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005",
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "BEX3311",
            "state":14,
            "sem":1,
            "credit points": "6",
            "name": "Entrepreneurial mindsets and capabilities",
            "unit_details": {
                "overview": "Overview Entrepreneurship and innovation are driven by our ability to interrogate the world around us and think critically to identify challenges and opportunities worth exploring. The ability to make sense of, and create insight from a problem space or context, powers creative and innovative solutions. Furthermore, the ability to systematically employ … For more content click the Read More button below.\nThis unit provides you with an overall understanding of entrepreneurship and innovation, with a deep dive into cutting edge industry-informed and designed ways of working and hands-on experience in problem exploration. We use design-driven and innovation-focused research, analysis and synthesis tools and techniques to help you tackle a challenge space of your choosing. The unit takes you through human-centred approaches and requires the generation of novel concepts, solutions and tangible concepts to validate with target customers and/or end-users, culminating in an Industry Showcase.\nWhether you want to establish a start-up, work in corporate innovation, or just have a really great toolkit to help you do any job better, this unit will give you the right foundations.Entrepreneurship and innovation are driven by our ability to interrogate the world around us and think critically to identify challenges and opportunities worth exploring. The ability to make sense of, and create insight from a problem space or context, powers creative and innovative solutions. Furthermore, the ability to systematically employ creative thinking and to develop prototypes and approaches to validate hypotheses are crucial skills for entrepreneurs and innovators.\nThis unit provides you with an overall understanding of entrepreneurship and innovation, with a deep dive into cutting edge industry-informed and designed ways of working and hands-on experience in problem exploration. We use design-driven and innovation-focused research, analysis and synthesis tools and techniques to help you tackle a challenge space of your choosing. The unit takes you through human-centred approaches and requires the generation of novel concepts, solutions and tangible concepts to validate with target customers and/or end-users, culminating in an Industry Showcase.\nWhether you want to establish a start-up, work in corporate innovation, or just have a really great toolkit to help you do any job better, this unit will give you the right foundations.Read More about Overview",
                "offerings": {
                    "S1-01-CAULFIELD-ON-CAMPUS": {
                        "location": [
                            "Caulfield"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-CAULFIELD-ONLINE": {
                        "location": [
                            "Caulfield"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "Online"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "You must have completed 72 credit points of study to undertake this unit. "
            }
          },
          {
            "code": "BEX3411",
            "state":14,
            "sem":2,
            "credit points": "6",
            "name": "Building start-ups with impact",
            "unit_details": {
                "overview": "Overview Building start-ups with impact is a unit designed to take what you have developed and learned in BEX2411 Entrepreneurial Mindsets and Capabilities (prerequisite for BEX3411) and bring it to the real world as a venture, not just an idea. This unit is about taking a concept to market and building … For more content click the Read More button below.Building start-ups with impact is a unit designed to take what you have developed and learned in BEX2411 Entrepreneurial Mindsets and Capabilities (prerequisite for BEX3411) and bring it to the real world as a venture, not just an idea. This unit is about taking a concept to market and building a business around it – in a start-up or in an existing firm as an internal venture. You will begin this unit with a concept that you will then build a prototype for, to test and validate in market. Further, you will learn how to develop a service model to make this concept feasible and meet the needs and desires of your target customers and end users. Importantly, you will become skilled at engaging with business modelling techniques to deliver a viable product or service to customers who are willing to pay for it – our challenge to you will be to actually get paying customers by the end of the semester! Once you’ve achieved this, you will be guided to connect and network with investors, companies, community supporters and others in the start-up ecosystem to help you launch and grow.Read More about Overview",
                "offerings": {
                    "S2-01-CAULFIELD-ON-CAMPUS": {
                        "location": [
                            "Caulfield"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CAULFIELD-ONLINE": {
                        "location": [
                            "Caulfield"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "Online"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "BEX2411",
                        "BEX3311"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "FIT3134"
                    ]
                },
                "rules": "You must have completed 72 credit points of study to undertake this unit. "
            }
          },
          {
            "code": "ENG3701",
            "state":14,
            "sem":0,
            "credit points": "6",
            "name": " Entrepreneurial project A",
            "unit_details": {
                "overview": "",
                "offerings": {},
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "ENG3702",
            "state":14,
            "sem":0,
            "credit points": "6",
            "name": "Entrepreneurial project B",
            "unit_details": {
                "overview": "",
                "offerings": {},
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "MEC3010",
            "state":17,
            "sem":1,
            "credit points": "6",
            "name": "Micro and nanotechnologies: Fabrication and applications",
            "unit_details": {
                "overview": "Overview This unit aims to develop an understanding of micro and nanotechnology methods and techniques in a cleanroom environment, the design of process chains and the applications of devices that are currently being manufactured using them.\nMicro and nanofabrication form the basis of manufacturing any modern miniaturised system from computer chips … For more content click the Read More button below.\nThis unit studies the theoretical aspects of micro and nanotechnologies and how these techniques are employed to design manufacturing strategies of micro and nano-systems, considering real case studies of such devices.This unit aims to develop an understanding of micro and nanotechnology methods and techniques in a cleanroom environment, the design of process chains and the applications of devices that are currently being manufactured using them.\nMicro and nanofabrication form the basis of manufacturing any modern miniaturised system from computer chips to sensors and actuators in smartphones, tablets, cars and other vehicles, and diagnostic systems, biomedical devices and devices for environmental monitoring.\nThis unit studies the theoretical aspects of micro and nanotechnologies and how these techniques are employed to design manufacturing strategies of micro and nano-systems, considering real case studies of such devices.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITE: Completion of 18 credit points of level 2 engineering study "
            }
          },
          {
            "code": "CHE3172",
            "state":17,
            "sem":2,
            "credit points": "6",
            "name": "Nanotechnology and materials 1",
            "unit_details": {
                "overview": "Overview This unit introduces the foundation concepts of nanotechnology and nanosynthesis methods, self-assembly of colloids and some characterisation techniques of materials. This unit also covers polymer synthesis and characterisation as well as a number of useful applications of nanotechnology including smart coatings and nanomedicine. The global market and safety associated with … For more content click the Read More button below.This unit introduces the foundation concepts of nanotechnology and nanosynthesis methods, self-assembly of colloids and some characterisation techniques of materials. This unit also covers polymer synthesis and characterisation as well as a number of useful applications of nanotechnology including smart coatings and nanomedicine. The global market and safety associated with nanomaterials and nanotechnology will be described.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "CHM1011",
                        "CHM1022",
                        "CHM1052",
                        "CHM1051"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "MTE4597",
            "state":17,
            "sem":1,
            "credit points": "6",
            "name": "Engineering with nanomaterials",
            "unit_details": {
                "overview": "Overview This unit aims to develop an understanding of synthetic methods, properties and applications of nanomaterials and nanofabrication techniques. The nanomaterials include zero-dimensional nanoparticles, one-dimensional nanostructures (nanotubes, nanorods, nanowires and nanofibres), two-dimensional thin films and three-dimensional nanocomposites. Principles of nanofabrication such as lithography, self-assembly and biomimicry will be introduced. The unit … For more content click the Read More button below.This unit aims to develop an understanding of synthetic methods, properties and applications of nanomaterials and nanofabrication techniques. The nanomaterials include zero-dimensional nanoparticles, one-dimensional nanostructures (nanotubes, nanorods, nanowires and nanofibres), two-dimensional thin films and three-dimensional nanocomposites. Principles of nanofabrication such as lithography, self-assembly and biomimicry will be introduced. The unit will stress the rational design of properties of nanostructured materials and how they may be exploited for every day applications, ranging from food packaging and sunscreens to sensors and energy-related areas.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "MTE2541",
                        "MTE2101",
                        "CHE3172"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "MTE5197"
                    ]
                },
                "rules": null
            }
          },
          {
            "code": "CHE4172",
            "state":17,
            "sem":2,
            "credit points": "6",
            "name": "Nanotechnology and materials 2",
            "unit_details": {
                "overview": "Overview Understanding of synthetic methods, properties and applications of nanomaterials, including zero-dimensional nanoparticles, one-dimensional nanostructures (nanotubes, nanorods, nanowires and nanofibres), two-dimensional thin films, nanoporous materials and nanofabrication techniques such as lithography and self-assembly. Emphasis on advanced nanomaterials and the importance of nanostructured materials used in various chemical engineering applications. Examples of … For more content click the Read More button below.Understanding of synthetic methods, properties and applications of nanomaterials, including zero-dimensional nanoparticles, one-dimensional nanostructures (nanotubes, nanorods, nanowires and nanofibres), two-dimensional thin films, nanoporous materials and nanofabrication techniques such as lithography and self-assembly. Emphasis on advanced nanomaterials and the importance of nanostructured materials used in various chemical engineering applications. Examples of bionanotechnology-inspired nanostructures using biological building blocks in self-assembling processes.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "CHE3172",
                        "MTE2541"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisites: Or MSC2011 "
            }
          },
          {
            "code": "RSE3020",
            "state":16,
            "sem":1,
            "credit points": "6",
            "name": "Resource estimation",
            "unit_details": {
                "overview": "Overview The mineral inventory of a company is quantified through resource or reserve estimates with associated error levels that, in many cases, are unknown. The estimation procedure used by a geologist or engineer should incorporate efforts to minimise errors and assumptions at every level of decision.\nThis unit focuses on resource … For more content click the Read More button below.The mineral inventory of a company is quantified through resource or reserve estimates with associated error levels that, in many cases, are unknown. The estimation procedure used by a geologist or engineer should incorporate efforts to minimise errors and assumptions at every level of decision.\nThis unit focuses on resource and reserve estimation of mineral ores and hydrocarbon deposits, with particular focus on the influence of the in situ geological conditions. You will learn the basics of resource and reserve reporting with particular reference to applicable industry codes. Resource modelling will be taught through computer applications with special consideration of geostatistical techniques.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prohibition: MNE3020 "
            }
          },
          {
            "code": "RSE3040",
            "state":16,
            "sem":2,
            "credit points": "6",
            "name": "Mining systems",
            "unit_details": {
                "overview": "Overview This unit covers underground and surface mining methods and equipment selection for the optimum performance of underground and surface operations. The unit provides a detailed understanding of mining processes and systems engineering along with their key drivers in modern open-cut and underground operations. For each of the mining methods explored … For more content click the Read More button below.This unit covers underground and surface mining methods and equipment selection for the optimum performance of underground and surface operations. The unit provides a detailed understanding of mining processes and systems engineering along with their key drivers in modern open-cut and underground operations. For each of the mining methods explored consideration is given to the mining cycle and access design - eg shafts and/or declines and materials handling. Through practical applications, you will explore the selection of optimal mining systems. For each of the mining systems covered, core risk identification and mitigation are considered.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prohibitions: MNE3040 and MNE3050 "
            }
          },
          {
            "code": "RSE3030",
            "state":16,
            "sem":1,
            "credit points": "6",
            "name": "Ventilation for surface and underground spaces",
            "unit_details": {
                "overview": "Overview This unit provides the fundamentals of ventilation for surface and underground spaces, including properties of air, gas, heat, dust and pollutants control, principles of airflow, ventilation network theory, as well as surface and underground ventilation systems design, with the emphasis on analysis and practical application.This unit provides the fundamentals of ventilation for surface and underground spaces, including properties of air, gas, heat, dust and pollutants control, principles of airflow, ventilation network theory, as well as surface and underground ventilation systems design, with the emphasis on analysis and practical application.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "CIV2263",
                        "MEC2404",
                        "CHE2161"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prohibition: MNE3030 "
            }
          },
          {
            "code": "RSE4010",
            "state":16,
            "sem":2,
            "credit points": "6",
            "name": "Mine planning and scheduling",
            "unit_details": {
                "overview": "Overview This unit deals with the theoretical principles and practical methodologies associated with mine planning and scheduling. Mine planning is an interactive process that includes elements of design, scheduling and evaluation. As part of the planning process, a range of issues has to be considered including, short and long-term planning, mine … For more content click the Read More button below.This unit deals with the theoretical principles and practical methodologies associated with mine planning and scheduling. Mine planning is an interactive process that includes elements of design, scheduling and evaluation. As part of the planning process, a range of issues has to be considered including, short and long-term planning, mine optimisation, cut-off grade analysis and mine evaluation. The unit applies mine planning and scheduling techniques to a case-study project in current state-of-the-art software.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "RSE3020",
                        "RSE3040"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisite: Or MNE3020 and MNE3040 Prohibition: MNE4010 "
            }
          },
          {
            "code": "RSE3141",
            "state":18,
            "sem":1,
            "credit points": "6",
            "name": "Solar energy",
            "unit_details": {
                "overview": "Overview This unit covers concepts associated with the solar energy industry including; the characteristics of solar radiation and solar collectors including efficiency evaluation and prediction of long-term performance; system modelling; energy storage; computer simulation and modelling of performance and the economics and financing of solar energy projects.This unit covers concepts associated with the solar energy industry including; the characteristics of solar radiation and solar collectors including efficiency evaluation and prediction of long-term performance; system modelling; energy storage; computer simulation and modelling of performance and the economics and financing of solar energy projects.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG2005",
                        "MTH2010",
                        "MTH2015"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "RSE3241",
            "state":18,
            "sem":2,
            "credit points": "6",
            "name": "Hydropower",
            "unit_details": {
                "overview": "Overview This unit covers all aspects of hydropower, including the fundamental physics behind energy storage in potential energy, design of hydropower systems (dam walls and reservoirs, penstock piping and tunnelling, power house design (turbine and generator), tailrace and electrical connection). The operation of hydropower stations and their influence on the integrated … For more content click the Read More button below.This unit covers all aspects of hydropower, including the fundamental physics behind energy storage in potential energy, design of hydropower systems (dam walls and reservoirs, penstock piping and tunnelling, power house design (turbine and generator), tailrace and electrical connection). The operation of hydropower stations and their influence on the integrated electrical system. The unit covers recent developments in hydropower, in particular, the current trend towards more pumped hydro energy storage. Lectures will be delivered by both academic staff and industry experts who work on real-world hydropower projects.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005",
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "RSE3242",
            "state":18,
            "sem":1,
            "credit points": "6",
            "name": "Geothermal energy",
            "unit_details": {
                "overview": "Overview This unit offers you a practical introduction to all aspects of geothermal energy. The course covers the development of geothermal energy sources for power (from exploration to development and production), as well as alternative uses for these resources. You will learn about the fundamental processes involved in heat and mass … For more content click the Read More button below.This unit offers you a practical introduction to all aspects of geothermal energy. The course covers the development of geothermal energy sources for power (from exploration to development and production), as well as alternative uses for these resources. You will learn about the fundamental processes involved in heat and mass transport in the subsurface, as well as the physics and chemistry involved in electricity production. The course also covers recent developments in geothermal energy - new drilling techniques, enhanced geothermal systems, mineral co-production and low-temperature geothermal systems. You will also be provided with an introduction to the economics surrounding geothermal energy systems.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "RSE3243",
            "state":18,
            "sem":2,
            "credit points": "6",
            "name": "Bioenergy",
            "unit_details": {
                "overview": "Overview This unit provides foundational knowledge of the bioenergy industry, including feedstocks, processing and end-use of products. The unit provides insight into biomass energy resources and bioenergy technologies, including the properties and characteristics of the resources, conversion and utilisation processes, as well as industrial application. Economic cost-effectiveness will be examined. You … For more content click the Read More button below.This unit provides foundational knowledge of the bioenergy industry, including feedstocks, processing and end-use of products. The unit provides insight into biomass energy resources and bioenergy technologies, including the properties and characteristics of the resources, conversion and utilisation processes, as well as industrial application. Economic cost-effectiveness will be examined. You will also conduct a lifecycle analysis of the various pathways to determine the energy return on energy invested. Other issues, such as impacts on food availability, land availability and the social and political impacts, will also be covered.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "TRC3000",
            "state":19,
            "sem":2,
            "credit points": "6",
            "name": "Automation project",
            "unit_details": {
                "overview": "Overview You will learn the planning and communication skills required to undertake a group project. An introduction will be given to the evolution of mechatronic technologies, design tools and methodologies, concurrent engineering design support tools, mechatronics design process and requirement interpretation. The acquisition of these skills will be motivated and tested … For more content click the Read More button below.You will learn the planning and communication skills required to undertake a group project. An introduction will be given to the evolution of mechatronic technologies, design tools and methodologies, concurrent engineering design support tools, mechatronics design process and requirement interpretation. The acquisition of these skills will be motivated and tested by applying them in a group project to design and build a mechatronic system. The mechatronic system will be based on a microcontroller together with appropriate mechanical structure, sensors and actuators.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "TRC4407"
                    ]
                },
                "rules": "PREREQUISITE: Completion of 18 credit points of level 2 engineering study "
            }
          },
          {
            "code": "TRC4200",
            "state":19,
            "sem":1,
            "credit points": "6",
            "name": "Engineering cyber-physical systems",
            "unit_details": {
                "overview": "Overview The unit aims to impart knowledge, skills, and experience required to prepare graduates for the impending digital transformation driving the convergence of technologies that result in Cyber-Physical Systems (CPS). An introduction will be given to Cyber-Physical Systems (CPS). The evolution of key technologies, transformation to digital chains and the need … For more content click the Read More button below.The unit aims to impart knowledge, skills, and experience required to prepare graduates for the impending digital transformation driving the convergence of technologies that result in Cyber-Physical Systems (CPS). An introduction will be given to Cyber-Physical Systems (CPS). The evolution of key technologies, transformation to digital chains and the need to seamlessly combine organisational and technological issues into a single framework will be discussed. A real-life scenario will be used to motivate you to apply CPS technologies to design and develop Smart Systems in any domain of their specialisation and interest. Using the concept of Learning Factories (LF) - a platform to impart experience-based knowledge - the developed solution will be built and tested as a group project.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "MEC3457",
                        "MAE3408",
                        "MEC2402",
                        "ECE3091"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Additional prerequisite:\nCompletion of 96 credit points of engineering study which includes the prerequisite units mentioned. "
            }
          },
          {
            "code": "TRC4902",
            "state":19,
            "sem":2,
            "credit points": "6",
            "name": "Mechatronics and manufacturing",
            "unit_details": {
                "overview": "Overview This unit aims to develop an understanding of the mechatronic engineer's role in the manufacturing industry, manufacturing processes including 3D printing, fundamentals and automation using a CNC controller. Different manufacturing systems: cellular and flexible manufacturing systems will be analysed. Recent advancement in the industry: Industry 4.0 and digital twins will … For more content click the Read More button below.This unit aims to develop an understanding of the mechatronic engineer's role in the manufacturing industry, manufacturing processes including 3D printing, fundamentals and automation using a CNC controller. Different manufacturing systems: cellular and flexible manufacturing systems will be analysed. Recent advancement in the industry: Industry 4.0 and digital twins will be introduced. Modern manufacturing management will be presented and discussed to improve quality and productivity by removing non-value added processes to reduce the production cycle and increase the product life-cycle. This will include lean manufacturing, agile manufacturing and virtual manufacturing. This unit also includes the design of flexible manufacturing systems which is capable of producing a variety of products. The manufacturing support systems such as process planning and control and computer-aided process planning using a variant technique and a generative process planning technique with Artificial Intelligence (AI) will be covered in this unit. Finally, the design of flexible manufacturing systems for a variety of products will be studied to reduce production lot size and the design of assembly manufacturing lines will be optimised.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "MEC2402",
                        "TRC3000"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "If you are currently enrolled in E6013 Master of Applied Engineering, you are exempt from the prerequisites requirement. "
            }
          },
          {
            "code": "ECE3141",
            "state":19,
            "sem":1,
            "credit points": "6",
            "name": "Information and networks",
            "unit_details": {
                "overview": "Overview This unit provides an introduction to underlying technologies, major components and system-wide architectures of modern telecommunication systems. After introducing concepts of block and stream delivery, requirements of a telecommunications network and representation of analogue signals (e.g. voice and video) in digital form, the unit will cover all the major functions … For more content click the Read More button below.This unit provides an introduction to underlying technologies, major components and system-wide architectures of modern telecommunication systems. After introducing concepts of block and stream delivery, requirements of a telecommunications network and representation of analogue signals (e.g. voice and video) in digital form, the unit will cover all the major functions in layered architectures. Topics to be covered include multiplexing, basic line transmission and modulation, error protection and correction, packet switching, LAN protocols and the TCP/IP protocols on which the Internet is built. Particular emphasis is given to the major functions that combine to allow communication across key modern digital telecommunication systems such as the Internet, mobile telephony, digital TV and Digital Audio Broadcasting.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ECE2041"
                    ]
                },
                "rules": "Prerequisite: VCE specialist mathematics and physics or equivalent units "
            }
          },
          {
            "code": "ENE4042",
            "state":20,
            "sem":1,
            "credit points": "6",
            "name": "Environmental impact and risk assessment",
            "unit_details": {
                "overview": "Overview This unit aims to develop an understanding of the role and basis for environmental impact assessment (EIA), environmental risk assessment (ERA) and environmental management systems (EMS). The unit focuses on the processes involved in producing a comprehensive approach to identifying, assessing and planning management processes, with a particular emphasis on … For more content click the Read More button below.This unit aims to develop an understanding of the role and basis for environmental impact assessment (EIA), environmental risk assessment (ERA) and environmental management systems (EMS). The unit focuses on the processes involved in producing a comprehensive approach to identifying, assessing and planning management processes, with a particular emphasis on synthesising technical, regulatory and community issues. The unit aims to encourage you to integrate your existing knowledge in environmental engineering, applying it to real projects. Through lectures, practice classes, individual assignments and group project work, you should develop skills and knowledge in preparing major EIA, ERA and EMS reports, your presentation and communication as well as your engineering context.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [
                        "ENE3608",
                        "ENE4607"
                    ],
                    "AND": []
                },
                "rules": "Prerequisites: Completion of 96 credit points in engineering study or with permission "
            }
          },
          {
            "code": "MTE4593",
            "state":20,
            "sem":2,
            "credit points": "6",
            "name": "Materials and sustainability",
            "unit_details": {
                "overview": "Overview This unit provides an introduction to the political, social and environmental background to materials usage. Major technologies relating to the production, sustainable use and recycling of metals, plastics, glass, electronics, paper and ceramic materials are discussed. Various options involving materials substitution, reclamation, energy recovery and disposal are critically evaluated. The … For more content click the Read More button below.This unit provides an introduction to the political, social and environmental background to materials usage. Major technologies relating to the production, sustainable use and recycling of metals, plastics, glass, electronics, paper and ceramic materials are discussed. Various options involving materials substitution, reclamation, energy recovery and disposal are critically evaluated. The unit considers the economics of materials production, as well as 'cradle-to-grave' analyses of materials, including products and byproducts of the nuclear fuel cycle. In particular, it looks at various life-cycle analysis techniques. We will examine the impact of population, affluence and technology changes on population and ecological footprints with the arrival of the current \"Anthropocene Era\".Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "MTE5193"
                    ]
                },
                "rules": "PREREQUISITE: Completion of 96 credit points in engineering study "
            }
          },
          {
            "code": "ENE2021",
            "state":20,
            "sem":1,
            "credit points": "6",
            "name": "Energy and the environment",
            "unit_details": {
                "overview": "Overview Energy is all around us. From powering household appliances and gas heaters to driving a car across town, it is responsible for making everything that involves movement or activity happen. Although energy cannot be created or destroyed, it is still important for the available energy within our environment to be … For more content click the Read More button below.\nThis unit provides a qualitative and quantitative survey of the physics behind conventional and alternative energy sources. The choice of energy source is also assessed in terms of its environmental impacts, its dependence on critical or scarce resources and the social or political consequences of reliance on that energy source concerning long-term sustainability. Building services and transport are among the largest end-use sectors responsible for energy consumption. Their energy efficiency and decarbonisation will be reviewed. Electricity is one of the most important energy commodities. The discussion on its generation, supply and demand will be expanded.Energy is all around us. From powering household appliances and gas heaters to driving a car across town, it is responsible for making everything that involves movement or activity happen. Although energy cannot be created or destroyed, it is still important for the available energy within our environment to be conserved and used wisely. Our decisions on how we use energy impact the plant's natural systems in complex ways. It is vital that we choose our energy sources carefully and be mindful of the amount of energy we use. The true cost of energy is more than just dollars and cents; there are important environmental and political factors and consequences to consider.\nThis unit provides a qualitative and quantitative survey of the physics behind conventional and alternative energy sources. The choice of energy source is also assessed in terms of its environmental impacts, its dependence on critical or scarce resources and the social or political consequences of reliance on that energy source concerning long-term sustainability. Building services and transport are among the largest end-use sectors responsible for energy consumption. Their energy efficiency and decarbonisation will be reviewed. Electricity is one of the most important energy commodities. The discussion on its generation, supply and demand will be expanded.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ECE3051"
                    ]
                },
                "rules": null
            }
          },
          {
            "code": "ENE3031",
            "state":20,
            "sem":2,
            "credit points": "6",
            "name": "Building sustainability",
            "unit_details": {
                "overview": "Overview This unit will address issues of sustainability in the built environments from a number of perspectives and provide you with a variety of lenses in which the built environments interlock with the human and natural system. You will apply skills and knowledge from this unit, and use a rigorous process … For more content click the Read More button below.This unit will address issues of sustainability in the built environments from a number of perspectives and provide you with a variety of lenses in which the built environments interlock with the human and natural system. You will apply skills and knowledge from this unit, and use a rigorous process of design, simulation, validation, and evaluation, to solve real-world problems. Topics include passive and active technologies, building energy simulation and modelling of different domains in indoor environmental quality, field data acquisition and analysis, building codes and rating system, and the topics intersecting with other fields, such as ubiquitous computing, architecture design, public health, high-performance materials, etc.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG2005",
                        "ENE2503"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
          },
          {
            "code": "CIV4268",
            "state":20,
            "sem":2,
            "credit points": "6",
            "name": "Water resources management",
            "unit_details": {
                "overview": "Overview This unit considers the quality and quantity aspects of water resources management. Tools and techniques appropriate for design and analysis of water resource systems are introduced, starting from a development of quantitative hydrologic modelling and extending to quantitative prediction of water quality transformations. The fundamental principles of water quantity and … For more content click the Read More button below.This unit considers the quality and quantity aspects of water resources management. Tools and techniques appropriate for design and analysis of water resource systems are introduced, starting from a development of quantitative hydrologic modelling and extending to quantitative prediction of water quality transformations. The fundamental principles of water quantity and quality modelling are also applied within a framework that allows the assessment of water quality in various watercourses.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITE: Completion of 96 cp in engineering study (ENG2005 included) "
            }
          }
    ]
}