{
    "code": "ENTENMNR02",
    "credit points": "24",
    "name": "Engineering entrepreneurship",
    "units": [
        {
            "code": "BEX3311",
            "credit points": "6",
            "name": "Entrepreneurial mindsets and capabilities",
            "unit_details": {
                "overview": "Overview Entrepreneurship and innovation are driven by our ability to interrogate the world around us and think critically to identify challenges and opportunities worth exploring. The ability to make sense of, and create insight from a problem space or context, powers creative and innovative solutions. Furthermore, the ability to systematically employ … For more content click the Read More button below.\nThis unit provides you with an overall understanding of entrepreneurship and innovation, with a deep dive into cutting edge industry-informed and designed ways of working and hands-on experience in problem exploration. We use design-driven and innovation-focused research, analysis and synthesis tools and techniques to help you tackle a challenge space of your choosing. The unit takes you through human-centred approaches and requires the generation of novel concepts, solutions and tangible concepts to validate with target customers and/or end-users, culminating in an Industry Showcase.\nWhether you want to establish a start-up, work in corporate innovation, or just have a really great toolkit to help you do any job better, this unit will give you the right foundations.Entrepreneurship and innovation are driven by our ability to interrogate the world around us and think critically to identify challenges and opportunities worth exploring. The ability to make sense of, and create insight from a problem space or context, powers creative and innovative solutions. Furthermore, the ability to systematically employ creative thinking and to develop prototypes and approaches to validate hypotheses are crucial skills for entrepreneurs and innovators.\nThis unit provides you with an overall understanding of entrepreneurship and innovation, with a deep dive into cutting edge industry-informed and designed ways of working and hands-on experience in problem exploration. We use design-driven and innovation-focused research, analysis and synthesis tools and techniques to help you tackle a challenge space of your choosing. The unit takes you through human-centred approaches and requires the generation of novel concepts, solutions and tangible concepts to validate with target customers and/or end-users, culminating in an Industry Showcase.\nWhether you want to establish a start-up, work in corporate innovation, or just have a really great toolkit to help you do any job better, this unit will give you the right foundations.Read More about Overview",
                "offerings": {
                    "S1-01-CAULFIELD-ON-CAMPUS": {
                        "location": [
                            "Caulfield"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-CAULFIELD-ONLINE": {
                        "location": [
                            "Caulfield"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "Online"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "You must have completed 72 credit points of study to undertake this unit. "
            }
        },
        {
            "code": "BEX3411",
            "credit points": "6",
            "name": "Building start-ups with impact",
            "unit_details": {
                "overview": "Overview Building start-ups with impact is a unit designed to take what you have developed and learned in BEX2411 Entrepreneurial Mindsets and Capabilities (prerequisite for BEX3411) and bring it to the real world as a venture, not just an idea. This unit is about taking a concept to market and building … For more content click the Read More button below.Building start-ups with impact is a unit designed to take what you have developed and learned in BEX2411 Entrepreneurial Mindsets and Capabilities (prerequisite for BEX3411) and bring it to the real world as a venture, not just an idea. This unit is about taking a concept to market and building a business around it – in a start-up or in an existing firm as an internal venture. You will begin this unit with a concept that you will then build a prototype for, to test and validate in market. Further, you will learn how to develop a service model to make this concept feasible and meet the needs and desires of your target customers and end users. Importantly, you will become skilled at engaging with business modelling techniques to deliver a viable product or service to customers who are willing to pay for it – our challenge to you will be to actually get paying customers by the end of the semester! Once you’ve achieved this, you will be guided to connect and network with investors, companies, community supporters and others in the start-up ecosystem to help you launch and grow.Read More about Overview",
                "offerings": {
                    "S2-01-CAULFIELD-ON-CAMPUS": {
                        "location": [
                            "Caulfield"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-CAULFIELD-ONLINE": {
                        "location": [
                            "Caulfield"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "Online"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "BEX2411",
                        "BEX3311"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "FIT3134"
                    ]
                },
                "rules": "You must have completed 72 credit points of study to undertake this unit. "
            }
        },
        {
            "code": "ENG3701",
            "credit points": "6",
            "name": " Entrepreneurial project A",
            "unit_details": {
                "overview": "",
                "offerings": {},
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "ENG3702",
            "credit points": "6",
            "name": "Entrepreneurial project B",
            "unit_details": {
                "overview": "",
                "offerings": {},
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        }
    ]
}