{
    "code": "MNTENMNR02",
    "credit points": "24",
    "name": "Micro and nano technologies",
    "units": [
        {
            "code": "MEC3010",
            "credit points": "6",
            "name": "Micro and nanotechnologies: Fabrication and applications",
            "unit_details": {
                "overview": "Overview This unit aims to develop an understanding of micro and nanotechnology methods and techniques in a cleanroom environment, the design of process chains and the applications of devices that are currently being manufactured using them.\nMicro and nanofabrication form the basis of manufacturing any modern miniaturised system from computer chips … For more content click the Read More button below.\nThis unit studies the theoretical aspects of micro and nanotechnologies and how these techniques are employed to design manufacturing strategies of micro and nano-systems, considering real case studies of such devices.This unit aims to develop an understanding of micro and nanotechnology methods and techniques in a cleanroom environment, the design of process chains and the applications of devices that are currently being manufactured using them.\nMicro and nanofabrication form the basis of manufacturing any modern miniaturised system from computer chips to sensors and actuators in smartphones, tablets, cars and other vehicles, and diagnostic systems, biomedical devices and devices for environmental monitoring.\nThis unit studies the theoretical aspects of micro and nanotechnologies and how these techniques are employed to design manufacturing strategies of micro and nano-systems, considering real case studies of such devices.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITE: Completion of 18 credit points of level 2 engineering study "
            }
        },
        {
            "code": "CHE3172",
            "credit points": "6",
            "name": "Nanotechnology and materials 1",
            "unit_details": {
                "overview": "Overview This unit introduces the foundation concepts of nanotechnology and nanosynthesis methods, self-assembly of colloids and some characterisation techniques of materials. This unit also covers polymer synthesis and characterisation as well as a number of useful applications of nanotechnology including smart coatings and nanomedicine. The global market and safety associated with … For more content click the Read More button below.This unit introduces the foundation concepts of nanotechnology and nanosynthesis methods, self-assembly of colloids and some characterisation techniques of materials. This unit also covers polymer synthesis and characterisation as well as a number of useful applications of nanotechnology including smart coatings and nanomedicine. The global market and safety associated with nanomaterials and nanotechnology will be described.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "CHM1011",
                        "CHM1022",
                        "CHM1052",
                        "CHM1051"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "MTE4597",
            "credit points": "6",
            "name": "Engineering with nanomaterials",
            "unit_details": {
                "overview": "Overview This unit aims to develop an understanding of synthetic methods, properties and applications of nanomaterials and nanofabrication techniques. The nanomaterials include zero-dimensional nanoparticles, one-dimensional nanostructures (nanotubes, nanorods, nanowires and nanofibres), two-dimensional thin films and three-dimensional nanocomposites. Principles of nanofabrication such as lithography, self-assembly and biomimicry will be introduced. The unit … For more content click the Read More button below.This unit aims to develop an understanding of synthetic methods, properties and applications of nanomaterials and nanofabrication techniques. The nanomaterials include zero-dimensional nanoparticles, one-dimensional nanostructures (nanotubes, nanorods, nanowires and nanofibres), two-dimensional thin films and three-dimensional nanocomposites. Principles of nanofabrication such as lithography, self-assembly and biomimicry will be introduced. The unit will stress the rational design of properties of nanostructured materials and how they may be exploited for every day applications, ranging from food packaging and sunscreens to sensors and energy-related areas.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "MTE2541",
                        "MTE2101",
                        "CHE3172"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "MTE5197"
                    ]
                },
                "rules": null
            }
        },
        {
            "code": "CHE4172",
            "credit points": "6",
            "name": "Nanotechnology and materials 2",
            "unit_details": {
                "overview": "Overview Understanding of synthetic methods, properties and applications of nanomaterials, including zero-dimensional nanoparticles, one-dimensional nanostructures (nanotubes, nanorods, nanowires and nanofibres), two-dimensional thin films, nanoporous materials and nanofabrication techniques such as lithography and self-assembly. Emphasis on advanced nanomaterials and the importance of nanostructured materials used in various chemical engineering applications. Examples of … For more content click the Read More button below.Understanding of synthetic methods, properties and applications of nanomaterials, including zero-dimensional nanoparticles, one-dimensional nanostructures (nanotubes, nanorods, nanowires and nanofibres), two-dimensional thin films, nanoporous materials and nanofabrication techniques such as lithography and self-assembly. Emphasis on advanced nanomaterials and the importance of nanostructured materials used in various chemical engineering applications. Examples of bionanotechnology-inspired nanostructures using biological building blocks in self-assembling processes.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "CHE3172",
                        "MTE2541"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "Prerequisites: Or MSC2011 "
            }
        }
    ]
}