{
    "code": "SUSENMNR03",
    "credit points": "24",
    "name": "Sustainable engineering",
    "units": [
        {
            "code": "CHE3163",
            "credit points": "6",
            "name": "Sustainable processing 1",
            "unit_details": {
                "overview": "Overview This unit will explore cleaner production and sustainability concepts, the principles of process design and development and associated flow sheets, systematic approaches to waste minimisation in process and utility systems, the methodology of life cycle assessment and application of life cycle assessment to processes and products. These themes will be … For more content click the Read More button below.This unit will explore cleaner production and sustainability concepts, the principles of process design and development and associated flow sheets, systematic approaches to waste minimisation in process and utility systems, the methodology of life cycle assessment and application of life cycle assessment to processes and products. These themes will be developed in lectures and supported by your project work related to selected industrial processes.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "CHE2162"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "CHE4173",
            "credit points": "6",
            "name": "Sustainable processing 2",
            "unit_details": {
                "overview": "Overview This unit will explore heat integration, water integration and recycling of process streams to achieve improved resource efficiencies and waste reduction, the identification and minimisation of waste in reactors and separation processes, natural cycles, pollution mechanisms and effects, strategies for improved industrial ecology and the role of regulatory and economic … For more content click the Read More button below.This unit will explore heat integration, water integration and recycling of process streams to achieve improved resource efficiencies and waste reduction, the identification and minimisation of waste in reactors and separation processes, natural cycles, pollution mechanisms and effects, strategies for improved industrial ecology and the role of regulatory and economic drivers in cleaner production. These themes will be developed in lectures and be supported by student project work related to selected industrial processes.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S1-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "CHE2162"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITES: Completion of 96 credit points (including CHE2162) "
            }
        },
        {
            "code": "RSE3243",
            "credit points": "6",
            "name": "Bioenergy",
            "unit_details": {
                "overview": "Overview This unit provides foundational knowledge of the bioenergy industry, including feedstocks, processing and end-use of products. The unit provides insight into biomass energy resources and bioenergy technologies, including the properties and characteristics of the resources, conversion and utilisation processes, as well as industrial application. Economic cost-effectiveness will be examined. You … For more content click the Read More button below.This unit provides foundational knowledge of the bioenergy industry, including feedstocks, processing and end-use of products. The unit provides insight into biomass energy resources and bioenergy technologies, including the properties and characteristics of the resources, conversion and utilisation processes, as well as industrial application. Economic cost-effectiveness will be examined. You will also conduct a lifecycle analysis of the various pathways to determine the energy return on energy invested. Other issues, such as impacts on food availability, land availability and the social and political impacts, will also be covered.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "ENE4042",
            "credit points": "6",
            "name": "Environmental impact and risk assessment",
            "unit_details": {
                "overview": "Overview This unit aims to develop an understanding of the role and basis for environmental impact assessment (EIA), environmental risk assessment (ERA) and environmental management systems (EMS). The unit focuses on the processes involved in producing a comprehensive approach to identifying, assessing and planning management processes, with a particular emphasis on … For more content click the Read More button below.This unit aims to develop an understanding of the role and basis for environmental impact assessment (EIA), environmental risk assessment (ERA) and environmental management systems (EMS). The unit focuses on the processes involved in producing a comprehensive approach to identifying, assessing and planning management processes, with a particular emphasis on synthesising technical, regulatory and community issues. The unit aims to encourage you to integrate your existing knowledge in environmental engineering, applying it to real projects. Through lectures, practice classes, individual assignments and group project work, you should develop skills and knowledge in preparing major EIA, ERA and EMS reports, your presentation and communication as well as your engineering context.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [
                        "ENE3608",
                        "ENE4607"
                    ],
                    "AND": []
                },
                "rules": "Prerequisites: Completion of 96 credit points in engineering study or with permission "
            }
        },
        {
            "code": "MTE4593",
            "credit points": "6",
            "name": "Materials and sustainability",
            "unit_details": {
                "overview": "Overview This unit provides an introduction to the political, social and environmental background to materials usage. Major technologies relating to the production, sustainable use and recycling of metals, plastics, glass, electronics, paper and ceramic materials are discussed. Various options involving materials substitution, reclamation, energy recovery and disposal are critically evaluated. The … For more content click the Read More button below.This unit provides an introduction to the political, social and environmental background to materials usage. Major technologies relating to the production, sustainable use and recycling of metals, plastics, glass, electronics, paper and ceramic materials are discussed. Various options involving materials substitution, reclamation, energy recovery and disposal are critically evaluated. The unit considers the economics of materials production, as well as 'cradle-to-grave' analyses of materials, including products and byproducts of the nuclear fuel cycle. In particular, it looks at various life-cycle analysis techniques. We will examine the impact of population, affluence and technology changes on population and ecological footprints with the arrival of the current \"Anthropocene Era\".Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "MTE5193"
                    ]
                },
                "rules": "PREREQUISITE: Completion of 96 credit points in engineering study "
            }
        },
        {
            "code": "ENE2021",
            "credit points": "6",
            "name": "Energy and the environment",
            "unit_details": {
                "overview": "Overview Energy is all around us. From powering household appliances and gas heaters to driving a car across town, it is responsible for making everything that involves movement or activity happen. Although energy cannot be created or destroyed, it is still important for the available energy within our environment to be … For more content click the Read More button below.\nThis unit provides a qualitative and quantitative survey of the physics behind conventional and alternative energy sources. The choice of energy source is also assessed in terms of its environmental impacts, its dependence on critical or scarce resources and the social or political consequences of reliance on that energy source concerning long-term sustainability. Building services and transport are among the largest end-use sectors responsible for energy consumption. Their energy efficiency and decarbonisation will be reviewed. Electricity is one of the most important energy commodities. The discussion on its generation, supply and demand will be expanded.Energy is all around us. From powering household appliances and gas heaters to driving a car across town, it is responsible for making everything that involves movement or activity happen. Although energy cannot be created or destroyed, it is still important for the available energy within our environment to be conserved and used wisely. Our decisions on how we use energy impact the plant's natural systems in complex ways. It is vital that we choose our energy sources carefully and be mindful of the amount of energy we use. The true cost of energy is more than just dollars and cents; there are important environmental and political factors and consequences to consider.\nThis unit provides a qualitative and quantitative survey of the physics behind conventional and alternative energy sources. The choice of energy source is also assessed in terms of its environmental impacts, its dependence on critical or scarce resources and the social or political consequences of reliance on that energy source concerning long-term sustainability. Building services and transport are among the largest end-use sectors responsible for energy consumption. Their energy efficiency and decarbonisation will be reviewed. Electricity is one of the most important energy commodities. The discussion on its generation, supply and demand will be expanded.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "ECE3051"
                    ]
                },
                "rules": null
            }
        },
        {
            "code": "ENE3031",
            "credit points": "6",
            "name": "Building sustainability",
            "unit_details": {
                "overview": "Overview This unit will address issues of sustainability in the built environments from a number of perspectives and provide you with a variety of lenses in which the built environments interlock with the human and natural system. You will apply skills and knowledge from this unit, and use a rigorous process … For more content click the Read More button below.This unit will address issues of sustainability in the built environments from a number of perspectives and provide you with a variety of lenses in which the built environments interlock with the human and natural system. You will apply skills and knowledge from this unit, and use a rigorous process of design, simulation, validation, and evaluation, to solve real-world problems. Topics include passive and active technologies, building energy simulation and modelling of different domains in indoor environmental quality, field data acquisition and analysis, building codes and rating system, and the topics intersecting with other fields, such as ubiquitous computing, architecture design, public health, high-performance materials, etc.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [
                        "ENG2005",
                        "ENE2503"
                    ],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": null
            }
        },
        {
            "code": "CIV4268",
            "credit points": "6",
            "name": "Water resources management",
            "unit_details": {
                "overview": "Overview This unit considers the quality and quantity aspects of water resources management. Tools and techniques appropriate for design and analysis of water resource systems are introduced, starting from a development of quantitative hydrologic modelling and extending to quantitative prediction of water quality transformations. The fundamental principles of water quantity and … For more content click the Read More button below.This unit considers the quality and quantity aspects of water resources management. Tools and techniques appropriate for design and analysis of water resource systems are introduced, starting from a development of quantitative hydrologic modelling and extending to quantitative prediction of water quality transformations. The fundamental principles of water quantity and quality modelling are also applied within a framework that allows the assessment of water quality in various watercourses.Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    },
                    "S2-01-MALAYSIA-ON-CAMPUS": {
                        "location": [
                            "Malaysia"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": [
                        "ENG2005"
                    ]
                },
                "prohibition": {
                    "OR": [],
                    "AND": []
                },
                "rules": "PREREQUISITE: Completion of 96 cp in engineering study (ENG2005 included) "
            }
        },
        {
            "code": "ENE4042",
            "credit points": "6",
            "name": "Environmental impact and risk assessment",
            "unit_details": {
                "overview": "Overview This unit aims to develop an understanding of the role and basis for environmental impact assessment (EIA), environmental risk assessment (ERA) and environmental management systems (EMS). The unit focuses on the processes involved in producing a comprehensive approach to identifying, assessing and planning management processes, with a particular emphasis on … For more content click the Read More button below.This unit aims to develop an understanding of the role and basis for environmental impact assessment (EIA), environmental risk assessment (ERA) and environmental management systems (EMS). The unit focuses on the processes involved in producing a comprehensive approach to identifying, assessing and planning management processes, with a particular emphasis on synthesising technical, regulatory and community issues. The unit aims to encourage you to integrate your existing knowledge in environmental engineering, applying it to real projects. Through lectures, practice classes, individual assignments and group project work, you should develop skills and knowledge in preparing major EIA, ERA and EMS reports, your presentation and communication as well as your engineering context.Read More about Overview",
                "offerings": {
                    "S1-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "First semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [
                        "ENE3608",
                        "ENE4607"
                    ],
                    "AND": []
                },
                "rules": "Prerequisites: Completion of 96 credit points in engineering study or with permission "
            }
        },
        {
            "code": "MTE4593",
            "credit points": "6",
            "name": "Materials and sustainability",
            "unit_details": {
                "overview": "Overview This unit provides an introduction to the political, social and environmental background to materials usage. Major technologies relating to the production, sustainable use and recycling of metals, plastics, glass, electronics, paper and ceramic materials are discussed. Various options involving materials substitution, reclamation, energy recovery and disposal are critically evaluated. The … For more content click the Read More button below.This unit provides an introduction to the political, social and environmental background to materials usage. Major technologies relating to the production, sustainable use and recycling of metals, plastics, glass, electronics, paper and ceramic materials are discussed. Various options involving materials substitution, reclamation, energy recovery and disposal are critically evaluated. The unit considers the economics of materials production, as well as 'cradle-to-grave' analyses of materials, including products and byproducts of the nuclear fuel cycle. In particular, it looks at various life-cycle analysis techniques. We will examine the impact of population, affluence and technology changes on population and ecological footprints with the arrival of the current \"Anthropocene Era\".Read More about Overview",
                "offerings": {
                    "S2-01-CLAYTON-ON-CAMPUS": {
                        "location": [
                            "Clayton"
                        ],
                        "teaching_period": "Second semester",
                        "Attendance_mode": [
                            "On-campus"
                        ]
                    }
                },
                "prerequisite": {
                    "OR": [],
                    "AND": []
                },
                "prohibition": {
                    "OR": [],
                    "AND": [
                        "MTE5193"
                    ]
                },
                "rules": "PREREQUISITE: Completion of 96 credit points in engineering study "
            }
        }
    ]
}